[{"source": "abcnews", "title": "Casten introduces new privileged resolution to force release of Gaetz report", "link": "https://abcnews.go.com/Politics/casten-introduces-new-privileged-resolution-force-ethics-committee/story?id=116422629", "content": "The new resolution includes examples of reports released on former members.\nIllinois Democratic Rep. Sean Casten on Tuesday afternoon introduced anupdated privileged resolutionto try to force the bipartisan House Ethics Committee to release its investigative report on former Florida Rep. Matt Gaetz, who was President-elect Donald Trump's selection as attorney general.\n“Be it resolved that the Committee on Ethics of the House of Representatives shall immediately release the latest draft of its report and a summary of its findings to the public, including any conclusions, draft reports, recommendations, attachments, exhibits and accompanying materials with such redactions as may be necessary and appropriate to protect sensitive information, including witness identities relating to its investigation into allegations against former Representative Matt Gaetz,” Casten said, reading the full resolution on the House floor.\nSpeaker Mike Johnson has opposed releasing the report, saying that the Ethics Committee customarily drops its investigations once a member has left Congress.\nRep. Casten’s updated resolution includes several previous examples of the committee releasing reports on former members of Congress.\nThe House must hold a vote on the resolution within two legislative days, meaning it will occur on Wednesday or Thursday. Republican leadership is expected to introduce a motion to table it once the resolution hits the floor for a vote.\nThe move by Casten comes as the Ethics Committee is slated to meet on Thursday to discuss the Gaetz report.\nPrior to Gaetz withdrawing from consideration as attorney general, Casten had led 97 House Democrats with aletterthat requested a release of the report. Democrats would need a handful of Republicans to cross party lines for the move to be successful.\nCasten remained adamant that the report should be released, regardless of Gaetz withdrawing.\n\"No workplace would allow that information to be swept under the rug simply because someone resigned for office,\" Casten told ABC News last month. \"It matters for the integrity of the law. It matters for the integrity of this House, and it matters for the respect that we expect the American people to give us, that those of us entrusted with this job will uphold the United States as a land where all are treated equally under the law.\"\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Biden, during Angola visit, speaks of 'shared history' of slavery", "link": "https://abcnews.go.com/Politics/biden-angola-visit-speaks-shared-history-slavery/story?id=116406223", "content": "He spoke at a museum where millions of African slaves were baptized.\nPresident Joe Biden on Tuesday, during his diplomatic trip to Angola, acknowledged America's \"original sin\" of slavery and the slave trade that once connected theUnited Statesand the African nation.\n\"I've learned that while history can be hidden, it cannot and should not be erased,\" Biden said. \"It should be faced. It's our duty to face our history. The good, the bad and the ugly. The whole truth. That's what great nations do.\"\nThe remarks were delivered at the National Museum of Slavery, where Biden said millions of Africans were baptized into a \"foreign faith against their will\" before being forced into slave ships to travel across the Atlantic Ocean.\n\"We're gathering in a solemn location because to fully consider how far our two countries have come in our friendship, we have to remember how we began,\" Biden said outside the museum on a rainy afternoon.\n\"We hear them in the wind and the waves: young women, young men born free in the highlands in Angola, only to be captured, bound and forced in a death march along this very coast to this spot by slave traders in the year 1619,\" Biden said.\nThe White House announced earlier this week, as Biden arrived in Angola, that it was giving a $229,000 grant to help with a restoration of the museum and its conservation.\nThe diplomatic trip is aimed at deepening the relationship between the two countries, and marks the first-ever visit to Angola by a sitting U.S. president and the first sub-Saharan trip by an American leader since President Barack Obama in 2015.\nBiden kicked off the visit with a bilateral meeting earlier Tuesday with President João Lourenco in Luanda.\nThe two men talked about trade and economic opportunities, protecting democracy and the growth of the U.S.-Angola relationship, according to the White House.\nBiden celebrated the partnership further in his remarks, saying it's as \"strong as it's ever been\" and that the \"United States is all in on Africa's future.\"\n\"The story of Angola and the United States holds a lesson for the world: two nations with a shared history in evil of human bondage, two nations on opposite sides of the Cold War defining struggle in the late part of the 20th century,\" Biden said. \"And now two nations standing shoulder to shoulder, working together every day for the mutual benefit of our people.\"\n\"It's a reminder that no nation need be permanently the adversary of another testament to the human capacity for reconciliation and proof that from every -- from the horrors of slavery and war, there is a way forward,\" Biden added.\nOn Wednesday, Biden will tour part of the Lobito rail corridor, which is being partially financed by the U.S., that will help transport goods and materials across Africa -- a development seen as a way to counter China's influence in the region.\nWhite House National Security Communications Adviser John Kirby touted the project in an interview with ABC News' Alex Presha.\nKirby said the administration was \"very confident that the Lobito corridor is going to be a success,\" noting it's a multilateral effort with support from U.S. allies and benefits American companies that will build part of the railway at home before it's transported to Africa.\nLooming over Biden's historic visit, though, was the decision to pardon his son Hunter Biden. Biden has not answered reporters' shouted questions on the pardon while he's been in Angola.\nAsked if the pardon has diverted attention away from Biden's trip, Kirby said Biden is focused on \"how important this is, again, not just to the people of Angola and the continent, but to the American people.\"\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Black Republicans feel left out of Trump’s 2nd-term picks", "link": "https://abcnews.go.com/Politics/black-republicans-feel-left-trumps-term-picks/story?id=116205418", "content": "Besides HUD secretary, the president-elect has picked no Blacks for his Cabinet.\nAs President-elect Donald Trump fills out his Cabinet and chooses his closet advisers ahead of Inauguration Day, many African American leaders are asking why more Black people haven't been appointed to key positions.\nABC News spoke to more than a half dozen longtime and new African American conservatives and Republicans within Trumpworld, in and outside of Washington.\nLast month, the president-elect appointedScott Turner, who was executive director of the White House Opportunity and Revitalization Council during Trump's first term, to serve as secretary of the Department of Housing and Urban Development.\nOne area of frustration for many Black Republicans was speculation that if Trump did nominate an African American to his administration, it would be at HUD, the department that has had the most Black secretary appointments of any.\nOne Black Southern Republican told ABC News, \"Why is every Black person given HUD?\" adding that it was \"the literal Black job of the administration.\"\nABC News reached out to Trump’s transition team for comment on his selections but did not get a reply.\nSix African Americans have served as HUD secretaries, including Robert Weaver, the first. His appointment in 1966 by President Lyndon B. Johnson also made him the first African American appointed to a Cabinet-level position.\nThe first African American woman to serve in a presidential cabinet was Patricia Roberts Harris, who was the first African American Health and Human Services director and later HUD secretary. She served under President Jimmy Carter.\nFormer HUD Secretary Samuel Pierce was the only Black Cabinet official in the Ronald Reagan administration. Dr. Ben Carson at HUD was Trump's sole Black cabinet member in his first term.\nIn mid-November, Carsonpostedthat he was \"excited to speak with President Trump about how I will continue to advance the America First agenda, and I am meeting with him in the near future.\"\n\"However, contrary to reports, I will not be serving as the Surgeon General,\" he said.\nThe departments of Treasury and Interior remain the only departments that have never had a Black secretary.\nAnother key position Black conservatives believe needs to be filled by an African American is assistant to the president, a senior-level role within the White House. Trump previously appointedOmarosa Manigault Newman, a contestant on his \"The Apprentice\" TV series, as the sole Black assistant to the president.\n\"I do think if you're really talking about Black influence inside the White House, does Trump want his only legacy of having the only AP for two terms be Omarosa?\" one Black Republican strategist asked.\nAfter Newman's departure, Ja'Ron Smith served as a special assistant on legislative affairs before rising to deputy assistant to the president for domestic policy. Ashley Bell, a prominent Black Republican, served as a White House adviser on entrepreneurship and a regional administrator for the Small Business Administration. Bell's former boss is former SBA Administrator Linda McMahon, who Trump announced as his pick for the Department of Education. McMahon also is co-chair of the Trump-Vance transition team.\nSome of the former president's most ardent defenders have grown restless with the lack of Black appointees, as Trump selected several others who would be firsts in those positions. If confirmed, Sen. Marco Rubio would be the first Hispanic secretary of state; Scott Bessent would be the first openly gay Treasury secretary; and Tulsi Gabbard will be the first Asian American and youngest-ever director of national intelligence.\n\"I can't tweet that we need more Black conservatives because the left will attack me saying it's a DEI hire,\" the southern Republican said.\nHowever, one Black Republican operative told ABC News it is still very early when it comes to appointments.\n\"The Republican Party has never really fallen into the category of 'representation matters.' Our strength comes from diversity, but that is not our bumper sticker slogan. We're not going to nominate Black folks for the sake of nominating Black people,\" the Republican operative said.\nThe operative noted that Black Republicans have made strides in leadership across the country. Sen. Tim Scott will chair the National Republican Senatorial Committee; Rep. Byron Donald is speculated as possibly running for governor or U.S. Senate in Florida; and Winsome Sears is seeking to become the first Black female governor in the country in Virginia.\nDonalds on CNN last month took aim at President Joe Biden’s focus on diversity within his administration when asked about the lack of diversity among Trump’s nominees, saying “if you look at how the Democrats filled Joe Biden's cabinet, they wanted to have a piece of every identity. But did they get the job done? Did they actually serve the interest of the American people?\"\n\"What Donald Trump's election is about, is bringing competency and reality back to D.C. in the White House, regardless of their race, regardless of their religion, regardless of their creed.\" the Florida congressman added.\nAlthough some Black leaders inside and out of politics are highly qualified, another barrier that Black conservatives face is added scrutiny because of their dual identity.\nDedrick Asante-Muhammad, president of the Joint Center for Political and Economic Studies, a non-partisan organization that studies diversity in government and congressional staff, said that the Trump administration differs vastly from past Republican administrations.\n\"Trump isn't a traditional Republican, he doesn't use traditional Republican institutions in the same way that past presidential candidates have, so there isn't a kind of pipeline, long-term relations,\" Asante-Muhammad said.\n\"Being a part of Trumpworld isn't easy. It is almost a personal blacklist thing in the outside world. So it is risky, in my opinion, to be a part of this organization for Black people that may want to be a part of the cause, but it's not worth their bottom dollar,\" one Black Republican strategist added.\n\"When Black people are put underneath this microscope of being Trump-affiliated, they look past your color and you are public enemy number one,\" a Black Republican operative said.\nThe Republican strategist said Black Republicans face a different set of expectations -- they don't necessarily thrive in spaces that are massively disruptive, such as the second Trump term.\n\"I don't think disruption really leans into our skillset the way things are currently set up, we have to play things a little bit differently. There's no Black Republican version of Matt Gatez. They don't last,\" the strategist added.\n\"Those of us who have survived and been there for years and made it work have done so by being steady, consistent, reliable, and trustworthy, \" the strategist said.\nThe majority of Black Republicans who spoke to ABC News acknowledged that while the optics of Trump being surrounded by mostly white people aren't ideal, they believe if Trump delivers on a better economy, securing the border, Second Step Act, and judicial reform it could be transformative for the Black community, but they do want the former president to hire more Black conservatives.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Congress could determine NFL Washington Commanders’ home stadium", "link": "https://abcnews.go.com/Politics/congress-determine-nfl-washington-commanders-home-stadium/story?id=116405242", "content": "Commanders' owner blitzes Congress with DC stadium bill on the agenda.\nCongress's December to-do list includes an unusual item this year: a bill that could determine the home of the NFL's Washington Commanders.\nSince 1997, the team has played home games in nearby Maryland, and the former home of the team, Robert F. Kennedy Memorial Stadium, hasfallen into disrepair.\nBut there is new momentum behind a bipartisan bill to grant the District of Columbia a 99-year lease on the federal land that could allow the city to make a deal with the team to return to Washington after 28 years.\nThe House approved the bill in February. A key Senate committee did the same last month -- after the team and league promised Republican Sen. Steve Dainesit would honorthe team's old Redskins logo that depicts a chief of Montana's Blackfeet tribe.\n\"We’ve had good discussions with the NFL and with the Commanders,\"Daines told Fox Newslast month. \"There’s good faith negotiations going forward that’s gonna allow this logo to be used again,\" he added, citing this as the reason why he changed his mind to favor the bill.\nNow, advocates are blitzing the halls of Congress, trying to get Senate leaders to add the measure to a year-end spending bill.\nOn Monday, NFL Commissioner Roger Goodell and Commanders Managing Partner Josh Harris met with Hill leaders on the stadium proposal and among other matters, a league source and Commanders team source confirmed to ABC News.\nIf the Senate doesn't approve the deal by the end of the month, the bill dies, and both chambers would need to start from scratch in 2025.\nThat could also leave the fate of the project in the hands of President-electDonald Trump.\nTrump has feuded with the NFL and D.C. Mayor Muriel Bowser and has slammed D.C. as \"filthy\", and crime ridden. But the developer-turned-president has also promised to redevelop the city - and onceaspired to own an NFL franchise.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Republican senators torn over FBI background checks for Trump Cabinet picks", "link": "https://abcnews.go.com/Politics/gop-senators-seek-normal-process-confirm-trump-nominees/story?id=116406755", "content": "Sen. John Thune said FBI checks are \"historically\" the best way to vet picks.\nAs Republicans senators returned to Washington after Thanksgiving recess to a renewed peppering of questions about President-elect Donald Trump's Cabinet picks, a familiar refrain emerged: trust the confirmation process.\n\"That's why we're going to take the normal process, vet all the nominees, and give everybody a chance to ask those questions during a hearing,\" Sen. John Cornyn, R-Texas, said when asked aboutnew allegations concerning Pete Hegseth, Trump's choice for defense secretary.\n\"That is why our process is so important,\" Sen. Susan Collins, R-Maine, said when asked about thecontroversial reportssurrounding Hegseth.\n\"The president is allowed to have his appointees who we will have to see,\" Sen. Shelley Moore Capito, R-W.Va., said when asked about Kash Patel, Trump's nominee to lead the FBI. \"I don't know Kash Patel, we have to have him go through the process.\"\n\"Like all the other nominees, he'll get a process and a confirmation hearing and vetting and everything else. They'll all have to through it, and we'll see where the process takes us,\" incoming Senate Republican Leader John Thune said about Patel.\nThe responses fell short of glowing endorsements for some of Trump's nominees. And even as many Republicans call for regular processes to be followed as these nominations are considered, there remains at least one discrepancy on what a normal order process would look like.\nThough vetting of nominations has traditionally included an FBI background check, Republican senators are torn on whether one is 100% necessary for confirmation.\nThune told ABC News the issue over background checks will hopefully be \"resolved.\" While noting that there are \"other alternatives\" for getting information, Thune said that FBI background checks are \"historically\" the best way.\n\"I think, hopefully at some point they'll get this background check issue resolved. At this point I'm not sure exactly how it's going to be resolved but I think they will. I think the administration understands there's got to be a thorough vetting of all of these noms,\" Thune said. \"And that, you know, historically, the best place to get that done has been through the FBI. They have other alternatives, you know, obviously, I assume our committee chairman will just want to make sure that they've got the background that they need to carefully evaluate these noms.\"\nSen. Roger Wicker, chairman of the Senate Armed Services Committee that will be responsible for managing Hegseth's nomination, told ABC News the panel is \"looking at the way its been done traditionally and getting information about that as to who actually orders the FBI background check.\"\nBut when pushed on whether he would want to see an FBI background check, he said he would.\n\"I would prefer a full background check, yes,\" Wicker said.\nSen. John Kennedy, R-La., said he believes there will be background checks and he'd like to see them.\n\"My preference would be an FBI background check, and I'm not, I don't know that we won't have FBI background checks. I know that we have really good staffs and really good investigators, and they work closely with the FBI, so I'm not worried at all about -- about not having background checks done on -- not just these nominees, but any nominees by a president. I think that’s a false issue,\" Kennedy said.\nSome senators kept their cards close on this issue.\nCornyn ignored questions on whether he'd want to see a FBI background check for nominees like Patel.\nBut others are prepared to follow Trump's lead.\n\"My position is what President Trump decides to do is what I will support,\" Sen. Mike Crapo, R-Idaho, said.\nNo Republican senator flatly rejected Patel as Trump's choice to lead the Department of Justice, though many said they'll wait for Patel to move through the Senate Judiciary Committee before making a decision on him.\nBut ultimately, for Patel to be installed, current FBI Director Chris Wray would need to be fired or step down.\nThere appears to be a general sense among Republicans that they would be okay with Wray being forced out.\n\"I am, I am,\" Capito said when asked if she would be comfortable with Trump removing Wray to install Patel.\nSen. Joni Ernst, R-Iowa, said she likes Patel, and added that the FBI needs someone new to \"go in and clean it up.\"\nSen. Rick Scott, R-Fla., said it is reasonable for Trump to want to put in place someone he is comfortable with after his experiences during his first administration and in the years that followed.\n\"Think about what this guy has gone through, he's had his house raided, he's been indicted, so I think he's probably in a position that you know, and then think about it in his first term, he had a special prosecutor, so I think he probably wants somebody that he knows is going to be loyal,\" Scott said.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "DNC hopes to highlight success ahead of post-election meeting", "link": "https://abcnews.go.com/Politics/dnc-hopes-highlight-success-ahead-post-election-meeting/story?id=116390240", "content": "DNC Chair Jaime Harrison said the election was a \"mixed bag.\"\nThe Democratic National Committee is hoping to highlight down-ballot successes last month as it hosts a key post-election meeting and looks to turn the page from its stinging White House loss.\nDNC Chair Jaime Harrison wrote in a grassroots memo obtained first by ABC News that while Democrats fell short in the presidential race, beefy and historic investments in down-ballot contests offer a roadmap to success. The party was able to salvage four Senate races in states President-elect Donald Trump won and gain House seats despite headwinds at the top of the ticket.\n\"As we reflect on the cycle and take stock of where we fell short, it’s equally important to assess what worked. Data shows that the work of the DNC and our partners was effective in beating back what could have been a larger red wave,\" Harrison wrote.\n\"In 2024, the DNC made strategic campaign grants in every state party for the first time in history, and delivered record-breaking investments directly to coordinated campaigns in every state -- totaling over $264 million,\" he added. \"These investments yielded results and underscore the importance of continued state party investment…\"\nThe memo marks the first public, thorough dissection by the DNC of the election results, in which Vice President Kamala Harris lost to Trump and Republicans flipped the Senate and kept the House of Representatives.\nThe document paints a rosy portrait of a party that failed to keep the White House but won Senate races in Trump-won states like Arizona, Michigan, Nevada, and Wisconsin, key House races in California and New York, and won a gubernatorial race in North Carolina, a state that has been a white whale for Democrats at the federal level.\nHarrison specifically writes that despite the disappointments, Trump was kept below 50% in the popular vote (he still won it), Democrats held Senate seats in states Trump won and cut into Republicans' House margin, and the party was successful in breaking some GOP state legislative majorities and holding on in certain chambers, including its one-seat majority in the Pennsylvania state House.\nThe memo highlights DNC efforts in all those cases, including voter registration efforts, investments in key demographic groups in Senate races, efforts in New York and California to boost prospects in key House races there and money sent to traditionally noncompetitive states like Alaska and Arkansas to make state legislative gains.\n\"Notable down-ballot wins in 2024 provide us with a roadmap on what works and where investments mattered most,\" Harrison wrote.\nThe memo is being released at the start of a meeting of the Association of State Democratic Committees, where state party leaders will gather to discuss what went right and wrong in November.\nThe election is sparking a crowded race to lead the DNC, with Harrison not running for reelection as chair, and a broader party reckoning over its identity and whether it should be more centrist, populist, progressive or some combination of the three.\nIn an interview, Harrison conceded the election was a \"mixed bag.\"\n\"Of course, we lost the most important election on that ticket, the presidential election, and I'm heartbroken over that,\" he said.\n\"But then when we start to look underneath that race and look into the battleground states, and what happened in other races, it's, again, a mixed bag. Donald Trump didn't have the coattails. It was not this landslide vote that many people wanted to say that it was on Election Day because Democrats still won in many of those battleground states.\"\nHarrison cited several reasons behind the \"mixed\" results.\nOn the one hand, Harris faced a historically short runway after President Joe Biden left the race in July, combined with economic headwinds and a liberal media ecosystem that still struggles to match Republican heavyweights like Fox News. Trump, Harrison said, had emerged as a \"cultural\" figure over the course of nine years who was able to put together an expansive coalition.\n\"I think time definitely was a part of it,\" Harrison said. \"I thought that she was going to be become sort of a cultural figure. Just seeing the early energy, I need to tell you, man, just that convention alone, I felt like there was something turning. But it didn't go full circle. And that's something that we got to figure out. Why not? Did we change the message? What did we do in order not to have it go full circle?\"\n\"I don't know if we need to find our own Joe Rogan [the influential podcaster who interviewed then endorsed Trump days before the election], and I've heard that from a number of folks, but I think we need to make sure that we're in in all those spaces,\" he added of whether Democrats need to expand their media strategy in traditional and non-traditional outlets.\nStill, Harrison found positive signs in a state party infrastructure that Democrats had worked hard to revive after years of atrophy in recent years.\n\"We got to continue those investments. We can't go back to the post-Obama years in which we minimized the amount of resources that the DNC sent to state parties,\" he said. \"We are still trying to work our way back from that point in time. So, now, it's about focusing on continuing moving forward.\"\nStill, the meeting isn't taking place in a vacuum, and the present could get in the way of discussions about the future.\nBiden dropped a bombshell Sunday night when he announced that he was pardoning his son, Hunter, leading to a flood of Democratic criticism Monday over his intervention in Justice Department proceedings.\nHowever, Harrison said he believed that the ASDC meeting would stay on track.\n\"The president is a good man, he's a decent man, he's a just person, and he always tries to do the best thing, and this is, I believe, the best thing at this point in time,\" Harrison said. \"Almost to a person, the Democrats that I've talked to, grassroots activists, Democrats, are leading. This won't consume that.\"\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "As Hunter Biden pardon sparks backlash, experts say it can't be overturned", "link": "https://abcnews.go.com/Politics/hunter-biden-pardon-sparks-backlash-experts-overturned/story?id=116381882", "content": "President Biden called the prosecution of his son \"a miscarriage of justice.\"\nHunter Biden's pardon is the latest in a long list of controversial White House immunity decisions.\nStill, President Joe Biden's unconditional, full absolution of his son is different in one unprecedented way: No commander-in-chief has evergranted clemencyto his child, according to experts.\nWhile former President Bill Clinton pardoned his half-brother, Roger Clinton Jr., of a drug conviction on his last day in office in 2001 and President-elect Donald Trump did the same for his daughter Ivanka's father-in-law, Charles Kushner, of tax evasion and witness tampering convictions in the final days of his first term, Biden has broken new ground in presidential pardon history, experts told ABC News.\n\"This is a first,\" said Jeffrey Crouch, an assistant professor of American politics at American University and author of the book \"The Presidential Pardon Power.\" \"In terms of the legal side of things, the president has the power to grant clemency to just about anybody he wants.\"\nUnder a section called the \"Commander-in-chief clause,\" Article II, Section 2 of the U.S. Constitution says the president \"shall have power to grant reprieves and pardons for offenses against the United States, except in cases of impeachment.\"\n\"The idea is that it's a check on decisions of the federal judiciary and the president is entrusted with this responsibility,\" Crouch told ABC News. \"And the reason the President has the responsibility is because the framers of the constitution decided that the president should have this ability. It should be virtually unchecked and it should be part of the system of separated powers and checks and balances, and that the president should be able to unilaterally decide whether to shorten someone's punishment or to offer them a full pardon, or some variation of the options that are available.\"\nCrouch said the only limit placed on a president's pardon power is that it must pertain to crimes committed against the United States, meaning only federal offenses.\n\"If someone commits a state offense, the state will have its own process that the person will need to go through, whether it's a parole board or a governor or whatever the case might be,\" Crouch said.\nHunter Biden pleaded guilty over the summer to federal charges of failing to pay $1.4 million in taxes from 2016 to 2020. In a separate case, he was convicted of making false statements on a federal Bureau of Alcohol, Tobacco, Firearms and Explosives form when he purchased a handgun in 2018 and said he was not using drugs at that time.\nHunter Biden was scheduled to be sentenced on Dec. 12 in the federal gun case in Delaware and on Dec. 16 in the tax evasion case in California.\nDue to the pardons his father issued on Sunday, both convictions are expected to be thrown out.\nPresident Biden issued the pardons despite repeatedly making public statements that he would not interfere with justice. In a statement, he called the prosecution of his son \"a miscarriage of justice\" by his own Department of Justice.\n\"From the day I took office, I said I would not interfere with the Justice Department's decision-making, and I kept my word even as I have watched my son being selectively, and unfairly, prosecuted,\" Biden wrote.\nHe added, \"Here's the truth: I believe in the justice system, but as I have wrestled with this, I also believe raw politics has infected this process and it led to a miscarriage of justice -- and once I made this decision this weekend, there was no sense in delaying it further. I hope Americans will understand why a father and a President would come to this decision.\"\nThe president's decision to pardon his son immediately provoked a backlash from Republicans and Democrats, who viewed it as an abuse of executive branch power and pointed out that arguments the president made of his son being the target of political prosecution are the same ones rejected by the courts handling his cases. In a post on his Truth Social platform, Trump called the pardon \"an abuse and miscarriage of Justice.\"\nSen. Tom Cotton, R-Arkansas, condemned the pardon in an interview Monday on Fox News and issued a warning to President Biden.\n\"Joe Biden may come to regret this decision because, having given his son a blanket pardon of 11 years to include the time when Joe Biden was vice president, Hunter Biden now can't plead the fifth if he appears before Congress or appears before a grand jury,\" Cotton said.\nHe added, \"He has to testify about exactly what he was up to, for instance, when he was traveling to China on Air Force Two and meeting with Chinese communist princelings, or why being paid hundreds of thousands of dollars to sit on a Ukrainian energy company's board for which he had no qualifications. So, that may be one unintended consequence of the pardon that Joe Biden didn't fully think through.\"\nThe full pardon is not just for Hunter Biden's recent convictions but covers any crime he may have committed over a nearly 11-year span from Jan. 1, 2014, to Dec. 1, 2024.\n\"It's critical,\" Kim Wehle, a law professor and ABC News contributor, said of the time frame covered in the pardon.\nShe noted that Trump has picked Kash Patel as FBI director and Pam Bondi as Attorney General.\n\"These folks have publicly stated that they're on board with using the Justice Department as a mechanism of vengeance and retribution. So the breadth of that pardon suggests that President Biden understands that without that, Hunter Biden could be targeted for a vindictive prosecution,\" said Wehle, the author of \"Pardon Power: How the Pardon System Works -- And Why.\"\n\"He faced jail time with these two convictions and Donald Trump will be in charge of the federal Bureau of Prisons, so he would be in charge of Hunter Biden's day-to-day life,\" Wehle said. \"I can understand why a president would not want his son to be put through that moving forward.\"\nCrouch described the pardon as \"extraordinarily broad\" and said there are similarities to the pardon President Gerald Ford granted President Richard Nixon in 1974.\n\"It was not necessarily tied to specific offenses. It was tied to a time range and it covered Nixon's entire presidency,\" Crouch said. \"So any federal offenses that Nixon committed or may have committed during his presidency were covered and the language of the Hunter Biden pardon seems a bit similar to that in terms of its breadth.\"\nAsked if a presidential pardon can be overturned, Crouch said, \"It's not possible.\" He said even the U.S. Supreme Court would not have a say in Hunter Biden's pardon.\nCrouch said the closest a pardon has come to being overturned occurred in 2008 when then-President George W. Bush pardoned New York developer Isaac Robert Toussie for fraudulently obtaining federally insured mortgages. After facing criticism that Toussie's father was a big Republican donor, Bush took back the pardon, claiming it hadn't been completed.\n\"You can stop something that hasn't been completed, but you can't take back a pardon that's been completed,\" Crouch said. \"And the Hunter Biden language in the pardon suggests any and all federal offenses is pretty broad and there's no taking that back.\"\nCrouch said most modern presidents have relied on the Office of the Pardon Attorney in the Department of Justice to investigate requests for pardons, but are not obligated to do so.\n\"It's designed to handle the bureaucratic side of that process, to take some of the burden off the president individually, and, frankly, to give the president someone to blame when things go awry. That's how most modern presidents approach clemency,\" Crouch said.\nBiden didn't go through the Office of the Pardon Attorney before deciding to pardon his son. The presidentmade the decisionafter discussing it with his family during their time together in Nantucket for Thanksgiving, a source familiar with the matter confirmed to ABC News on Monday.\nDuring Trump's first term, according to Crouch, he used the Office of the Pardon Attorney roughly 25 times for his 238 clemency grants.\n\"He had an internal process where, according to reporters, he would hear something on television, or someone would talk with him, or he'd read something, and those are the cases that would be considered for clemency,\" Crouch said of Trump.\nCrouch said the Office of the Pardon Attorney rarely recommends granting pardons.\nDuring Trump's first term as president, he posted on social media, \"As has been stated by numerous legal scholars, I have the absolute right to PARDON myself, but why would I do that when I have done nothing wrong?\"\nCrouch said that while legal scholars have debated whether a president can pardon himself, the question remains unsettled.\n\"The answer is nobody knows until somebody tries it. It's not really clear what would happen,\" Crouch said.\nAsked if Biden could pardon Trump before leaving office, Couch said, \"Biden can pardon anyone he would like.\"\n\"The question is what would be the benefit to doing that? It would be highly controversial,\" Crouch said. \"And so when you look at highly controversial cases, you've got to think about why would the president do this?\"\nCrouch said there have been other controversial presidential pardons made in recent history.\nBesides pardoning his brother, former President Clinton caused a firestorm in 1999 when he commuted the sentences of 16 members of the FALN, a Puerto Rican paramilitary organization that set offer bombs in the United States, mostly in New York and Chicago. Clinton agreed to grant the FALN members clemency in exchange for them renouncing violence.\nIn the last days of his presidency in 2001, Clinton pardoned financier and fugitive Marc Rich, whose ex-wife participated in Clinton's presidential campaigns and was a major donor to his presidential library. One of the critics to publicly condemn the Rich pardon was none other than then-Sen. Joe Biden.\n\"I think either the president had an incredible lapse in memory or was brain-dead when he did that one. I mean, I just think it's totally indefensible,\" Biden said in a Feb. 11, 2001, Fox News Sunday interview.\nIn 2007, then-President George W. Bush commuted the 31-month federal sentence for Scooter Libby, former chief of staff for Vice President Dick Cheney, who was convicted of obstruction of justice, perjury and making false statements stemming from a White House leak that criminally exposed the covert identity of CIA operative Valerie Plame Wilson. Trump later granted Libby a full pardon.\nIn 1992, Bush's father, President George H.W. Bush, pardoned Caspar Weinberger, the former Secretary of Defense, and five others, absolving them from any further punishment for their illegal dealings in the Reagan-era Iran-Contra scandal. Critics argued that Bush Sr. granted the pardons at a time when he was a lame-duck president with no political consequences.\nIn 2017, Trump pardoned former Maricopa County, Arizona, Sheriff Joe Arpaio, who was charged with criminal contempt of court for disobeying a federal judge's order to stop racially profiling in detaining individuals suspected of being in the country illegally. Trump also pardoned in 2020, former Gen. Michael Flynn, his first national security advisor, who was convicted of lying to FBI agents as part of special counsel Robert Muller's investigation of Russian interference in the 2016 presidential election.\n\"There's no limit on the number of pardons that a president can give,\" Crouch said. \"The president can pardon as many people or as few people as you would like. He can do it at any time he would like.\"\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Tuberville praises defense secretary pick Pete Hegseth amid misconduct allegations", "link": "https://abcnews.go.com/Politics/tuberville-praises-defense-secretary-pick-pete-hegseth-amid/story?id=116390332", "content": "Alabama Sen. Tommy Tuberville said Hegseth would be \"great\" in the position.\nFollowing his meeting Monday with Secretary of Defense nominee Pete Hegseth, Alabama Sen. Tommy Tuberville told reporters Hegseth would be \"great\" for the position.\nTuberville said he didn't talk with Hegseth about his \"personal\" life on Monday, but later clarified that they indeed spoke on the phone about the misconduct allegations against Hegseth.\n\"I'm gonna leave the personal stuff between y'all and him whenever he has an opportunity to sit down with you and explain, you know, the allegations that you're all pushing out,\" Tuberville told reporters.\nIn 2017, Hegsethpaid a settlement agreementto a woman who accused him of sexual assault, Tim Parlatore, an attorney for Hegseth, previously confirmed. Parlatore claimed Hegseth was the victim of \"blackmail\" and \"false claims of sexual assault,\" and said he paid the settlement only because he feared his career would suffer if her allegations were made public.\nAccording to a22-page police reportobtained by ABC News, Hegseth's accuser told police that he took her phone and blocked her from leaving his hotel room on the night of the incident.\nOn Sunday, theNew Yorkerpublished an investigation into Hegseth that alleged that \"a trail of documents, corroborated by the accounts of former colleagues, indicates that Hegseth was forced to step down by both of the two nonprofit advocacy groups that he ran -- Veterans for Freedom and Concerned Veterans for America -- in the face of serious allegations of financial mismanagement, sexual impropriety, and personal misconduct.\"\nThe New York Timespublished an email Friday that Hegseth's mother, Penelope Hegseth, sent him in 2018, saying he had routinely mistreated women for years. Penelope Hegseth confirmed the contents of the email to the New York Times in a phone interview, but said in the interview to the Times that she regretted her original sentiments expressed in the email and sent her son an immediate follow-up email expressing regret for what she had said.\nABC News has not independently confirmed the New Yorker or New York Times' reporting.\nSpeaking to reporters after their meeting, Tuberville praised Hegseth and sidestepped questions about his alleged pattern of misconduct.\n\"I've known him for a while. Pete's the type of guy that he's going to work. He's got a great work ethic. He's very, very smart. He understands the business side as well as the military side.\" Tuberville said. \"He's actually fought in wars. He is a good age too. Somebody that can relate to the young men and women that we need to recruit in the military.\"\nAsked if any of the allegations in the New Yorker article concerned him, Tuberville left the explanation up to Hegseth.\n\"Well, I'm gonna leave that to his explanation of all that. I can't comment on that,\" he said. \"Obviously, if it's to a certain degree, people are not going to vote to confirm it, but what I know when I talk to him about what I've read, what I've studied and been around him, I'll vote for him.\"\nAs Tuberville took question after question on Hegseth's allegations, he was asked if Hegseth needed to defend himself forcefully and provide an explanation to the American people.\n\"That's up to him,\" Tuberville said. \"Eventually he's gonna have to come out and start visiting with the media. I think, right now, his number one objective is to go out and and sell himself to you know, at least 51 or 52 Senators. That's the job he needs to do to get confirmed.\"\nTuberville mentioned a dozen of senators are meeting with Hegseth as a group Monday night, but he did not elaborate further.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Biden's pardon of son, Hunter, roils Democrats' post-election reckoning: ANALYSIS", "link": "https://abcnews.go.com/Politics/bidens-pardon-son-hunter-roils-democrats-post-election/story?id=116385823", "content": "\"You can't get any more elite than this,\" one Democrat said.\nPresident Joe Biden's decision to pardon his son, Hunter, is throwing a bomb in his party's post-election soul-searching.\nDemocrats are still sifting through the rubble of their loss to President-elect Donald Trump last month, with some in the party blaming a reputation -- justified or not -- as elitists out of touch with everyday voters' concerns while cozying up to other wealthy and well-connected allies.\nNow, after months of vows that he wouldn't do so and arguing the justice system treated Trump appropriately, Biden is scrapping his son's supposedly politicized convictions on tax and gun charges, sparking a warning the move fortifies perceptions that the party doesn't keep its word and is playing by its own set of rules.\n\"This literally reinforces the very challenge that Democrats confronted in the election, which is elites talking to elites convincing each other that they're right. Well, you can't get any more elite than this,\" said Chris Kofinis, a Democratic strategist and former aide to Sen. Joe Manchin, I-W.Va.\n\"It's not the question of pardoning the son. What about everybody else's son?\" Kofinis added. \"If you're going to take this kind of a dramatic action that's going to benefit a single person in your family, you have a responsibility to go out there and say why. But you can't say the reason why is because the justice system is rigged, because you just spent the last four years saying it wasn't rigged. So, it's not rigged for Trump, but it's rigged for your son?\"\nHunter Biden had been convicted on federal gun charges after lying about his drug use on an application for a firearm and had pleaded guilty to nine tax-related charges, including three felonies.\nThe president's announcement Sunday evening marked a bombshell at the tail end of a holiday weekend. In it, Biden insisted that his son had been \"treated differently\" after \"several of my political opponents in Congress instigated them to attack me and oppose my election.\"\nThe pardon is also particularly broad, covering all \"offenses against the United States which he has committed or may have committed or taken part in\" from Jan. 1, 2014, through Dec. 1, 2024, beyond the gun and tax charges.\nRepublicans swiftly cried foul at the move, lambasting it as a manipulation of justice, particularly after Biden for months said he wouldn't use his power to intervene in his son's legal troubles.\n\"Joe Biden has lied from start to finish,\" House Oversight Chair James Comer, R-Ky.,wrote in a post on X. \"It's unfortunate that, rather than come clean about their decades of wrongdoing, President Biden and his family continue to do everything they can to avoid accountability.\"\n\"Tonight's pardon is wrong. It proves to the American people that there is a two-tier system of justice,\" added Wyoming Sen. John Barrasso, who will be the No. 2 Senate Republican in the next Congress.\nDemocratic lawmakers were tighter-lipped over the pardon late Sunday but were more vocal in their opposition by Monday afternoon.\n\"Democrats should have been for reforming and curtailing pardon power from Day 1 of the Biden Presidency. As a father, I empathize with President Biden, but we must be the party of reform whether it's about the archaic pardon power, opposing super PACs or broad war powers,\" Rep. Ro Khanna, D-Calif.,said on X.\n\"President Biden's decision to pardon his son was wrong. A president's family and allies shouldn't get special treatment. This was an improper use of power, it erodes trust in our government, and it emboldens others to bend justice to suit their interests,\" Sen. Gary Peters, D-Mich,added.\nNow, some party operatives warned to ABC News, Democrats risked being seen as executing the same behavior they'd been warning against from Trump ahead of his inauguration, making their campaign rhetoric about the justice system's integrity apply to only one side of the political divide.\n\"It is somewhat toying with [voters],\" one Democratic pollster said. \"The takeaway, to the extent that there are any left, for the average, independent voter is, is that, both sides are just playing games with each other. They don't mean any of this rhetoric.\"\nThe White House Monday sought to play damage control, laying blame at the feet of Republicans who will have unified control of Washington starting later next month and have hammered away at Hunter Biden's legal travails and business ties for years.\nWhite House press secretary Karine Jean-Pierre told reporters that Biden issued the pardon in part \"because they didn't seem like his political opponents would let go of it.\"\n\"They would continue to go after his son. That's what he believed,\" she added, declining to speculate on the political fallout of the move.\n\"Two things could be true. You can believe in the department of justice system, and you could also believe that the process was affected politically,\" she insisted.\nThe pardon controversy is coming as some Democrats partly blame Biden's decision to run for reelection in the first place as a reason for Harris' defeat.\nWhile many Democrats expressed empathy for Biden's position as a father, they suggested it marked another reason to put the president in the rearview mirror as the party puts together a new playbook for the future -- a separation that, some hoped, could minimize any long-term fallout.\n\"I think the party is already going to move on from him so deeply and so completely that I don't know that this severs that connection between Biden and the future the Democratic Party any more or any less than it already would have been. If anything, it may quicken it,\" one senior Democratic strategist said.\n\"I think it's politically stupid,\" the person said. \"It makes us look bad, and it makes us look like we don't have the moral high ground, and we either need to own that, or we need to own that we need to stop being so preachy. I think it's bad politics, but it's not clear to me what exactly the repercussions will be.\"\nStill, that doesn't mean Democrats who are skeptical of any long-term implications are pleased with the move.\nNearly every Democrat who spoke to ABC News worried that Biden's pardon kicked the door open for Trump to protect people they predicted will be unworthy of pardons. And to fend off any prolonged fallout amid a broader makeover, even theoretical, some suggested that a robust denouncement from party leaders could go a long way.\n\"It's not going to eliminate it, because Biden is the president of the United States,\" the Democratic pollster said. \"But if Democrats ever hope to reinvent themselves in a post-Biden future, they're going to need to start by denouncing Biden now when it's hard, not in the future, when it'll be easier.\"\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Supreme Court divided over FDA block on kid-friendly flavored vapes", "link": "https://abcnews.go.com/Politics/supreme-court-weighs-fda-block-kid-friendly-flavored/story?id=116232703", "content": "Justices will decide whether regulators unlawfully rejected nicotine products.\nThe Supreme Court on Monday was divided over whether the Food and Drug Administration hadunlawfully rejectedmillions of flavored e-cigarettes for approved sale in U.S. over concerns about nicotine addiction among young people.\nDuring oral arguments in a case that could have a significant impact on public health, the justices grappled with tobacco industry claims that the government had given unclear and shifting requirements for new product applications and failed to provide proper notice to the companies.\n\"FDA switched its position on what studies were required\" to show that the products have benefits to existing smokers that offset risks to youth, argued Eric Heyer, the attorney representing vape manufacturers Triton Distribution and Vapetasia, which are seeking a green light to market e-liquids such as “Jimmy the Juice Man Peachy Strawberry” and “Iced Pineapple Express.”\nFederal law requires sellers of new nicotine products to provide regulators with scientific evidence to show that the products would promote public health, but the statute does not spell out specifically what evidence is necessary and sufficient. The FDA's guidance on how to meet that requirement is at the center of the case.\n\"Their argument is that the guidance were actually a moving target, that either they weren't clear or you changed the guidance as time went on,\" said Justice Clarence Thomas, who appeared sympathetic to vape manufacturers.\n\"That is their argument,\" replied Biden administration lawyer Curtis Gannon, representing the FDA, adding, \"But I think that the key point is that they knew from the statute that they needed to be making this comparison about what the benefits were with respect to existing smokers and weighing that against the potential costs with respect to nonsmokers and attracting youth.\"\nJustice Neil Gorusch suggested that the companies might not have been given \"fair notice\" of how they could comply with the law. \"Wouldn't due process require an opportunity for notice and a hearing?\" he asked Gannon.\nE-cigarettes and vapes, which deliver nicotine without some of the harmful effects of smoking, have beenbooming in popularity. Kid-friendly flavors, such as fruit, candy, mint, menthol and desserts, are not approved by the FDA and are on the market illegally.\nWhile vaping among youth is declining, more than 1.6 million children use the products, according to the Centers for Disease Control and Prevention. Nearly 90% of them consume illicit flavored brands.\nManufacturers have acknowledged that their products may appeal to youth but insist that a “growing body of scientific evidence” shows that “flavors are crucial to getting adult smokers to make the switch and stay away from combustible cigarettes.”\nA federal appeals court sided with the companies last year, saying the agency had acted arbitrarily. If the Supreme Court upholds that ruling, it could clear the way for broader marketing and sale of flavored nicotine products.\nThe Court's three liberal justices all seemed to share the government's view that FDA did not illegally move the goal posts during the process and that the companies simply lacked the evidence to win approval.\nSince 2009, when Congress passed legislation aimed at curbing tobacco use among young people, the government has almost universally denied tobacco company requests to sell flavored nicotine e-liquids, citing risks of addiction among minors.\nThe FDA said the two companies in this case provided insufficient evidence that the benefits of their flavored e-products in helping tobacco smokers quit exceed the dangers of hooking children.\n\"I'm so totally confused,\" Justice Sonia Sotomayor told Heyer. \"What [FDA] said is what you provided wasn't sufficient.\"\nJustice Ketanji Brown Jackson said she was \"baffled\" by Heyer's argument because the FDA had explicitly articulated its standard.\n\"I guess I'm not really seeing what the surprise is here, or what the change is here,\" said Justice Elena Kagan. \"There's just not a lot of mystery here about what FDA was doing. You might disagree with that, because you think that, in fact, the world of 40-year-olds really wants to do blueberry vaping, but you can't say that FDA hasn't told you all about what it's thinking in this respect.\"\nJustice Brett Kavanaugh, who could be a critical vote in the case, signaled sympathy to the industry's complaint about discretionary government regulation but suggested he wasn't convinced FDA had acted unreasonably.\n\"If the agency says [your claims of benefits to adult smokers] that doesn't outweigh the harm to youth, we've reviewed everything, we're aware of everything, of course they're aware of everything that's out there, that's kind of the end of it, isn't it?\" Kavanaugh asked.\nEven if they lose the case, several justices noted, the vape manufacturers could reapply for approval with the FDA in a new application.\nWhile the first Trump administration had taken a hard line against the marketing and sale of sweet and candy-flavored vapes, president-elect Donald Trump said during the campaign that he wants to \"save\" flavored vapes.\n\"We don't know exactly what that's going to look like,\" said Heyer. But, he added, that his clients \"can't afford to wait that out.\"\nNearly a quarter of high school students who use e-cigarettes consume illicit menthol-flavored varieties, according to the 2023 National Youth Tobacco Survey.\nJosie Shapiro, the 2024 national youth ambassador for the Campaign for Tobacco-Free Kids who testified before Congress on the dangers of nicotine addiction, said illicit flavored vapes hooked her at age 14.\n“I think that by marketing any sort of flavored product as bubble gum or any of the genres of candy, it's going to catch the eyes of children,” Shapiro said. “I'm still addicted, and I'm still trying to fight my addiction. Honestly, the FDA needs to regulate all flavored tobaccos to flavor ‘tobacco’ products and get them off the market.”\nPublic health experts have credited the FDA’s restrictions on flavored nicotine products with helping to drive down the number of teenagers who vape gradually from an “epidemic” level just five years ago.\nThe case, Food and Drug Administration v. Wages and White Lion Investments, LLC, will be decided before the end of the Supreme Court’s term in June 2025.\nABC News’ Patty See contributed to this report.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "How President Biden came to the decision to pardon his son Hunter", "link": "https://abcnews.go.com/Politics/president-biden-decision-pardon-son-hunter/story?id=116370218", "content": "The family discussed it together over the Thanksgiving holiday, a source said.\nPresident Joe Biden and his family discussed whether topardon Hunter Bidenduring their time together in Nantucket for Thanksgiving, a source familiar with the matter confirmed to ABC News Monday.\nSenior White House staff learned of the possibility of a pardon on Saturday evening. President Biden made his final decision on Sunday, the source said.\nBiden did not answer questions on the issue as he left late Sunday for athree-day trip to Africa. He also ignored shouted questions during a brief stop in Cabo Verde on Monday and when he arrived in Angola.\nWhite House press secretary Karine Jean-Pierre, peppered with questions about the pardon during a gaggle with reporters on Air Force One, said Biden \"wrestled\" with the decision and made it himself over the weekend.\n\"It wasn't an easy decision to make,\" Jean-Pierre said.\nShe added that President Biden ultimately believed his son was \"singled out politically\" and they \"tried to break his son in order to break him.\"\nFirst lady Jill Biden, while unveiling the White House's holiday theme on Monday alongside military families, took a brief question on the Hunter Biden pardon.\n\"Of course I support the pardon of my son,\" she said.\nHunter Biden, the president's only surviving son, was convicted on federal gun-related charges in June and pleaded guilty to nine tax-related charges in September. Both cases carried the possibility of significant prison time and he was set to be sentenced in both later this month.\nPresident Biden had long said he would not pardon his son, including in aninterview with ABC's David Muiras Hunter Biden's gun trial was underway this past summer.\nIn his statement on Sunday evening, Biden contended his son was \"unfairly\" prosecuted after pressure from his political opponents.\n\"For my entire career I have followed a simple principle: just tell the American people the truth. They’ll be fair-minded. Here’s the truth: I believe in the justice system, but as I have wrestled with this, I also believe raw politics has infected this process and it led to a miscarriage of justice -- and once I made this decision this weekend, there was no sense in delaying it further,\" President Biden said.\nHunter Biden, his wife Melissa Cohen Biden and their son Beau, as well as Ashley Biden, spent Thanksgiving in Nantucket with President Biden and first lady Jill Biden.\n\"I hope Americans will understand why a father and a President would come to this decision,\" the president added.\nAsked what changed between Biden's past insistence he would not pardon his son and his announcement Sunday, Jean-Pierre repeatedly referred to Biden's statement.\n\"He wrestled with it. He thought about it. And he believed, and what he saw, was that his son was singled out,\" she said. \"And so he made this decision and once he made the decision, which was this weekend, he decided to move forward with it, and not to not to wait and. And you know, I think he truly believed enough is enough.\"\nRepublicans, including President-elect Donald Trump, pounced on the reversal.\nCongressional Republicans spent years investigating the Biden family, including Hunter Biden, over their business dealings. House Republicansreleased a report in Auguston their impeachment probe filled with allegations, many targeted toward Hunter Biden, but no recommendation of specific impeachment articles and no evidence of President Biden himself being directly involved in alleged improper activities.\nIt's not clear whether Republicans will continue their probes after President Biden leaves office in January.\nJean-Pierre told reporters on Monday that Biden \"didn't believe they would let up.\"\n\"They would continue to go after his son. That's what he believed,\" Jean-Pierre said.\nHouse Speaker Mike Johnson on Monday criticized the pardon, which extends as far back as 2014.\n\"President Biden insisted many times he would never pardon his own son for his serious crimes. But last night he suddenly granted a 'Full and Unconditional Pardon' for any and all offenses that Hunter committed for more than a decade!\" Johnson wrote on X. \"Trust in our justice system has been almost irreparably damaged by the Bidens and their use and abuse of it. Real reform cannot begin soon enough!\"\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Transgender teen implores Supreme Court to strike Tennessee gender-affirming care ban", "link": "https://abcnews.go.com/Politics/transgender-teen-implores-supreme-court-strike-tennessee-gender/story?id=116232417", "content": "\"I feel normal now,\" plaintiff says of the treatments she's fighting to protect.\nNASHVILLE, Tenn. --The transgender Tennessee teenager behind ahistoric hearingat the U.S. Supreme Court this week doesn't want to show her face on television but is eager to speak about a case she says has the potential to make thousands of American kids feel \"seen\" for who they are.\n\"The court has definitely ruled in ways that would make me think that they don't exactly value bodily autonomy, but I have heard that they've been a little bit better about trans cases than people would think,\" said 16-year-old LW in an exclusive interview with ABC News alongside her parents Samantha and Brian Williams.\nThe court on Wednesday will hear the Williams family's challenge to Tennessee's 2023ban on gender-affirming medical treatmentsfor minors, including puberty-blocking medication and hormone therapies that have dramatically improved LW's quality of life.\nWhile the medications have been used safely to treat minors of all genders for years, they are now prohibited in Tennessee when used to treat trans kids struggling with gender dysphoria, the distress experienced when one's gender assigned at birth is different from one's sense of identity.\n\"It's not very comfortable being trapped in [your body] because it just doesn't feel like you,\" said LW, who reports significant improvement since beginning the treatments in 2022.\nSince the state law took effect, LW now has to take time away from school to make a 10-hour round trip out of state to continue receiving care. The travel has also been a costly and time-consuming burden, her parents say.\n\"It would definitely be horrible for me to have to continue to go out of state to get care,\" said LW. \"I feel normal now.\"\nBacked by the American Civil Liberties Union, the Biden administration, and major American medical associations, the Williamses sued Tennessee last year alleging the ban on certain gender-affirming treatments for minors discriminates on the basis of sex and overrides the rights of parents to make medical decisions for their children.\n\"Our state legislature had made such a big deal out of parents' rights during COVID, about masks and vaccines that that's for parents to decide these medical decisions for their children,\" Samantha Williams said. \"And then they made this medical decision for our child.\"\nState lawmakers who support the law, SB1, say it is meant to protect kids from potentially irreversible effects from treatment and that contradictory scientific evidence and uncertainty about long-term adverse consequences warrant caution.\n\"We made the policy decision on behalf of our constituents that in Tennessee we think this is a risky procedure,\" said state Sen. Jack Johnson, the Senate GOP leader who sponsored the bill. \"It is our role as policymakers here in the state of Tennessee to set those guardrails.\"\nThe American Academy of Pediatrics says the effects of puberty blockers are not permanent if treatment is discontinued and that many effects of hormone therapy can also be reversed. Long-term risks may include fertility challenges and possible harm to bone density, but the Academy says those risks require further study.\nWorldwide, several countries which had previously embraced the treatments for transgender children have subsequently reversed course,citing unclear dataabout their purported benefits and alleged harms. In many of those places, the treatments remain available, but on a much more limited basis.\nIn Tennessee, there are an estimated 3,000 transgender teenagers between ages 13 and 17, according to theWilliams Instituteat UCLA Law School, which has analyzed Census data. It is not known how many were receiving treatments that are now outlawed or how many suffered alleged harm.\nA studypublishedin the medical journal JAMA Pediatrics in October 2024 found the overwhelming majority of participants in a long-term survey of 220 transgender youths reported high levels of satisfaction and low levels of regret in the three to five years after receiving puberty blockers and hormone therapy.\nMajor American medical associations have for more than a decadeendorsed the useof puberty blockers and hormone therapy as part of \"individually tailored interventions\" to support trans kids and affirm their sense of self.\n\"It all begins and ends with science. This is not about any sort of agenda,\" said Dr. Ben Hoffman, president of the American Academy of Pediatrics, in an interview with ABC.\nClinical practice guidelines from theAmerican Endocrine Society-- based on more than 260 research studies -- recommend consideration of medications to treat gender dysphoria in young people but waiting until a child reaches adulthood to consider gender-affirming surgery.\n\"It's crucial that there be a deep understanding of both the risks and benefits, and truly informed consent,\" Hoffman said. \"And for that reason, it is, by definition, going to take months or years.\"\nThe Williams family said the decision to use medication to delay LW's puberty followed months of careful consultation with medical experts and mental health providers. They said they grew worried that masculine changes to LW's body would compound her gender dysphoria.\n\"There is this time clock sitting here,\" said Brian Williams. \"The kids can go through puberty and it can have permanent effects on them. So these two things you're trying to balance at the same time.\"\n\"She's not suicidal, but she shouldn't have to be suicidal, right?, to get the care that she needs,\" added Samantha Williams. \"When that really hit me, I was like, 'OK, let's do blockers. Let's get moving.'\"\nMore than a year later, LW began receiving hormone therapy to better align her body with her gender identity. The course of treatment led to a reduction in discomfort.\n\"That was incredibly helpful,\" LW said. \"I feel amazing after that. You know, maybe it's just because the gender dysphoria was so bad.\"\nThe outcome of the case U.S. v. Skrmetti could have a sweeping impact on health care for the more than 300,000 American teens who identify as transgender, as well as the broader LGBTQ community.\n\"This is one of the most significant LGBTQ cases to ever reach the Supreme Court. I think this is an inflection point,\" said Chase Strangio, the ACLU attorney representing the Williams family. He will be the first openly transgender person to argue a case before the nation's highest court.\n\"Is this going to be a Bowers v. Hardwick type moment that sets off years of government legitimized discrimination against LGBTQ people? Or, is this going to be a Bostock moment that clarifies what we all have been assuming all this time, which is that LGBTQ people are protected under the Constitution and civil rights laws,\" Strangio said.\nIn its 1986 decision in Bowers, the court upheld state laws criminalizing private same-sex conduct; it was overturned in 2003. The Court's 2020 decision in Bostock v. Clayton County found that employment discrimination on the basis of sexual orientation and gender identity is illegal.\nTwenty-six states have laws banning gender-affirming treatments for minors, according to theHuman Rights Campaign, an LGBTQ advocacy group.\n\"What concerns me as a physician is that legislators are going to be able to make decisions about a diagnosis, which is very unusual. I mean, that really hasn't happened,\" said Dr. Susan Lacy, a physician who specializes in hormone management and transgender care for teens and adults at her private practice in Memphis.\nLacy, who is also a party to the Supreme Court case, agrees with Tennessee lawmakers that more research is needed on gender-affirming treatments for minors, but that a debate over the data shouldn't deny patients the chance to make an informed decision of their own.\n\"I think the most compelling thing is to listen to the patients,\" Lacy said. \"I have about 700 transgender patients out of about 3,000 total patients, and I have not seen anybody have a serious complication -- not one.\"\n\"I think we're just at a point where we're still in the process of treating people and having studies that will give us more and more data to support this treatment,\" she said.\nJohnson said he hopes the Supreme Court will upholdan appeals court rulingthat affirmed Tennessee's right to impose restrictions on treatments for transgender minors.\n\"States should be the laboratories of democracy,\" he said. \"We should be making the vast majority of decisions about what's best for our people, our constituents here in the statehouse.\"\nThe Williams family says care that has improved the life of their daughter should not be up for political debate.\n\"I want to listen to the doctors. I want to listen to my kid. I want to take care of her, you know?\" Brian Williams said.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Trump reacts to President Biden pardoning son Hunter before White House exit", "link": "https://abcnews.go.com/Politics/trump-calls-biden-pardoning-son-hunter-miscarriage-justice/story?id=116360980", "content": "The president-elect invoked imprisoned Jan. 6 rioters in his statement Sunday.\nPresident-elect Donald Trump has reacted to President Joe Bidenissuing a pardonfor his son, Hunter Biden, from a possible prison sentence for federal felony gun and tax convictions.\nTrump called the president's decision a \"miscarriage of justice\" while pointing to those imprisoned for the Jan. 6 riots on the Capitol in his post to Truth Social on Sunday.\n\"Does the Pardon given by Joe to Hunter include the J-6 Hostages, who have now been imprisoned for years? Such an abuse and miscarriage of Justice!\" Trump wrote.\nTrump's reaction Sunday comes months after he signaled a Hunter Biden pardon would be something worth considering if he returned to the White House for a second term.\nDuring an interview with conservative radio hostHugh Hewittin October, the president-elect said he \"wouldn't take it off the books\" when asked about pardoning the sitting president's son.\n\"See, unlike Joe Biden, despite what they've done to me, where they've gone after me so viciously... and Hunter's a bad boy. There's no question about it. He's been a bad boy. All you had to do is see the laptop from hell,\" he said.\n\"But I happen to think it's very bad for our country,\" Trump added.\nIn pardoning his son, President Biden spared Hunter the possibility of significant prison time stemming from convictions in two federal cases brought by Special Counsel David Weiss.\nOver the summer, a jury found Hunter Biden guilty on three felony counts related to his purchase and possession of a firearm while addicted to drugs.\nAnd in September, he agreed to plead guilty to nine tax-related charges, including three felonies, on the eve of what was expected to be a lengthy and grueling trial.\nFor the tax charges, Hunter Biden faced up to 17 years in federal prison and $1.35 million in fines. His gun-related conviction carried a potential of up to 25 years in prison. He was scheduled to face sentencing for both cases in the coming weeks – on Dec. 12 on the gun-related charges in Delaware, and Dec. 16 on the tax charges in California.\nTrump's reaction to President Biden's decision to pardon his son comes weeks after the twomet in the Oval Officeto call for a \"smooth\" transfer of power when Trump returns to the White House in January.\nThe two presidents, seated by a roaring fire, shook hands in front of reporters and news cameras on Nov. 13.\n\"Politics is tough, and it's, in many cases, not a very nice world but it is a nice world today,\" Trump said at the time. \"And I appreciate it very much. A transition that's so smooth, it'll be as smooth as it can get, and I very much appreciate that, Joe.\"\nABC News' Lalee Ibssa, Kelsey Walsh and Soo Rin Kim contributed to this report.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Washington DC reacts to President Biden pardoning son Hunter in shock decision", "link": "https://abcnews.go.com/Politics/president-biden-pardons-son-hunter-biden-daughter-ashley/story?id=116360693", "content": "Both sides of the aisle reacted after the pardon was issued Sunday.\nReactions started coming through shortly after the announcement on Sunday evening that President Joe Biden had pardoned his son, Hunter Biden, for his tax evasion andfederal gun charges.\nAreversal for the president, the pardon came about two weeks before his son was scheduled for sentencing in both cases: on Dec. 12 on the gun-related charges in Delaware, and on Dec. 16 on the tax charges in California.\nHunter Biden first released a statement directly after the pardon was issued, saying in part, \"I will never take the clemency I have been given today for granted and will devote the life I have rebuilt to helping those who are still sick and suffering.”\nShortly afterward, his sister, Ashley Biden, posted to her storieson Instagram: “Thank you, Dad! What they have tried to do to my brother is cruel + politically motivated. Period. Proud Sister + Daughter!”\nHowever, there was a less receptive response from Washington, D.C.\nHouse Oversight Committee Chairman James Comer, Republican of Kentucky, said President Biden \"lied from start to finish\" about the circumstances surrounding his son's case.\nIn a statement on Sunday, he said, \"Joe Biden has lied from start to finish about his family’s corrupt influence peddling activities. Not only has he falsely claimed that he never met with his son’s foreign business associates and that his son did nothing wrong, but he also lied when he said he would not pardon Hunter Biden.\"\n\"The charges Hunter faced were just the tip of the iceberg in the blatant corruption that President Biden and the Biden Crime Family have lied about to the American people,\" he added. \"It’s unfortunate that, rather than come clean about their decades of wrongdoing, President Biden and his family continue to do everything they can to avoid accountability.\"\nAnd Judiciary Chairman Jim Jordanposted on X: “Democrats said there was nothing to our impeachment inquiry. If that’s the case, why did Joe Biden just issue Hunter Biden a pardon for the very things we were inquiring about?”\nPresident-elect Donald Trump addressed the pardon by bringing up those who had been arrested for storming the Capitol on Jan. 6, 2021 -- whom he referred to as \"J-6 Hostages.\"\n\"Does the Pardon given by Joe to Hunter include the J-6 Hostages, who have now been imprisoned for years? Such an abuse and miscarriage of Justice!\" he posted to Truth Social.\nSteven Cheung, the spokesperson for President-elect Donald Trump, also responded indirectly, providing a statement to ABC News that said the circumstances go to show that the Department of Justice had weaponized the justice system -- before adding that Trump intends to fix that during his second term in the White House.\n“The failed witch hunts against President Trump have proven that the Democrat-controlled DOJ and other radical prosecutors are guilty of weaponizing the justice system,\" the statement said.\n\"That system of justice must be fixed and due process must be restored for all Americans, which is exactly what President Trump will do as he returns to the White House with an overwhelming mandate from the American people,\" it continued.\nHouse Democratic Rep. Greg Stanton of Arizona said in apost on Xthat he disagrees with President Biden's decision to pardon Hunter Biden, making him the first House Democrat to publicly disagree with the president on the decision.\nHe wrote, \"I respect President Biden, but I think he got this one wrong.\"\n\"This wasn’t a politically-motivated prosecution. Hunter committed felonies, and was convicted by a jury of his peers,\" Stanton added.\nSpokespersons for both Special Counsel David Weiss and Attorney General Merrick Garland did not have an immediate response to the pardon of Hunter Biden when reached by ABC News on Sunday.\nThis is a developing story. Please check back for updates.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Emotional Bidens commemorate World AIDS Day at the White House", "link": "https://abcnews.go.com/Politics/emotional-bidens-commemorate-world-aids-day-white-house/story?id=116356086", "content": "The president said the event showed the U.S. is united in fighting HIV/AIDS.\nPresident Joe Biden and first lady Jill Biden held an emotional commemoration for World AIDS Day at the White House on Sunday, expressing empathy with families who have lost loved ones and telling them they “felt a special obligation to use this sacred place to ensure everyone is seen.”\nBehind the Bidens, a giant red ribbon hung on the South Portico and the AIDS Memorial Quilt was placed across the South Lawn. The quilt now with 50,000 panels with 110,000 names and weighs 54 tons. This was the first time it has beendisplayed on the lawn.\n“Like the first threads of this quilt… this movement is fully woven into the fabric and history of America,” Biden said. “Shining a light on the memory and the legacy of all the sisters and brothers, sons and daughters, husbands and wives, moms and dads, partners and friends who have lost, we've lost to this terrible disease.”\nThe president and first lady were emotional throughout the event, with the president appearing to occasionally wipe tears from his face during Jill Biden’s remarks and the first lady choking up as she spoke in front of survivors, their families and advocates.\n“And though we are strangers, we know untellable truths about one another that we will spend the rest of our lives longing for a face that's gone forever,” Jill Biden said, having to pause for a moment. “And that when they left our world, they took a light inside us with them.”\n“As I look at this beautiful quilt with its bright colors, the names in big block letters, renderings of lives and loves, I see it as a mom, and I think of the mothers who stitched their pain into a patchworked panel so the world would remember their child not as a victim of a vicious disease, but as a son who had played in the high school jazz band, as a child, who grew up to proudly serve our nation in uniform, as the daughter whose favorite holiday was Christmas,” she continued.\nPresident Biden is no stranger to grief and often references his own loss during similar events. On Sunday he acknowledged that though the ceremony was a celebration of those lives lost, “they bring back all the memories.”\n“They're hard. It's not easy. It's important, but it's not easy.”\nHe said the White House ceremony sends a “clear message” to the world that the U.S. stands united in the fight against the epidemic.\n“Together, we honor the spirit of resilience and the extraordinary strength of people, families and communities affected by HIV/AIDS. Including nearly 40 million people living with HIV around the world today,” he said.\nBiden pointed out the “stigma of misinformation” and failures of the U.S. government to act when the epidemic was raging, saying it “compounded pain and trauma for a community watching a generation of loved ones and friends perish.”\n“It was horribly, horribly wrong,” he said.\nBiden highlighted the progress that’s been made under his administration in the fight against HIV/AIDS and fighting the stigma of discrimination against the HIV community. He also called attention to Dr. Anthony Fauci, who attended the event, for his leading efforts to advance the fight over his career.\nAs he prepared toleave for Africain the evening, Biden credited former President George W. Bush for creating PEPFAR, the President's Emergency Plan for AIDS Relief, which has improved outcomes for people living with HIV on the African continent and saved more than 26 million lives globally.\nBiden said he plans to call on Congress to pass a five-year PEPFAR reauthorization to sustain this progress before he leaves office in January.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Trump picks daughter Tiffany's father-in-law Massad Boulos as senior Mideast adviser", "link": "https://abcnews.go.com/Politics/trump-picks-daughter-tiffanys-father-law-massad-boulos/story?id=116351766", "content": "It was the second straight day Trump picked a family member for his team.\nFor the second time in as many days, President-elect Donald Trump announced he is picking another family member for his administration, choosing his daughter Tiffany Trump's father-in-law as asenior Middle East advisera day after picking son-in-law Jared Kushner's dad to serve as ambassador to France.\nBillionaire businessman Massad Boulos, father of Trump's son-in-law Michael Boulos, will serve as White House senior adviser on Arab and Middle East affairs, Trumpannouncedon his Truth Social media platform. Born in Lebanon, Massad Boulos runs Nigeria-based Boulos Enterprises, which produces and distributes mechanical equipment and motorcycles.\n\"Massad is an accomplished lawyer and a highly respected leader in the business world, with extensive experience on the International scene,\" Trump wrote. \"He has been a longtime proponent of Republican and Conservative values, an asset to my Campaign, and was instrumental in building tremendous new coalitions with the Arab American Community.\"\nTrump added, \"Massad is a dealmaker, and an unwavering supporter of PEACE in the Middle East. He will be a strong advocate for the United States, and its interests, and I am pleased to have him on our team.\"\nDuring the final stretch of Trump's victorious presidential campaign, Boulos appeared with him at campaign stops in Dearborn, Michigan, an Arab American stronghold, and was praised by Trump for helping him flip Michigan from a blue to a red state.\n“Obviously the No. 1 point that is of high priority within the Arab American community is the current war in the Middle East,\" Boulos toldThe Associated Press in June. \"And the question is, who can bring peace and who is bringing war? And they know the answer to that.\"\nIn September, Boulos met with Palestinian Authority President Mahmoud Abbas on the sidelines of the United Nations General Assembly, theNew York Times reported. Palestinian officials told the Times the meeting was part of an outreach effort to Trump, but Boulos told the newspaper that it was \"purely personal\" and that he didn't inform Trump about it before or after.\nBoulos also has close contacts in the Lebanon political world and made an unsuccessful run in 2018 for a seat in Lebanon's Parliament.\nAs a young man, Boulos moved to Texas, where he obtained a doctorate in jurisprudence at the University of Houston. After earning his law degree, he joined his family’s business, rising to CEO.\nMichael Boulos and Tiffany Trump, the daughter of Trump and his second wife, Marla Maples, were married in November 2022 at Trump's Mar-a-Lago Club in Palm Beach, Florida. While campaigning in Detroit in October, Donald Trump announced the couple was expecting their first child.\nThe announcement of Boulos being picked as a White House senior adviser came a day after Trump picked billionaire real estate developer Charles Kushner to serve as ambassador to France. Kushner is the father of Trump's son-in-law Jared Kushner, who served as a senior White House adviser during Trump's first term as president.\nJared Kushner is married to Trump’s eldest daughter, Ivanka.\nCharles Kushner pleaded guilty in March 2005 to assisting in the filing of false tax returns, retaliating against a cooperating witness and making false statements to the Federal Election Commission. He was sentenced to two years in prison.\nTrump granted Kushner a pardon in December 2020.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Two more Democrats join race for Democratic National Committee chair", "link": "https://abcnews.go.com/Politics/democrats-join-race-democratic-national-committee-chair/story?id=116353329", "content": "Wisconsin Dem chair and former Senate candidate from Maryland join the field.\nTwo more Democrats on Sunday announced their intentions to run for Democratic National Committee chair.\nBen Wikler, chairman of the Democratic Party of Wisconsin since 2019, said in avideoannouncing his candidacy, “Today, the country we love needs the Democratic Party to be stronger. To unite. To fight. And to win.”\nAnd in a letter to DNC members, Robert Houton, a onetime U.S. Senate candidate from Maryland, launched his bid, saying he wanted to “lead and grow our Democratic party to champion electoral and transformative, legacy victories in 2025, 2026, 2027, 2028, and beyond.”\nThey join a growing field with New York state Sen.James Skoufis, who announced his candidacy on Saturday, Martin O'Malley, the former Maryland governor who has served as commissioner of the Social Security Administration since December 2023, and Ken Martin, a vice chairman of the DNC who also leads the Minnesota Democratic-Farmer-Labor Party.\nJaime Harrison, the current chairman, is not seeking a second term.\nIn an interview with CNN after announcing his candidacy, Wikler said he’s running to stop Republicans from “ripping this country apart and ripping off working people.”\nAsked by CNN what he believes is the biggest problem Democrats currently face, Wikler suggested voters don’t believe that Democrats have their backs.\n\"The central problem is that voters, many voters, have internalized this idea that Democrats are not on their side,” he said. “They're not fighting for working families every day. They have other agendas. That is the Republicans’ line of attack.\"\nWikler and Martin are the front-runners.Elections are on Feb. 1at the party’s annual winter meeting at National Harbor, Maryland.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "North Carolina was a ‘bright spot’ for Democrats, governor-elect says", "link": "https://abcnews.go.com/Politics/north-carolina-bright-spot-democrats-governor-elect/story?id=116341521", "content": "Stein tells “This Week” that Harris was hindered by a “tough national mood.”\nAfter prevailing in a state that went for Republican Donald Trump, Democratic Gov.-elect Josh Stein said that his service as North Carolina's attorney general gave voters confidence and called the Tar Heel state a \"bright spot\" for Democrats on election night.\nStein told ABC's \"This Week\" co-anchor Jonathan Karl that Kamala Harris ran a \"strong campaign,\" but was hindered by a condensed timeline and \"tough national mood.\"\n\"It was an unfortunate night for Democrats across this country, but North Carolina was a bright spot,\" Stein said. \" And we're proud of what we accomplished here.\"\nFresh off his gubernatorial victory, Stein pointed to Democrats winning North Carolina's secretary of state and attorney general races. As North Carolina's current attorney general, he defeated Republican Lt. Gov. Mark Robinson, whose campaign was plagued byallegationsof past racist, homophobic and anti-Semitic comments.\nStein outperformed Harris in North Carolina,winning 55% of the vote to Harris' 48%. In the statehouse, Democrats won enough seats to stave off a Republican supermajority. Steinheavily outraisedhis opponent and used social media to highlight Robinson's incendiary remarks.\nWhile Democrats have won eight of the last nine gubernatorial races in the Tar Heel state,Barack Obamawas the last Democrat to take North Carolina in 2008.\nAsked to explain his swing state victory, Stein said his campaign was about \"fighting for every person.\"\n\"Voters had a really clear choice,\" said Stein. \"Our vision was positive and forward-looking.\"\nHe pointed to a focus on public safety, education and personal freedoms, including voting rights and reproductive rights. Stein also said his position as attorney general lent a familiarity with voters.\n\"I think the fact that I had a track record of delivering for the people of North Carolina as their attorney general helped give them confidence in knowing that I wasn't just speaking words, but that I would work hard every day to deliver,\" Stein said.\nStein has promised to govern in a bipartisan way. Inhis victory speech, he spoke about the importance of working across the aisle since \"no person or party has a monopoly on good ideas.\"\nHe spoke aboutHurricane Helenerecovery efforts across North Carolina andhis recent visitto Washington to advocate for relief funding alongside Republican legislators. Stein said he is \"eager\" to work with the Trump administration to provide relief.\nPressed on his biggest fear in a second Trump term, Stein pointed to the president-elect's selection of hardlinerKash Patelto lead the FBI. Patel is one of Trump's fiercest defenders and has said he would turn the FBI into a museum for the \"Deep State.\"\n\"I want somebody who respects the rule of law,\" Stein said. \"And [Patel's] nomination for the FBI does not give me confidence that that's a top priority,\"\nAsked about Trump's promise of mass deportations, Stein said that it's \"not a priority\" to deport law-abiding citizens.\n\"They are instrumental to our communities, they are instrumental to our economy,\" he said.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "GOP senator praises current FBI Director Christopher Wray, calls Putin a 'tyrant'", "link": "https://abcnews.go.com/Politics/gop-senator-praises-current-fbi-director-christopher-wray/story?id=116341518", "content": "Rounds has “no complaints” about the FBI director that Trump wants to fire.\nRepublican Sen. Mike Rounds emphasized his support for current FBI Director Christopher Wray after President-elect Donald Trump announced he intended to nominate loyalist Kash Patel for the department's top job.\n“I think the president picked a very good man to be the director of the FBI when he did that in his first term,” Rounds told ABC \"This Week\" co-anchor Jonathan Karl about Wray. “When we meet with him behind closed doors, I've had no objections to the way that he's handled himself, and so I don't have any complaints about the way that he's done his job right now.”\nHowever, Rounds reiterated the president-elect’s right to select his Cabinet and Trump's selection of Patel is not surprising.\n“It doesn't surprise me that he will pick people that he believes are very loyal to himself, and that's been a part of the process,” Rounds said. “Every president wants people that are loyal to themselves.”\nIn his book \"Government Gangsters,\" Patel calls for a \"comprehensive housecleaning\" of the Justice Department and an eradication of \"government tyranny\" within the FBI, promising to fire and prosecute officials. Patel has also promoted conspiracy theories about the “Deep State” and vehemently defended Jan. 6 rioters.\nFBI directors are nominated and confirmed to serve 10-year terms. After being nominated by Trump, Wray's term began in August 2017. Months earlier, Trump had fired James Comey, who was still less than four years into his tenure as director. Trump did not mention Wray in his Truth Social post announcing Patel for director, but unless Wray resigns the position, Trump will have to fire him to nominate a new leader.\n\"The president has the right to make nominations, but normally these are for a 10-year term,\" Rounds explained. \"We'll see what his process is and whether he actually makes that nomination.\"\nRounds reiterated that although the Senate will give Trump the “benefit of the doubt,” it will uphold its “constitutional role.”\n\"We still go through a process, and that process includes advice and consent, which, for the Senate, means advice or consent sometimes,\" Rounds promised.\nTurning to the global stage, Rounds — a staunch supporter of the U.S. aiding Ukraine in its war against Russia — called Russian President Vladimir Putin a “tyrant” and suggested that negotiating with him may be futile.\n“I think Mr. Putin is a tyrant. I think dealing with him is going to be extremely difficult,” Rounds said, expressing hope for Trump to succeed but recognizing that this would present a challenge for “any president.”\n“I want to see Ukraine with its sovereignty protected,” he said. “I just think it's going to be a major, major task to overcome what Putin is offering” on Ukraine giving up territory to end the war.\nHe added that you cannot trust “a guy that doesn't honor their word,” which he says Putin has done.\nIn regard to Trump’s promise to slap 25% tariffs on all imports from Canada and Mexico, Rounds said the president-elect is a “successful businessman\" who \"really does believe that tariffs can be a great tool.\"\n“He thinks that by suggesting these tariffs right now, he's going to get the attention of the leaders in the other countries,” Rounds said, adding that Trump believes the tariffs will “fix our borders.”\nHowever, Rounds also recognized the potential impact tariffs could have on his constituents, particularly South Dakota farmers who could be affected by the tariffs.\nIn 2018,Chinaretaliated against Trump’s tariffs by implementing its own on U.S. soybean exports that hurt U.S. farmers.\n“Look, we're an [agricultural] state. And when I talk to my farmers and to my ranchers about that, they're concerned about retaliation,” Rounds said, though he added that they understand the importance of tariffs, especially when it comes to the border.\n“If we've got to have tariffs, so be it,” he said. “We’re going to support the president.”\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Biden team wants to finish strong on Ukraine, Gaza", "link": "https://abcnews.go.com/Politics/biden-team-finish-strong-ukraine-gaza/story?id=116341514", "content": "Sullivan: Biden's team will \"do everything in our power\" in its final 50 days.\nNational Security Adviser Jake Sullivan said Sunday that President Joe Biden is looking to make as much progress as possible on foreign policy before he leaves office next month.\nIn an interview with \"This Week\" co-anchor Jonathan Karl, Sullivan said that Biden is hoping to surge aid to Ukraine and move forward with ceasefire talks betweenIsraeland Hamas with his time left in office. Both conflicts have dogged the administration, with Ukraine struggling to retake territory it lost to Russia and little progress in Gaza despite a ceasefire between Israel and Hezbollah in Lebanon.\n\"We are going to do everything in our power for these 50 days to get Ukraine all the tools we possibly can to strengthen their position on the battlefield so that they'll be stronger at the negotiating table. And President Biden directed me to oversee a massive surge in the military equipment that we are delivering to Ukraine so that we have spent every dollar that Congress has appropriated to us by the time that President Biden leaves office,\" Sullivan said.\nWhen pressed on clinching a deal in Gaza and possibly broader diplomatic breakthroughs between Israel and Arab countries like Saudi Arabia, Sullivan said, \"The first step is getting the ceasefire and hostage deal. If we can get that into effect, then the possibilities for a broader diplomatic initiative in the region along the lines that you just described really open up, and we will use every day we have in office to try to generate as much progress towards that end as possible.\"\nMaking progress on both fronts remains a tall order for multiple reasons. The U.S. has vowed to not make any decisions about Ukraine without Kyiv's input and the Israeli government has appeared reluctant to wind down fighting in Gaza.\nAnd with President-elect Donald Trump entering office, foreign policy priorities will undoubtedly be shaken up. Trump is believed to be unlikely to pressure Israel to scale back its military operations in Gaza, and he has appeared skeptical of sending aid to Ukraine at the same pace the Biden administration has.\n\"I've encouraged the Ukrainian team to engage the incoming team as well as to engage all of our allies and partners, because, again, on Jan. 21, the war in Ukraine doesn't just go away. Obviously, the new team will have its own policy, its own approach, and I can't speak to that, but what I can do is make sure that we put Ukraine in the best possible position when we hand off the baton,\" Sullivan said, referencing the day after Trump takes office.\nStill, Sullivan debunked a report suggesting that the administration is open to returning nuclear weapons to Ukraine.\n\"That is not under consideration. No. What we are doing is surging various conventional capacities to Ukraine so that they can effectively defend themselves and take the fight to the Russians, not nuclear capability,\" he told Karl.\nSullivan did say, however, that the transition is going smoothly.\n\"We got a lot of work to do, and frankly, we're going to try to do that also in a way where we have a smooth transition with the incoming Trump team. And I have to say that I've been gratified so far by the coordination I've been able to have with the incoming Trump team. They seem focused also on a smooth transition, because they want to be able to hit the ground running,\" he told Karl.\nAfter Trump takes office, however, things become less clear.\nTrump on Saturdaytapped Kash Patel, a loyalist and vocal critic of the Justice Department, as his pick to lead the FBI. Patel has railed against the so-called \"Deep State,\" naming Sullivan as a member.\nWhen pressed on if that pick concerns him, Sullivan dodged.\n\"I'm not going to speak to President-elect Trump's nominees. I'll let him and his transition team speak to that,\" Sullivan said.\n\"We inherited an FBI director who actually had been appointed by President Trump, Director Chris Wray, who has continued to serve in that role through the four years of the Biden administration, and served with distinction, served entirely insulated from politics where the partisan preferences of the current sitting president of the United States. This is a good, deep, bipartisan tradition that President Biden adhered to.\"\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "'This Week' Transcript 12-1-24: Jake Sullivan & Sen. Mike Rounds", "link": "https://abcnews.go.com/Politics/week-transcript-12-1-24-white-house-national/story?id=116341524", "content": "This is a rush transcript of \"This Week\" airing Sunday, December 1.\nA rush transcript of \"This Week with George Stephanopoulos\" airing on Sunday, December 1, 2024 on ABC News is below. This copy may not be in its final form, may be updated and may contain minor transcription errors. For previous show transcripts, visit the \"This Week\"transcript archive.\n(COMMERCIAL BREAK)\nANNOUNCER: THIS WEEK WITH GEORGE STEPHANOPOULOS starts right now.\n(BEGIN VIDEO CLIP)\nJONATHAN KARL, ABC \"THIS WEEK\" CO-ANCHOR: Trump's retribution.\nKASH PATEL, DONALD TRUMP’S NOMINEE FOR FBI DIRECTOR: I am going to go on a government gangster’s manhunt in Washington, D.C., for our great president. Who's coming with me?\nKARL: The president-elect names Kash Patel to serve as FBI director. A loyalist who said Trump's political opponents should be very afraid. And may be the toughest confirmation battle yet.\nTransition diplomacy.\nJUSTIN TRUDEAU, CANADIAN PRIME MINISTER: He would be actually not just harming Canadians, he’d actually be raising prices for American citizens as well.\nKARL: Donald Trump threatens new tariffs on Canada and Mexico. President Biden faces multiple conflicts abroad and pushes for a Middle East breakthrough.\nJOE BIDEN, PRESIDENT OF THE UNITED STATES: This is designed to be a permanent cessation of hostilities.\nKARL: Russia hammers Ukraine’s power grid, plunging over a million people into darkness, with freezing temperatures settling in.\nVOLODYMYR ZELENSKYY, UKRAINIAN PRESIDENT: We know our enemy. We know that he will not stop.\nKARL: Our guest, White House National Security Adviser Jake Sullivan, with reaction from Republican Senator Mike Rounds, a key member of the Intelligence and Armed Services Committees.\nPlus, North Carolina Governor-elect Josh Stein, a Democrat who won big where Kamala Harris lost. Rick Klein breaks down the House Republicans' razor-thin majority. And the roundtable on the latest surprise from Donald Trump.\n(END VIDEO CLIP)\nANNOUNCER: From ABC News it’s THIS WEEK. Here now, Jonathan Karl.\nKARL: Good morning. Welcome to THIS WEEK. I hope you all had a great Thanksgiving.\nIf there was any doubt that President-elect Donald Trump intends to follow through with his promises of radical change and retribution, both here at home and abroad, those doubts have been erased. On the home front, the big move came just last night when Trump announced he intends to make Kash Patel, one of his most fervently loyal defenders, as the director of the FBI. He'll first have to fire the current director, Chris Wray, who was chosen by Trump back in 2017, and whose term isn't up for more than two years. Patel will face an especially contentious confirmation battle.\nPatel is so controversial that when President Trump talked about making him the deputy FBI director in 2020, then Attorney General Bill Barr said it would happen, quote, “over my dead body,” according to his memoir, adding, quote, “Patel had virtually no experience that would qualify him to serve at the highest level of the world's preeminent law enforcement agency. The very idea of moving Patel into a role like this showed a shocking detachment from reality.”\nAgain, that was Bill Barr objecting to Patel becoming the deputy FBI director. Now Trump has announced his intention to make him the director.\nPatel has served as both a public defender and a federal prosecutor. He also served on Trump's National Security Council and in the office of the Director of National Intelligence. After the 2020 election, Patel was dispatched to the Pentagon. As I previously reported, he used his post as chief of staff to the acting defense secretary to attempt to chase down one of the most far-fetched election conspiracy theories, that Italian spy satellites were used to flip votes from Trump to Biden.\nAfter Trump left the White House, Patel took up the cause of fighting back against anyone and everyone in law enforcement who was investigating Donald Trump. He even wrote a children's book about Trump's legal troubles called \"Plot Against the King.\" But it's the book that Patel wrote for adults, \"Government Gangsters,\" that gives an idea of what he would attempt to do as the FBI director. He writes that federal law enforcement agencies must be brought to heel by firing the top ranks and prosecuting to the fullest extent of the law anyone who in any way abused their authority for political ends. “The FBI has become so thoroughly compromised that it will remain a threat to people unless drastic measures are taken,” Patel wrote, adding Democrats, “should be very afraid.”\nTrump has also been shaking things up and rattling nerves on the world stage. He began the week by threatening to immediately impose steep tariffs on America's three largest trading partners when he takes office on January 20th. That threat prompted a call to Trump from Mexico’s president and a trek to Mar-a-Lago by Canada's prime minister.\nOf course, America has only one president at a time. But with big changes coming, the rest of the world isn't waiting until Trump moves into the White House. The man still in the White House, President Biden, urged Trump to reconsider his latest tariff threats.\nBiden has had a busy week too, facing threats from Putin and Russian advances in Ukraine while brokering a ceasefire this week between Hezbollah and Israel. The Biden White House is trying to leverage the Hezbollah deal to get a ceasefire and a hostage release deal with Hamas in Gaza. As Peter Baker put it in \"The New York Times,\" quote, “this is America in the time of transition, two presidents leading the country in two different directions, one officially, the other unofficially, one representing the past and present, the other, the future. Whipsawed and maybe just a little confused, foreign leaders are left to calculate whether it makes sense to try to get something done with the outgoing leader or brace for the reality of his successor.”\nAnd we begin with White House National Security Adviser Jake Sullivan.\nJake, thank you very much for being here with us.\nI want to get to all that’s happening around the world, but first I've got to ask you about the news Trump made overnight appointing Kash Patel as the director of the FBI, or his intention to nominate him for that position.\nPatel listed you in one of his books as members of the executive branch deep state, and one of the 60 corrupt actors of the first order.\nDoes this nomination concern you?\nJAKE SULLIVAN, WHITE HOUSE NATIONAL SECURITY ADVISER: Well, I'm not going to speak to President-Elect Trump’s nominees. I'll let him and his transition team speak to that.\nI would just point out what the Biden administration did in approaching the question of the FBI director. As you know, FBI directors are appointed for 10-year terms. And the idea being that they extend beyond the term of any given president. And so we inherited an FBI director who actually had been appointed by President Trump, Director Chris Wray, who’s continued to serve in that role through the four years of the Biden administration and served with distinction, served entirely insulated from politics, where the partisan preferences of the current sitting president of the United States.\nThis is a good, deep, bipartisan tradition that President Biden adhered to. And that’s really all I can say.\nAs for me personally, I got 50 days left to continue to try to protect this country from threats, to continue to advance our national interest. I'm going to spend every day doing that and not worrying about other things.\nKARL: And – but this is somebody who’s talked about retribution, has talked about the need – he’s suggested even prosecting – he’s saying that the Democrats, quote, “should be very afraid,” and again named you as one of the corrupt actors of the first order.\nSo, put aside the nomination to be FBI director. Does this kind of talk concern you about what’s going to happen after January 20th?\nSULLIVAN: Well, look, like I said, John, I can’t worry about after January 20th. I have to worry about until January 20th. And the full spectrum of challenges and opportunities the United States has to advance our national interest. I'm the national security adviser of the United States. My job is to try to protect this country, to try to reduce the capacity of our adversaries, increase the capacity of our allies. We’ve got a lot of work to do. And, frankly, we’re going to try to do that also in a way where we have a smooth transition with the incoming Trump team.\nAnd I have to say that I've been gratified so far by the coordination I've been able to have with the incoming Trump team. They seem focused also on a smooth transition because they want to be able to hit the ground running.\nSo, that is going to preoccupy me between now and January 20th. Nothing else.\nKARL: Yes, how is that working because, on the one hand, you, obviously, have a lot on your plate. You just had the – the ceasefire deal with Hezbollah. You’re trying to work out something in Gaza with – with Hamas. You’ve got, obviously, all that’s happening in Ukraine.\nAt the same time, Donald Trump is meeting with Prime Minister Trudeau. He’s got calls with the Mexican president, other world leaders. How does this work? I mean basically you don’t have two presidents at once, but you’ve got world leaders trying to work with both an incoming and an outgoing president. How does that coordination work?\nSULLIVAN: Well, transitions always have a little bit of awkwardness to them because you have an incoming team with a different policy than the outgoing team. And, of course, leaders around the world have to begin adjusting to that.\nOn the other hand, there is one president at a time. And that president is President Joe Biden, who, in fact, is leaving this evening on a foreign trip to Angola, who has just negotiated a ceasefire in Lebanon, who is working actively on a ceasefire and hostage deal in Gaza, who met with Xi Jinping a week ago and made a very important statement about AI and nuclear weapons.\nSo, we are working through a lot every single day. We just did a – you know, got some Americans home from China. So, we’ll keep doing our job day in day out, but we are going to work closely with the incoming team because so many of these challenges are -- are not going to change fundamentally on January 21st. They’re still going to be there. And we want to make sure that baton gets passed very smoothly.\nSo far, I have to say, I think the – the coordination and the work together has been in good faith, has been professional, and has been designed to try to insure that smooth transition.\nKARL: What are you telling your Ukrainian counterparts about American support in 51 days after Biden leaves office?\nSULLIVAN: Well, first, what I'm saying is, we are going to do everything in our power for these 50 days to get Ukraine all the tools we possibly can to strengthen their position on the battlefield so that they’ll be stronger at the negotiating table. And President Biden directed me to oversee a massive surge in the military equipment that we are delivering to Ukraine so that we have spent every dollar that Congress has appropriated to us by the time that President Biden leaves office. So, that’s, first and foremost, what we’re focused on.\nAnd then I've encouraged the Ukrainian team to engage the incoming team, as well as to engage all of our allies and partners because, again, on January 21st, the war in Ukraine doesn’t just go away. Obviously, the new team will have its own policy, it’s own approach. And I can’t speak to that. But what I can do is make sure that we put Ukraine in the best possible position when we hand off the baton.\nKARL: Well, let me ask you about that. “The New York Times” reported on the various measures that you’re taking to shore up Ukraine's defensive -- defenses at this critical moment. And the article said this, quote: Several officials even suggested that Mr. Biden could return nuclear weapons to Ukraine that were taken from it after the fall of the Soviet Union. That would be an instant and enormous deterrent, but such a step would be complicated and have serious implications.”\nIs -- is that something that’s under consideration, that’s under consideration, that the U.S. would return nuclear weapons to -- to Ukraine? Is that something you’re considering?\nSULLIVAN: That is not under consideration. No. What we are doing is surging various conventional capacities to Ukraine so that they can effectively defend themselves and take the fight to the Russians, not nuclear capability.\nKARL: And are you seeing that there’s -- there’s talk about a peace process that, you know, we -- Trump has now appointed General Kellogg to be his envoy to Russia/Ukraine peace process. And the idea here is that Ukraine would give up some of its land in exchange for peace.\nAre you seeing any indication that Zelenskyy is willing to do that?\nSULLIVAN: Look, the key thing, from my perspective, is that Ukraine determine its destiny and its destiny, not be imposed by outside powers, including the United States.\nNow, President Zelensky has made public comments about the need for this war to end at the negotiating table. Meaning, he knows ultimately there’s going to have to be a negotiation. And, in fact, over the course of 2024, we’ve been very engaged with President Zelenskyy and his team on what the shape of that negotiation could look like. And the key thing for this year was to try to give Ukraine as many tools as possible so that they could go into that negotiation and feel they could achieve the outcome that they would like to see.\nNow, as far as territory or security or other elements, I'm not going to speak to that publicly. I think President Zelenskyy should be the one who chooses to speak to that because, ultimately, it’s his country we’re talking about.\nKARL: There’d been a report that Trump had spoken with Vladimir Putin. I guess it wouldn’t be surprising. He’s speaking with a lot of world leaders. But it’s been denied by both the Kremlin and by Trump. Are you -- do you think that call happened? Do you have any knowledge of that?\nSULLIVAN: I really don’t know. I – I read it in the newspaper. I also saw the denials. So, I -- I, honestly, can’t speak to it one way or the other.\nKARL: OK. And let me ask you about another big one. You -- the -- the president’s made it clear, he wants to have a ceasefire and hostage release deal with Hamas for Gaza. He’s also suggested that he wants, before he leaves office, to have a broader Middle East peace deal that would involve a pathway to a Palestinian state and peace between Saudi Arabia and Israel.\nDo you really think that’s something that you could do in the next 50 days?\nSULLIVAN: What I would say is that the first step is getting the ceasefire and hostage deal. If we can get that into effect, then the possibilities for a broader, diplomatic initiative in the region along the lines that you just described really open up. And we will use every day we have in office to try to generate as much progress towards that end as possible.\nSo, we are determined to try to move rapidly, to get those hostages home, get a ceasefire in place, and then move on to this larger deal that we would like to see consummated as soon as possible, including, if possible, while President Biden is still president.\nKARL: OK, we’ve got to go, but before you leave, I have to ask you, are you prepared for life as a congressional spouse? Your wife, of course, will be sworn in as a member of Congress in January.\nSULLIVAN: Well, I just have to say, I am so proud of Maggie. And she is going to serve New Hampshire and serve the country just exceptionally well. And I'm looking forward to supporting her every step of the way.\nKARL: All right, Jake Sullivan, thank you very much.\nI'm joined now by Republican Senator Mike Rounds of the great state of South Dakota.\nSenator Rounds, thank you for being here.\nI want to start with the news about Kash Patel. Were you surprised that Donald Trump said that he wants to make him the director of the FBI? Does that concern you?\nSEN. MIKE ROUNDS, (R) SOUTH DAKOTA& (R) ARMED SERVICES& INTELLIGENCE COMMITTEES: Well, every president has the opportunity to decide who he wants to offer a nomination for. So, all of the nominations coming through, the president has the right to do. It doesn't surprise me that he will pick people that he believes are very loyal to himself. And that's been a part of the process. Every president wants people that are loyal to themselves.\nBut I’ll also share with you that Chris Wray, you know, who the president nominated the first time around, I think the president picked a very good man to be the director of the FBI when he did that in his first term. When we meet with him behind closed doors, I’ve had no objections to the way that he's handled himself. And so I don't have any complaints about the way that he's done his job right now. And, once again, the president has the right to make nominations, but normally these are for a ten-year term. We'll see what his process is, and whether he actually makes that nomination. And then, if he does, just as with anybody who is nominated for one of these positions, once they’ve been nominated by the president, then the president gets, you know, the benefit of the doubt on the nomination, but we still go through a process, and that process includes advice and consent, which, for the Senate, means advice or consent sometimes.\nKARL: Yes, Wray was confirmed for a ten-year term, as you pointed out. You just said you have confidence in him. Is it a mistake to fire him? I mean why – why is Trump determined to fire the FBI director, let alone one that he nominated in the first place?\nROUNDS: You know, look, we – the – the one thing that we've learned is, is we don't speak for the president-elect. We simply respond when we're asked questions about what we're going to do. The message, and one that I feel very strongly about, is, is that there is a constitutional separation. The founding fathers did that for a reason. We will – you know, we accept that the president should have the people that he wants in his cabinet, and on his team. Every president wants that. We give them the benefit of the doubt. I did that when Biden came into office. I did that before when – when President Trump was elected. I looked the same way at it when President Obama made nominations. I will do that again. And I think the vast majority of the members of the Senate will do the same thing. They will give a benefit of the doubt to the president with any one of his nominees, but then we have a constitutional role to play in that we – we provide advice and consent. And, once again, that can be sometimes advice, sometimes it is consent. But that's the process. The process has worked. And I expect the process to continue on.\nAnd look, there will be open hearings. There will be an opportunity for these individuals, all of his nominees, to come before the members of the Senate. And most of the times we meet with them privately beforehand. And then once that is completed, we’ll go before committees. The committees will have an opportunity to question them. The vast majority of those will be in public. Some of it will be behind closed doors, but the vast majority of them will be in public. We’ll get an opportunity and the American people will have an opportunity to see both the questions that are raised and the answers that these nominees respond with. And then we'll move forward.\nKARL: All right, let me ask you about the other thing – one of the other things Donald Trump did this week. That is the threat to impose steep tariffs on Canada, Mexico, China. Do you think he's going to go through with these – with these threats, or is this a negotiating tactic?\nROUNDS: Look, the president's a businessman. A successful businessman. And, once again, he has not imposed them. He doesn't have the authority yet to impose them. But he is putting them out in front. And now he's got everybody coming in and talking with him, talking about the concerns that he is expressing because he really does believe that tariffs can be a great tool for making sure that our economy grows and thrives.\nOne more thing. The one thing that I have noticed time and again is, is he cares about kids. And what he has seen at the southern border, he's frustrated with. He doesn't like to see people suffering. He's seen what's happened as these migrants have come north. He wants it to stop. He thinks it's wrong. And he thinks that by suggesting these tariffs right now, he's going to get the attention of the leaders in the other countries.\nYou know, I don't think there's anybody out there arguing that we've got to fix our borders. If we can do that with tariffs, you're not going to find very many people in the United States that are going to disagree with him on that.\nOn the other hand, you know, look, I'm from South Dakota, you know that. Look, we're an ag state. When I talk to my farmers and to my ranchers about that, they're concerned about retaliation. You know what they tell me time and again? The borders are important. We're going to do our part as well.\nIf we've got to have tariffs, so be it. We're going to support the president. Let's get this thing rolling again, and I mean, look. They believe in his America first approach. We want to give him an opportunity to be successful in that.\nKARL: All right. Turning to Ukraine, you made some interesting comments recently casting doubts about the possibility of a -- of peace talks between Ukraine and Vladimir Putin, any kind of an agreement that would involve giving up territory in exchange for peace. Let's take a listen to what you said.\n(BEGIN VIDEO CLIP)\nROUNDS: It's time to take a hard look at this thing and really ask ourselves, do you believe that this tyrant, if you offer him part of a free country, do you think he's going to stop? As much as I would love to say that there is a path towards a peaceful resolution to this by negotiating with this tyrant, I suspect that we may be deceiving ourselves.\n(END VIDEO CLIP)\nKARL: But this is exactly what Trump's trying to do, right? He's named an envoy for these peace talks, which obviously haven't started or haven't been committed to by either side yet, but the framework appears to be exactly what you just said is problematic which is Ukraine giving to Russia territory that it has taken by force in exchange for peace.\nROUNDS: I don't think that we should deceive ourselves. I think Mr. Putin is a tyrant. I think dealing with him is going to be extremely difficult. I give -- I give President Trump credit for saying that he wants to end this. He wants to end the bloodshed. He doesn't like the suffering that's out there. I just think this is going to be an enormous task for anybody to negotiate with Putin.\nLook. I don't think this guy is interested in stopping anywhere that he's at right now. I think we have to recognize that. So I think the president has got a huge job on his hands if we're going to be successful in stopping Putin. I think wherever we look, Mr. Putin is going to do his best to find a weakness. If he finds a weakness within NATO, he's going to try to utilize that to his advantage.\nI think the fact that he has looked elsewhere in the world for opportunities to create problems and mischief for us, I think he's done that. So I think, and once again, not taking anything away from a president who wants to find peace, I just point out just how big of a project this is going to be for any president to be successful in negotiating with this tyrant, and I, you know, I wish him the best. I hope he is successful, but if you compare that, the fact that the president wants to end this with what's happened on the Biden administration, I think the fact that the Biden administration has shown some real weaknesses throughout the world.\nThe world is on fire, and people just simply haven't respected our leadership role. You can't win -- you can't slow down these fires across the country unless you lay out your dominance with the capabilities that you have, and the fact that you're going to fight for freedom. So, look, I want to see President Trump be successful in this. I want to see Ukraine with its sovereignty protected. I just think it's going to be a major, major task to overcome what Putin is offering, and I just simply don't know that we can trust this guy to make a deal and keep it.\nIf you take a look back, look, we made a deal with Ukraine. The United States was one of the parties. Russia was one of the parties, and that's when they gave up their nuclear weapons. It's not the United States that's causing the problems there in Ukraine right now. It is Russia going back on their written commitment to help protect the lines that were drawn in 1994. So once again, it is Putin going back on his country's word of honor.\nI don't think you can trust a guy that doesn't honor their word of honor.\nKARL: All right. Well, you're perfectly clear about that.\nSenator Rounds, thank you very much for joining us.\nWhen we come back, I'll talk to a Democrat who won big where Kamala Harris lost. We're back in just two minutes.\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nJOSH STEIN (D), NORTH CAROLINA GOVERNOR-ELECT: Tonight, the people of North Carolina resoundingly embraced a vision that's optimistic, forward-looking and welcoming, a vision that's about creating opportunity for every North Carolinian. We chose hope over hate, competence over chaos, decency over division.\n(END VIDEO CLIP)\nKARL: That was Democrat Josh Stein on election night after winning the governor's race in North Carolina, a battleground state that Donald Trump won by three points.\nGovernor-elect Josh Stein joins me now.\nThank you, Governor-elect, for being here.\nLet -- let me ask you. I understand you were up against a deeply flawed candidate, but you won, what was it, by 15 points or so, at the same time Harris was losing. Why did your message resonate in North Carolina so much more than Kamala Harris's?\nSTEIN: Well, I’m incredibly honored that the voters of North Carolina have bestowed the governorship to my responsibility. It's incredible privilege and I’m eager to get it to work. I think the voters had a really clear choice.\nOur vision was positive and forward-looking. Truly, it was about fighting for every person. We wanted to make sure that people live in safe neighborhoods free of drugs and violence. We want kids to go to excellent public school schools we want people to have real economic opportunity.\nAnd that applies to all people, even folks who don't go to college. They should be able to get good paying jobs that can support a family. And, of course, people's personal freedoms need to be respected, people's right to vote, women's right to be able to make their own reproductive health care decisions, and the choice was very clear.\nI think the fact that I had a track record of delivering for the people of North Carolina as their attorney general helped give them confidence in knowing that I wasn't just speaking words but that I would work hard every day to deliver.\nKARL: So -- so what did the Democrats fail to do on a national level? I mean, it sounds similar to what -- what Harris was talking about. Where did they -- where did they fall short?\nSTEIN: The vice -- the vice president ran a strong campaign in North Carolina. I think she ran out of time. She was -- a short, abbreviated campaign, it was a tough national mood as evidenced by the fact that Trump won all of the swing states. So she worked hard.\nBut the voters here in North Carolina embraced something very positive and it wasn't just our win, which was the strongest win in 44 years for a governor -- a Democratic governor candidate, but we defended the secretary of state and attorney general's office. We picked up the lieutenant governor and superintendent of public instruction. We've likely prevailed in the only Supreme Court race. We won the only congressional competitive governor -- competitive congressional race in the south and we broke the super majority in the state house.\nSo, it was an unfortunate night for Democrats across this country but North Carolina was a bright spot and we're proud of what we accomplished here.\nKARL: Democrats, during the campaign, spoke in pretty dire terms about what would happen if Trump won. So, now, he's won. What -- what are your expectations?\nLet me -- let me ask it this way, what would you say is your greatest hope and your biggest fear about what's to come in a second Trump presidency?\nSTEIN: Well, I want to do everything I can for the people of North Carolina. And right now, folks in western North Carolina are really suffering. Hurricane Helene left unimaginable devastation in its wake, many lives lost, thousands of buildings destroyed, homes and small businesses, infrastructure, critical infrastructure, water and sewer, wastewater, highways, parts of Interstate-40 fell into the river.\nSo we are looking at multi-billion dollars, $53 billion in damages. We have an appropriations request before Congress for $25 billion. I was up there in Washington two weeks ago with Governor Cooper, meeting with Senators Tillis and Budd and a number of Congressional officers. And I am eager to work with the Trump administration to deliver for the people of western North Carolina who need the help of the federal government and our state government to get back up on their feet.\nKARL: And your biggest fear?\nSTEIN: Well, I want somebody who respects the rule of law and his nomination for the FBI does not give me confidence that that's a top priority.\nKARL: And you -- one of the big issues related to that in a way is Trump's promise to have a mass deportation of undocumented immigrants. Is North Carolina going to cooperate with that -- with that deportation plan?\nSTEIN: Well, one thing about President Trump is he says a lot, and then you don't know what the actual policy behind the bluster is going to be. And so I have to wait to see what he actually proposes as opposed to what he says through Twitter or any other social media platform.\nKARL: But, you don't rule out working with him to deport some of those undocumented immigrants?\nSTEIN: Right now, if folks break the law and harm North Carolinians, they get deported as it is. Folks who are law abiding, deporting them is not a priority at all. They are instrumental to our communities. They're instrumental to our economy.\nKARL: All right, Governor-elect Stein, we're out of time. We look forward to continuing the conversation once you get sworn in as governor. Thank you very much for spending time with us this morning.\nComing up, what could the historically narrow GOP House majority mean for Trump's first 100 days in office? Rick Klein is here with the breakdown when we come back.\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nREP. MIKE JOHNSON (R-LA): The agenda will be fast-paced. The first hundred days will be very full because we have a lot to fix. And as I've said many times, I believe President Trump could be the most consequential president of the modern era because we have to fix everything.\n(END VIDEO CLIP)\nKARL: That was House Speaker Mike Johnson discussing the Republican Party's ambitions for the first hundred days with full control of Congress. But the numbers are going to make that extremely difficult, particularly in the House, where the GOP's tight margin is set to get trimmed further as at least two Republican House members leave Congress to serve in Trump's administration.\nOur Washington bureau chief and political director, Rick Klein, is here to break down the latest.\nRick, some very close numbers here.\nRICK KLEIN, WASHINGTON BUREAU CHIEF& POLITICAL DIRECTOR: Yes, Jon, if the current results hold, then Republicans will have secured a 220-215 advantage in the next Congress. That's actually two more Democrats than who serve right now in Congress despite those very tough redistricting maps and despite the coat tails of Donald Trump and him winning the popular vote, as well as the Electoral College. That by itself would be the tightest governing majority in almost a century.\nBut here's the thing. Things are going to get tighter almost certainly and actually very quickly. We've already heard from Matt Gaetz. He is not going to be Trump's next attorney general, but he has resigned from this Congress and said he won't serve in the next Congress. His fellow Florida congressman, Mike Waltz, he’s going to be Trump’s national security adviser. You don’t need to be confirmed by the Senate for that post.\nKARL: Yes.\nKLEIN: So, he’s going to resign he says on the first day of the Trump administration. And Elise Stefanik, the congresswoman from New York, is on tap to be the U.N. ambassador under Donald Trump. She would resign her seat when she's confirmed by – or if and when she's confirmed by the Senate. That leaves just a two-seat margin, 217-215. That means just one defection can sink any bill or two vacancies and almost nothing would be able to get done with that kind of margin.\nKARL: So, on any given vote, if all the Democrats show up, just one Republican misses a vote or votes the other way, no majority.\nSo, look, Republicans – presidents, Democrat, Republican, always face some tough votes early on. How does this margin compare to what we have seen with other recent incoming presidents?\nKLEIN: Yes, Congress rarely makes it easy for a brand-new president.\nKARL: Yes.\nKLEIN: But if you look back just at the last couple of presidents, an almost unthinkable margin that Barack Obama had, 79 votes plus for the Democrats in the House. You could lose almost 40 votes on any individual piece of legislation. And he needed those votes for things like Obamacare. And that was almost a filibuster-proof majority that he had in the Senate. Trump, the first time around, he was able to – he was able to spare 20-something Republicans on any individual vote, and he had a plus four margin that you could lose two in the Senate.\nAnd very tight margins for Joe Biden. He was plus nine in the House. And absolutely even, that 50/50 Senate.\nNow, Trump will have that stronger majority in the Senate, three votes to spare. That could be key in getting any of his cabinet picks confirmed. But it is that House majority that's going to be so tough to govern with. And it looks like it's going to take a while to get back to full strength. The special elections in Florida and New York would probably take until around April to complete. So, that first 100 days that Speaker Johnson talked about, they were going to be 100 days spent almost entirely with almost no margin for error on votes.\nKARL: So, they’ve got the trifecta. They’ve got the House, the Senate and the White House, but the margins are incredibly tight.\nAll right, Rick will stick around for the roundtable. We'll break down the latest on the Trump transition, including Trump's pick to lead the FBI.\nWe'll be right back.\n(COMMERCIAL BREAK)\nKARL: The roundtable is here. Former DNC chair, Donna Brazile, senior editor at “The Dispatch”, Sarah Isgur, “Wall Street Journal” national politics reporter Vivian Salama, and Rick Klein back with us.\nRick, let me start with you. We’ve had a lot of controversial picks. Kash Patel has to top the list.\nRICK KLEIN, ABC NEWS WASHINGTON BUREAU CHIEF& POLITICAL DIRECTOR: Start with the fact that he is creating the vacancy in order to fill it.\nKARL: Firing Chris Wray.\nKLEIN: He has to fire -- he has to fire the FBI director that he selected to replace the last FBI director.\nKARL: Who he fired.\nKLEIN: Who he fired as well. And then replacing him with someone who is a close personal and political ally, a foot soldier in what you might consider the Steve Bannon wing of the MAGA movement right now, and someone whose avowed statements around who he would do in a job like this have less to do with running the department and blowing it up, and yes, in punishing perceived political enemies.\nThis is beyond a provocative choice. I think it's going to test the limits of what Donald Trump can do in terms of -- in terms of approvals in the Senate, and it is a clear signal that when he talked about going in and blowing up a lot of Washington institutions, he was very serious about it, very serious about the rhetoric he used.\nAnd the people around him, ecstatic around this choice, the people, the close advisers -- although there were many doubtful as to whether this is a pick that’s going to be confirmed.\nKARL: All right. Sarah, let’s go a little history. So, you worked at the Trump -- at the Trump Justice Department the last time Donald Trump fired an FBI director as I recall, and when Chris Wray came into the job.\nHow is this move, Kash Patel to FBI -- again, needs confirmation -- how is it being received at the DOJ and the FBI?\nSARAH ISGUR, ABC NEWS CONTRIBUTOR: I mean, it reminds me a little bit of when Matt Gaetz was announced for attorney general. There were a lot of people in the Department of Justice currently or even those who were thinking of going in as political appointees that wanted to think twice about it at that point, but the Matt Gaetz thing is instructive as well because it didn’t actually happened. He never even got nominated.\nAnd so I think what you heard from Senator Rounds, for instance, is really interesting. A Republican senator basically saying, I’ll worry about that when the time comes. Let's see if that actually even comes to fruition rather than waste capital now.\nAnd the Senate's Advice and Consent role is interesting, also something that Senator Rounds said. The president really should be able to get his choices. He should have the people around him giving him the advice that he wants.\nWith the slight exception of that Advice and Consent role, Hamilton and Federalist numbers 68 said the president should get his picks unless it is someone with the necessary insignificance and pliancy to render them the obsequious instruments of the president's will.\nKARL: We don't get enough Federalist Papers here in the round table.\nISGUR: Number 76, my friends.\nVIVIAN SALAMA, NATIONAL POLITICS REPORTER, WALL STREET JOURNAL: Very impressive.\nKARL: So, Vivian, does he get confirmed?\nSALAMA: It remains to be seen the problem is that we've already had one nominee withdraw and there are others that have serious issues. The secretary of defense nominee Pete Hegseth has -- is now riddled with sexual misconduct allegations.\nYou have Tulsi Gabbard who's raised concerns about her intelligence contacts and perhaps, you know, meddling with the wrong side of --\nKARL: Bobby Kennedy, we can go down. We've got a long list.\nSALAMA: We can go down the list and so it really depends on whether senators are willing to risk their -- stick their necks out and take down another nominee.\nKash Patel happens to be one that's been highly controversial to the point that folks I talk to on the Hill and even within the Trump transition team did not think that that President-elect Trump would nominate him because of how controversial he is.\n(CROSSTALK)\nKARL: Well, to Rick's point Steve Bannon did call it. Steve Bannon had been talking about this for some time.\nBut there is a -- I’ve heard within the Trump team some debate here or people close to Trump.\nIs he -- does he really expect Patel to be confirmed as FBI director or is this a way to put out such a controversial pick that it takes the heat off somebody like Pete Hegseth or Bobby Kennedy or Tulsi Gabbard?\nSALAMA: Well, that was -- that was definitely the theory with Matt Gaetz for attorney general, and so, it is possible that that's the case. But the thing is, is that he can still serve --Kash Patel could still serve in an acting capacity if Trump comes into office, fires Christopher Wray and puts him there on a temporary basis. He can do a lot in that time that he holds that acting capacity. And so, that might be enough to satisfy Trump.\n(CROSSTALK)\nKARL: I think there's an extra step he has to take to do that. But Donna, first, what -- how hard are Democrats going to fight on this one? I don't imagine Patel is going to get many Democrats.\nBRAZILE: Look, look, I think the Democrats --\n(LAUGH)\nBRAZILE: -- the Democrats will have to sort through the debris and figure out which of the shiny objects they want to focus on. And with only a handful of Republicans possibly thinking about Clause 2, Section 2 of the U.S. Constitution, the Advice and Consent role, this is on Republicans. I mean, this is -- and Democrats will do what they have to do in terms of raising questions and so forth, but this is Donald Trump. He has told us who he is.\nI mean, we know that he wants to shake up the government. We didn't expect the earthquake to destroy the government with some of these picks. But look, Donald Trump is who he is, and he's choosing people that represents his own worst qualities. That's how I see it.\nKARL: Well, another way to look at it is that he was deeply disappointed by some of his own picks last time when he took --\nBRAZILE: Of course.\nKARL: -- the advice, when he put in somebody like Senator Sessions or Bill Barr to attorney general or Chris Wray at FBI?\nBRAZILE: Too close to the mainstream.\n(LAUGH)\nKARL: I mean, he has loyals, especially at DOJ.\nISGUR: The interesting thing is that he picked credentialed people who had --\nKARL: Yes.\nISGUR: -- the experience. I mean, that's why I quoted \"Federalist No. 76\", that insignificance, it matters because you haven't built up the muscles to know what to do in that job. So you'll be ineffective, first of all. But second of all, you also don't have the muscles to know when to say no, when to push back, when your job is to tell the president, no, sir, we're not doing that.\nAnd when you put in someone with the level of insignificance of a Kash Patel, that's the problem you run into and why it's so different than a Chris Wray or a Bill Barr, or a Jeff Sessions.\nKARL: And Rick, they have 53 Senators, so he can confirm anybody if Republicans stay together. But you have Mitch McConnell, who is no longer the leader, probably not running for re-election, has no loyalty, personal loyalty to Donald Trump. You have Susan Collins and Lisa Murkowski who have both shown a willingness to convict --\nKLEIN: Yeah.\nKARL: -- Trump in an impeachment trial. No loyalty at all. All it takes us one more to stop any given nominee.\nKLEIN: Yes.\nISGUR: Mike Browns didn't sound like he was on board.\nKLEIN: That's right. We get to find out now how much the Senate wants to continue to be the Senate. And Donna is right, it's on Republicans.\nBRAZILE: That's right.\nKLEIN: They're the ones that would have to provide the votes. You're not going to get other than Marco Rubio or Doug Burgum, they'll get plenty of Democratic votes. But the controversial nominees that we've been talking about, they're going to have to rely on Republicans. And yeah, this whole point of Advice and Consent, you heard from Senator the rounds (ph), the Republican Senators weren't asked for the advice. They didn't give it, and then they didn't give the consent, at least on Matt Gaetz.\nI think that did crack the door open to others potentially going down. And maybe Trump is OK with that. Maybe he's fine with setting this aside because to -- to Sarah's point, just because you could consider someone not to be consequential, doesn't mean they wouldn't have a very significant impact if they're on the job. They still have to stand up and take these votes at some point, and that is going to tell us a lot about what governing in the Trump era is going to be like, because Republicans have the numbers to get Trump's people in there if they choose. We just don't know if they're going to make that choice.\nBRAZILE: That is correct.\nKARL: Is Trump world -- I haven't heard much talk lately of the idea of the recess appointments, of forcing Congress to go into recess and then bypassing Senate confirmation at all. Does Trump still feel that's an option?\nSALAMA: Definitely toying with the idea, but everyone I talked to in Trump world says that it's a distant possibility, that they're not ne necessarily there yet. They believe that they can get -- they can get the votes that they need in session. And so, they're -- for now, they're not actually entertaining that realistically.\nBRAZILE: But January 3rd is right around the corner and there's a lot to do. I still find it fascinating that the Trump team, the transition team finally signed the MOU with the government so that they can start going into the agencies, but they did not follow through with the GSAs, setting up anything. They used private sectors --\n(CROSSTALK)\nKARL: So there's no FBI I background check (inaudible)?\nBRAZILE: That's my point.\nSALAMA: Yeah.\nBRAZILE: The point is, will the Senate --\n(CROSSTALK)\nKARL: I guess they want to wait until Kash Patel becomes FBI Director to do the background check.\nBRAZILE: Well, that's one theory of the case. But my sense is that the Senate Republicans, they're institutionalists, and I do believe the vast majority of them will think about the rule of law, think about the constitution as they begin to look into these now.\nKARL: Yes, it doesn't seem to me that we have a rubber stamp. We'll see. We'll see. We got to take a quick break. We're going to come back. Hold that thought.\nMuch more, still ahead. The Roundtable weighs in on the path forward for Democrats. We're back in just a minute.\n(COMMERCIAL BREAK)\nKARL: The round table is back.\nSarah, you were going to make a point about recess appointments.\nISGUR: Well, there's two ways around the advice and consent power of the Senate. The first is recess appointments, but the Supreme Court back during the Obama administration said no to Obama's recess appointments and four justices concurred with Scalia leading and he said the recess appointments is an anachronism. We don't have the Senate just gone forever.\nSo that's a nonstarter for them. Trump's three appointments certainly follow in Scalia's footsteps on that. Two would be the Vacancies Reform Act, which Vivian mentioned, but you have to be in place for 90 days within the agency that you're being appointed to or Senate confirmed elsewhere in the government.\nKARL: During the last year.\nISGUR: During the last year. Kash Patel, not GS-15. He'd have to sit there for 90 days somewhere in DOJ.\nKARL: So there's no easy way to bypass a Senate confirmation.\nISGUR: Not unless you're willing to wait for a while.\nKARL: OK. So, Donna, Democrats, what -- I've heard a lot -- there's been a lot this week about lessons learned from Kamala Harris' loss.\nBRAZILE: I've heard a lot. I've heard more finger-pointing and blaming than really looking at what truly happened on the ground in those final two weeks of the election.\nLook, I'm all about a forensic examination. That's healthy. That's important, but for now, I think the Democrats can walk and chew gum at the same time. Begin to set and place the reforms that are necessary for a stronger, healthier party a year from now, and of course, for the midterm, but also look deeper at some of the strategic mistakes that were made.\nThat being said, there's an announcement, February 1st, we're going to elect a new chair. Whoopee, I'm so excited.\nKARL: Is Donna Brazile going to be a candidate?\nBRAZILE: Hell no. I've done that twice in my life. And I always said put me down as interim. It's not on my bucket list, Jon. Maybe, you know, being like Rick Klein when I can do numbers on Sunday. That's on my bucket list.\nKARL: Vivian, I mean, what's the sense? I mean, we saw Josh Stein. He seems to be a potential new national figure for the Democrats.\nSALAMA: Of course. Josh Stein had a very unique situation.\nKARL: Yes.SALAMA: His opponent was riddled with controversy to say the least. There is a sense that there needs to be some sort of 'Come to Jesus' moment among Democrats, that they need to figure out, A, what went wrong, why they lost touch with the country, but B, also who is going to lead the country forward. There's a lot of debate even on the Hill to try to find new leadership perhaps on some of the committees because they feel like there needs to be young and fresh blood coming in and doing that.\nBut there's a lot of resistance as well. And that's going to be really the telling thing moving forward, is whether or not the old guard is willing to step back and say, it's time for new people to come in and shake things up.\nKLEIN: Yeah, Jon, I think despite the numbers in the House of Representatives, as we discussed, pretty good for Democrats overall, there's a sense in many Democrats I've talked to that the Democratic Party brand is a broken brand in huge swaths of the country, and they have to work to fix that.\nOne intriguing thought I've heard from a number of Democrats across the spectrum, they are sick of interest groups telling them, sign this questionnaire, tell us all these things that you stand for, check all these boxes. They feel like they need to define themselves more freely, much like Donald Trump did in his own way.\nAnd a lot of that definition is going to happen now in reaction to Trump. The action in the States is going to be fascinating. People like Governor Stein forming what amounts to an opposition and a rebuilding of the party.\nKARL: You were at the RNC, Sarah, when they did an autopsy after Romney's loss in 2012. They basically talked about the need to have a more open approach on things like immigration. So, I don't think the Republicans exactly went in the direction of that autopsy.SARAH ISGUR, THE DISPATCH SENIOR EDITOR& FORMER TRUMP JUSTICE DEPARTMENT SPOKESPERSON& ABC NEWS CONTRIBUTOR: No.\nKARL: But, Democrats need an autopsy?\nISGUR: This is an opportunity for Democrats to become the center-left party for the United States, whether they will take it or not, whether they're able to tell those groups, I think will be up to the next presidential nominee. As we saw, Donald Trump defeated the Republican Party before he defeated the Democratic Party in 2016. Democrats need a leader like that to transform their party, if they want to.\nBut I also think Republicans can over-read their mandate. Donald Trump's campaign strategy wasn't what pushed him over the edge, or else, we would've seen him winning in his targeted demographics. He didn't. He won with every demographic. He improved in every state, except what, one or two in every demographic.\nThat is the fundamentals. That's the 40-pound curling stone going down the ice. The little sweepers in the campaign weren't the difference maker here.\nBRAZILE: Well, let me just say one last thing. Howard Dean gave us a prescription, a 50-state strategy. We have to become a party that knows how to elect people in all 50 states. Of course, D.C. and more, but that's our job this time.\nKARL: All right, final word, Donna Brazile. We'll be right back.\n(COMMERCIAL BREAK)\nKARL: That's all for us today. Thank you for sharing part of your Sunday with us. Check out \"World News Tonight\" and have a great day.\n(COMMERCIAL BREAK)\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Biden’s Angola visit to focus on US investments, partnerships in Africa", "link": "https://abcnews.go.com/Politics/bidens-angola-visit-focus-us-investments-regional-partnerships/story?id=116325701", "content": "Biden will become the first sitting president to visit Angola.\nPresident Joe Biden will become the first sitting president to visit Angola this week as he aims to deepen the relationship between the two countries and highlight recent investments as an alternative to the growing support fromChina.\nBiden's visit also marks the first visit to Africa of a U.S. president since then-President Barack Obama went to Kenya and Ethiopia in July 2015.\nHis trip, scheduled for Dec. 2 through Dec. 4, will begin with a bilateral meeting with Angolan President João Lourenço in the capital of Luanda, according to a senior administration official previewing the trip. They last met in December 2023 in the Oval Office.\nBiden will deliver remarks in Luanda laying out \"both our shared history and highlight the growth and enduring strength of our relationships in Angola and across the continent,\" according to the official.\nHe will also announce new deliverables related to global health security, agribusiness, security cooperation and preserving Angola's cultural heritage.\nIn 2022, the United States pledged to invest $55 billion in Africa over three years, and a senior administration official said 80% of that commitment has already been met.\n\"Over the last couple of years, in Angola, through U.S. government investment, there has been an added more telecommunications, more people are getting connected to 3G and now building out 5G networks, as well as building out renewable energy,\" the official said. \"In fact, the U.S. has approved financing through [the Export-Import Bank] of nearly $2.5 billion of renewable energy projects that will be able to take countries from energy deficit to energy exporters to their neighbors.\"\nThe Biden administration has been trying to counter China's growing influence in Africa and sizable commitments of their own, including $50 billion in support announced in September that would go toward infrastructure and at least 1 million jobs.\nThe official added that \"we don't think it's a bad thing\" for China to invest in Africa but warned about what could happen in the long run with that support, opposed to \"meaningful\" investments offered by the U.S.\n\"If it means that at the end of a few years of investment, the communities that live in the area of the investment have not seen any increase in GDP, that they've not seen benefits of their lives in it, that it has not lifted the lives of the communities, if it means that the government is going to be living under crushing debt for generations to come … then the government's going to have to make the decision whether that's the alternative they want,\" the official said.\n\"What we have heard repeatedly over years is that people want to have more -- people in Africa want to have more alternatives for investment, not less. But if they don't have the alternative, they are forced to go with the with the one investment they have.\"\nBiden is squeezing in this trip with less than two months to go before leaving office after promising to visit back in 2022. Senior administration officials said he has wanted to make this trip for a long time. While that was being worked on, over 20 Cabinet-level and senior officials traveled to the continent in the past two years, including Vice President Kamala Harris in March of 2023.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Trump names longtime ally Kash Patel to lead FBI", "link": "https://abcnews.go.com/Politics/trump-hell-fire-fbi-director-christopher-wray-replace/story?id=116342099", "content": "The appointment must be approved by the Senate.\nPresident-elect Donald Trump announced Saturday that he plans on firing FBI director Christopher Wray and replacing him with longtime ally Kash Patel.\nThe appointment must be approved by the Senate.\nPatel has been a staunch supporter of Trump for years and served in his first administration under a number of roles. He has vocally defended many Jan. 6 rioters who were charged for their actions that day.\nPatel has said he would target journalists, former senior FBI and Department of Justice officials and turn the FBI into a museum for the \"deep state\" on Day 1.\n\"This FBI will end the growing crime epidemic in America, dismantle the migrant criminal gangs, and stop the evil scourge of human and drug trafficking across the Border,\" Trump said in a Truth Social post, announcing his pick.\nPatel did not immediately comment about Trump's announcement. Trump can not make personnel changes to the FBI until he is sworn in.\nWray, the current agency director, was appointed in 2017 after Trump fired Director James Comey, less than four years into his 10-year term. Trump claimed Comey \"wasn't doing a good job.\"\nIn a statement to ABC News, the FBI said \"Every day, the men and women of the FBI continue to work to protect Americans from a growing array of threats. Director Wray's focus remains on the men and women of the FBI, the people we do the work with, and the people we do the work for.\"\nPatel, 44, grew up in Long Island and earned a law degree from Pace University Law School. He first served as a public defender in Miami for nine years before moving to Washington, D.C., in 2013 to work at the Justice Department’s National Security Division.\nPatel left the Justice Department in 2017 claiming frustration with the agency, especially with the handling of the 2012 terrorist attacks in Benghazi, Libya, that killed U.S. Ambassador Chris Stevens and three other Americans.\nHe went on to lead the “Russia Gate” investigation for House Intelligence Committee Chairman Devin Nunes, with a promise from Nunes that after the investigation he would help Patel get a job at the National Security Council in the White House.\nAs the self-described “lead investigator of the Russia Gate hoax,” Patel authored the so-called “Nunes memo” alleging that the FBI improperly eavesdropped on former Trump adviser Carter Page.\nA major report by the Justice Department's inspector general released in late 2019 found that the FBI wasnot impacted by political biaswhen it opened the investigation -- though it outlined what it called \"serious performance failures\" on the part of agents as they vetted information from sources and sought surveillance warrants against Page.\nIn February 2019, Patel became deputy assistant to the president and senior director for counterterrorism on the White House’s National Security Council.\nIn February 2020, Patel took on a “temporary duty assignment” as deputy to the newly installed acting director of national intelligence. That November, after Trump lost the election, Patel was named chief of staff for the Defense Department, despite some critics saying he was unqualified for the role.\nAfter Trump left the White House, Patel held a number of jobs including hosting shows on far-right media outlets.\nIn Patel's book, \"Government Gangsters,\" which Trump said would serve as a \"blueprint\" for his next administration, Patel called for a \"comprehensive housecleaning\" of the Justice Department. He also promoted an eradication of \"government tyranny\" within the FBI by firing \"the top ranks\" and prosecuting \"to the fullest extent of the law\" anyone who \"in any way abused their authority for political ends.\"\n\"[T]he FBI has become so thoroughly compromised that it will remain a threat to the people unless drastic measures are taken,\" Patel claimed in his book. Democrats \"should be very afraid,\" Patel wrote.\nHe alleged that there were \"abuses of prosecutorial discretion\" by the Justice Department in declining to charge Hillary Clinton for allegedly compromising classified information through her use of a private email server, and in declining to charge President Joe Biden's son, Hunter Biden, for what Patel describes as influence-peddling. At the same time, he argued the department indicted Trump ally Steve Bannon over his refusal to comply with a subpoena from the House panel investigating the Jan. 6, 2021, attack on the U.S. Capitol and also charging so many of the Trump supporters who were at the Capitol that day.\nOn a podcast two months ago, Patel said anyone involved in \"Russiagate\" should be stripped of their security clearances.\nAccording to Patel, there is a \"massive\" list of such government officials, from the FBI and Justice Department to the CIA and U.S. military.\n\"They all still have clearances,\" including those who left government for private sector jobs, so \"everybody\" should lose their clearances, Patel said.\nPatel said he has personally \"recommended\" to Trump that the new administration also strip any security clearances still held by the 51 then-former intelligence officials. This includes former Director of National Intelligence James Clapper and former CIA director John Brennan, who in October 2020, just weeks before the 2020 presidential election, signed onto a letter dismissing the public release of emails from Hunter Biden's laptop as part of a \"Russian information operation.\"\nPatel has also come to the defense of Jan. 6 rioters who were charged for their actions.\nHe’s raised money for Jan. 6 defendants and their families, including by promoting the “J6 Prison Choir,” featuring Jan. 6 defendants still in jail, and co-producing their fundraising song “Justice for All,” which Trump played at some of his campaign rallies. And Patel once suggested Jan. 6 was “a free speech movement.”\nPatel also became a part of the investigation into Trump’s handling of classified documents at his Mar-a-Lago estate.\nAfter news surfaced that the National Archives found some classified documents in boxes previously stored at Mar-a-Lago, Patel called the news “disinformation” and insisted he was there when Trump “declassified whole sets of materials in anticipation of leaving government that he thought the American public should have the right to read themselves.”\nFour weeks later, Trump named Patel as one of his official representatives to the National Archives, and Patel promised to “march down there\" and “identify every single document that they blocked being declassified at the National Archives, and we are going to start putting that information out.”\nTwo months later, Patel’s claimed Trump declassifying documents were included in the FBI’s affidavit laying out why the FBI believed a broad search of Trump’s Mar-a-Lago estate was warranted. And Patel was subpoenaed to testify to the grand jury investigating the matter, but at first he refused to answer key questions.\nHe later returned to the grand jury and answered those questions only after being granted limited-use immunity. He has blasted the entire probe as unlawful overreach by a politically corrupted Justice Department.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Trump, Trudeau meet at Mar-a-Lago amid tariff threats", "link": "https://abcnews.go.com/Politics/trump-trudeau-meet-mar-lago-amid-tariff-threats/story?id=116329095", "content": "Trump has threatened 25% tariffs on goods from Mexico and Canada.\nCanadian Prime Minister Justin Trudeau met with Donald Trump Friday night at the president-elect's Mar-a-Lago resort.\nSpeaking to reporters outside his hotel in West Palm Beach, Florida, on Saturday morning, Trudeau said his conversation with Trump was \"excellent\" but did not respond to any additional questions.\nTrudeau also took toXon Saturday to thank Trump for dinner at Mar-a-Lago and added, \"I look forward to the work we can do together, again.\"\nPennsylvania Sen.-elect Dave McCormickposted a photoon X Friday night that showed Trump and Trudeau sitting together at a table in the club at Mar-a-Lago. Also included in the photo are Trump's interior secretary pick, Doug Burgum; his secretary of commerce pick, Howard Lutnick; and Trump's pick for national security adviser, Mike Waltz.\n\"We discussed many important topics that will require both Countries to work together to address, like the Fentanyl and Drug Crisis that has decimated so many lives as a result of Illegal Immigration, Fair Trade Deals that do not jeopardize American Workers, and the massive Trade Deficit the U.S. has with Canada,\" Trumpposted Saturday afternoonon his social media platform Truth Social. \"Prime Minister Trudeau has made a commitment to work with us to end this terrible devastation of U.S. Families. We also spoke about many other important topics like Energy, Trade, and the Arctic.\"\nThe meeting came after Trump threatened sweeping 25% tariffs on goods from Mexico and Canada until both countries stop what he claims is a flow of drugs and illegal immigrants into the United States.\nTrudeau told reporters earlier this week after he and Trump spoke on the phone following the tariff threat that they had a \"good call.\" He added that he looks forward to \"lots of great conversations\" with Trump.\nThe prime minister has cited the United States-Mexico-Canada Agreement, or UMSCA, negotiations as a sign he believes he can work with Trump on trade and avoid a trade war.\nUSMCA went into effect in 2020 after it was signed by Trump and was designed to provide mostly duty-free trade among the U.S., Canada and Mexico. Trump's tariff threats could put that deal in jeopardy.\nThe terms of USMCA allow it to be renegotiated after six years, in 2026, butexperts have told ABC Newsthat the tariff threat may be an effort to move up that negotiation window.\nHowever,some experts toldABC News' Selina Wang and Karen Travers that the threat is not likely to work in a second Trump term because it is \"the same playbook done the second time around. If you're on the football field and you call the same play twice, it's not going to be as effective the second time.\"\nThe tariffs also could significantly raise prices for goods after Trumpran his campaignon lowering too-high inflation.\nTrudeau spoke with Trump on Monday, Nov. 25, after Trump had announced the day-one tariffs on Canada and Mexico, as well as on China, the U.S.'s top three trading partners.\n\"We talked about some of the challenges that we can work on together,\" he told reporters of the call. \"This is a relationship that we know takes a certain amount of working on, and that's what we'll do.\"\nTrudeau's plane landed at Palm Beach International Airport on Friday ahead of an expected dinner at Mar-a-Lago with the president-elect,according to reports.\n-ABC News' Hannah Demissie contributed to this report.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Trump picks Florida sheriff Chad Chronister for DEA administrator", "link": "https://abcnews.go.com/Politics/trump-nominates-hillsborough-county-sheriff-chad-chronister-dea/story?id=116342276", "content": "Chad Chronister has served the Tampa, Florida, area for over 30 years.\nPresident-electDonald Trumpannounced he will nominate Hillsborough County Sheriff Chad Chronister to lead the Drug Enforcement Administration.\nIn a post on Truth Social on Saturday, Trump said that Chronister -- who has served the Tampa, Florida, area for over 32 years -- will work with his attorney general selection,Pam Bondi, to help secure the U.S.-Mexico Border.\nThe DEA administrator is a Senate-confirmed position.\n\"As DEA Administrator, Chad will work with our great Attorney General, Pam Bondi, to secure the Border, stop the flow of Fentanyl, and other Illegal Drugs, across the Southern Border, and SAVE LIVES,\" Trump wrote.\nChronister was appointed to lead the Hillsborough County Sheriff's Office by then-Florida Gov. Rick Scott in 2017 and has been twice reelected by voters.\nHe holds a bachelor's and master's degree in science in criminal justice from St. Leo University and is a graduate of the FBI National Academy's 260th session.\nChronister is married to Nikki DeBartolo and has two sons.\nFlorida Attorney General Ashley Moody took toXon Saturday to congratulate Chronister on the nomination and praise his experience in fighting on the \"frontlines\" of the opioid crisis.\n\"Chad has fought on the frontlines of the opioid crisis, and I know his leadership and decades of experience will be invaluable as we work to combat the flow of Mexican fentanyl into our county,\" Moody wrote.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Third candidate enters DNC chair race, setting up tight contest", "link": "https://abcnews.go.com/Politics/james-skoufis-announces-bid-lead-dnc-vie-chairmanship/story?id=116337908", "content": "“I may be an outsider, but I know how to win,” the New York state senator said.\nNew Yorkstate Sen. James Skoufis announced his long-shot bid for chairman of the Democratic National Committee on X on Saturday.\nSkoufis, who paints himself as an outsider, underdog and part of a new generation, said he intends to point to his successful record in his district that favors President-elect Donald Trump.\nArguing for a new script,Skoufis said, \"Voters have spoken, and we need to listen, not lecture. We need to be strong fighters again.\"\n\"I may be an outsider, but I know how to win,\" he continued. \"I will throw out the DNC's stale, Beltway-centered playbook so that we rebuild, stop ceding ground to Republicans and start winning again -- everywhere. Not just the party, but the country depends on it. We can win this fight together.\"\nSkoufis, who has served in the New York legislature since 2013, joins the field with Martin O'Malley, the formerMarylandgovernor who has served as commissioner of the Social Security Administration since December 2023, and Ken Martin, a vice chairman of the DNC who also leads the Minnesota Democratic-Farmer-Labor Party. Jaime Harrison, the current chairman, is not seeking a second term.\nThe election of a new DNC chairwill take placeat the party's winter meeting in National Harbor, Maryland, on Feb. 1, 2025. Harrison announced earlier this week that there will be four forums for candidates to make their cases to DNC members, who will also select a vice chair, treasurer, secretary and national finance chair, after the party lost the presidency and couldn't obtain a majority in either the Senate or the House in the 2024 elections.\n\"As my time as Chair comes to a close and we prepare to undertake the critical work of holding the Trump Administration and Republican Party accountable for their extremism and false promises, we are beginning to lay out the process for upcoming DNC officer elections in the New Year,\" Harrison saidin a statement. \"The DNC is committed to running a transparent, equitable, and impartial election for the next generation of leadership to guide the party forward.\"\nThe DNC's Rules and Bylaws Committee will meet on Dec. 12 to determine the Rules of Procedure for the contest, including what will be necessary to gain access to the ballot. In 2021, candidates needed the signatures of 40 DNC members, which is expected to hold for the 2025 race.\nThe 448 DNC members voting at the winter meeting includes 200 state-elected members from 57 states, territories and Democrats Abroad; members representing 16 affiliate groups; and 73 at-large members elected by the DNC, ABC Newspreviously reported.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Democratic members of Congress get bomb threats on Thanksgiving", "link": "https://abcnews.go.com/Politics/democratic-members-congress-bomb-threats-thanksgiving/story?id=116309053", "content": "The threats follow some to Trump's Cabinet selections earlier in the week.\nPresident Joe Biden, asked on Friday about recent bomb threats and swatting aimed at Democratic lawmakers and Trump Cabinet picks, said, \"we're working that hard with the FBI.\"\nBiden spoke to reporters while shopping in downtown Nantucket where he and his family are spending the holiday weekend.\nThe homes of multiple Democratic members of Congress in Connecticut were targeted by bomb threats on Thanksgiving Day.\nReps. Joe Courtney, Jahana Hayes, Jim Himes and John Larson all said their homes were targeted on Thursday.\n\"This morning, I was notified of a bomb threat targeting my home where I was celebrating Thanksgiving with my family,\" Himes said in a statement. \"Thankfully, after a swift and thorough response from the United States Capitol Police, the Greenwich Police Department and the Stamford Police Department, no evidence of a bomb was found.\"\nHayes said in a statement she was notified by local police that it received a threatening email stating a pipe bomb had been placed in her mailbox at home. Police did not find any evidence of a pipe bomb in his mailbox and said there's no place for political violence in the country.\n\"State police, U.S. Capitol Police, and the Sergeant at Arms were immediately notified. The Wolcott Police Department and State Police responded and no bomb or explosive materials were discovered and the scene was cleared. At this time the investigation is ongoing. I thank law enforcement for their swift attention to this matter, their actions demonstrate there is no place in our country for political violence.\"\nLocal outlets in Connecticut reported that Larson and Courtney have received similar threats. ABC News has reached out for comment. A spokesperson for Connecticut Democrat Sen. Chris Murphy said his office also was targeted by a bomb threat.\nRhode Island Rep. Seth Magaziner released a statement on X on Friday that he was also a target of a bomb threat at his home in Rhode Island. Police found there was no evidence of a bomb.\n\"I was recently notified of a bomb threat targeting me and my family at our home. We are safe and there was no evidence of a bomb on the property. We would like to extend our deepest gratitude to the Providence Police Department for their effective response.\"\nHouse Minority Leader Hakeem Jeffries, D-N.Y., said in a statement on Friday any threats of violence were \"unacceptable.\"\n\"Yesterday, during Thanksgiving celebrations, several Democratic Members of Congress, their families and law enforcement officials were targeted with violent threats,\" Jeffries said. \"These incidents ranged from detailed threats of a pipe bomb placed in mailboxes to swatting, all signed with 'MAGA' at the conclusion of the message. Thanks to the swift reaction from law enforcement, no devices were found and Members of Congress and their families were kept safe on the holiday.\"\n\"House Democrats will not be deterred or intimidated from serving the people by violent threats. We have been in close communication with the Sergeant at Arms office and it is imperative that Congress provide maximum protection for all Members and their families moving forward,\" Jeffries added.\nRhode Island Sen. Sheldon Whitehouse was also the target of a bomb threat, according to a spokesperson.\n“Senator Whitehouse received a similar bomb threat to the ones made against other Democrats on Thanksgiving, and he is grateful for the quick all-clear response by the Newport Police,” the spokesperson said.\nThreats against multiple members of Connecticut congressional delegations come following several of Trump's Cabinet picksreceiving threats, including Rep. Elise Stefanik, former Rep. Lee Zeldin, and Pete Hegseth.\nIt's unclear, though, if the threats against some of Trump's Cabinet picks are connected to the threats against many of Connecticut's congressional delegation.\nABC News' Justin Ryan Gomez and Caleigh Bartash contributed to this report.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "W.H. NSA Sullivan, Sen. Rounds, & Gov.-elect Stein Sunday on ‘This Week’", "link": "https://abcnews.go.com/Politics/white-house-national-security-adviser-jake-sullivan-sen/story?id=116324208", "content": "This is a listing for 'This Week' airing Sunday, December 1, 2024.\n\nWHITE HOUSE NATIONAL SECURITY ADVISER JAKE SULLIVAN, SEN. MIKE ROUNDS AND GOV.-ELECT JOSH STEIN SUNDAY ON “THIS WEEK” WITH CO-ANCHOR JONATHAN KARL\nJake Sullivan\nWhite House National Security Adviser\nSen. Mike Rounds\n(R) South Dakota\nExclusive\nGov.-elect Josh Stein\n(D) North Carolina\nExclusive\nPOWERHOUSE ROUNDTABLE\nRick Klein\nABC News Washington Bureau Chief\nABC News Political Director\nDonna Brazile\nFormer DNC Chair\nABC News Contributor\nSarah Isgur\nThe Dispatch Senior Editor\nFormer Trump Justice Department Spokesperson\nABC News Contributor\nVivian Salama\nWall Street Journal National Politics Reporter\n. . . . . . . . . . . . . . . . .\nLike “This Week” on Facebookhere. You can also follow the show on Twitterhere.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Elon Musk and Vivek Ramaswamy to meet with House Republicans on DOGE plans", "link": "https://abcnews.go.com/Politics/elon-musk-vivek-ramaswamy-meet-house-republicans-doge/story?id=116323773", "content": "Musk recently proposed deleting the Consumer Financial Protection Bureau.\nElon Musk and Vivek Ramaswamy will head to Capitol Hill next week to meet with House Republicans on their plan to slash regulations and other parts of the federal government.\nSpeaker Mike Johnson announced he will host them on Thursday, Dec. 5 to discuss \"major reform ideas\" to \"revive the principle of limited government.\"\nMusk and Ramaswamy have been tapped by President-elect Donald Trump to lead the so-called \"Department of Government Efficiency.\" Their roles have been described as \"outside of government\" advisers on how to make drastic cuts to various federal agencies and their workforces.\nMusk, in particular, has become a member of Trump's inner circle as the president-elect prepares for a second term. The Tesla billionaire spent Thanksgiving with Trump at Mar-a-Lago in Florida.\nEarlier this week, Musk proposed abolishing the Consumer Financial Protection Bureau.\n“Delete CFPB. There are too many duplicative regulatory agencies,” he wrote on his social media platform, X.\nTrump on the campaign trail vowed to dismantle federal bureaucracy but did not specifically call for the CFPB to be eliminated. To gut an entire agency would be a difficult task, andwould require legislationfrom Congress.\nCFPB, which was formed in the wake of the 2008 financial crisis to protect consumers and review practices of the nation’s banks, lenders and other institutions, has long been a target of conservative attacks over its cost and its regulations.\nEarlier this year, the CFPBsurvived a legal challengeled by former Trump administration Solicitor General Noel Francisco on behalf of a group of payday lenders alleging the agency's structure was illegal. The U.S. Supreme Court, in a 7-2 decision, upheld the agency’s funding mechanism as constitutional.\nMusk also recently reposted on social media the names of specific people and jobs that he suggested be cut. They include employees at the Department of Energy and the U.S. International Development Finance Corporation. \"So many fake jobs,\" Musk wrote in one post.\nMusk and Ramaswamy outlined more of their plans for DOGE in aWall Street Journal op-edpublished last week.\nThey said they were helping Trump’s transition team bring on board a “lean team of small-government crusaders” that would be aimed at three core actions: repealing regulations, reducing the administrative workforce and saving costs.\n“We are prepared for the onslaught from entrenched interests in Washington. We expect to prevail,” they wrote. “Now is the moment for decisive action. Our top goal for DOGE is to eliminate the need for its existence by July 4, 2026 -- the expiration date we have set for our project.”\nLegal and logistical hurdlesremain for Musk and Ramaswamy's goal to slash the government. But they will get some help on Capitol Hill by a new congressional subcommittee aimed at eliminating government waste in conjunction with DOGE. Republican Rep. Marjorie Taylor Greene, a conservative firebrand and staunch supporter of Trump, has beenchosen to chairthe panel.\nRamaswamy, in response to Johnson's announcement of next week's meeting, said he's had \"great discussions so far\" with House and Senate GOP leaders about DOGE.\n\"Congress appears serious about delivering structural reform. We look forward to productive meetings in D.C. next week,\" Ramaswamy wrote on X.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Biden to display AIDS Memorial Quilt on White House South Lawn for 1st time", "link": "https://abcnews.go.com/Politics/president-biden-lady-debut-aids-memorial-quilt-white/story?id=116312801", "content": "The Bidens will commemorate World AIDS Day on Sunday with survivors, families.\nPresident Joe Biden and first lady Jill Biden will mark World AIDS Day on Sunday by debuting the AIDS Memorial Quilt at the White House.\nIt will be displayed on the South Lawn as the Bidens commemorate the day with survivors, their families and advocates.\nA red ribbon will also be displayed on the South Portico of the White House to recognize those who have died due to AIDS-related illnesses, as well as the more than 40 million individuals living with HIV around the world.\nThe red ribbon -- now an annual tradition -- made its first appearance in 2007, under the Bush administration.\nThe White House said in statement that the Biden administration has made ending the HIV epidemic a key priority.\nThe statement touted the administration'sNational HIV/AIDS Strategy, which is focused on reducing new HIV infections, improving outcomes for people with HIV and breaking down societal barriers. It was established in 2021.\nThe White House Office of National AIDS Policy is set to release a progress report on the Biden administration's strategy next week.\nThe AIDS Memorial Quilt, a powerful symbol of the human toll of the virus, wasoriginally displayed on the National Mallduring the October 1987 National March on Washington for Lesbian and Gay Rights, at a time when many felt the federal government had been too slow to respond to the crisis.\nThe quilt, which is regularly displayed across the U.S. as an education tool, now contains nearly 50,000 panels, honoring more than 105,000 lives lost.\nHIV infection in the U.S. declined by about 12% overall between 2018 and 2022, but remains a persistent problem, according to the Centers for Disease Control and Prevention.\nIn 2019, the Department of Health and Human Services announced an effort to end the HIV epidemic in the U.S. It aimed to reduce new infections to 9,300 by 2025 and 3,000 by 2030. However, in 2022, there were more 31,800 estimated new HIV infections,according to the CDC.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Biden says he hopes Trump rethinks tariffs, is thankful for 'peaceful transition'", "link": "https://abcnews.go.com/Politics/biden-hopes-trump-rethinks-tariffs-thankful-peaceful-transition-thanksgiving/story?id=116307793", "content": "\"The last thing we need to do is screw up those relationships,\" Biden said.\nPresident Joe Biden spent Thanksgiving morning giving back to first responders on Nantucket, while also taking time to give his thoughts on his successor's threats toissue tariffson Mexico, Canada and China.\nBiden told reporters he hopes President-elect Donald Trump \"rethinks\" hisDay 1 proposal, calling it a \"counterproductive thing to do.\"\n\"We have an unusual situation in America. We're surrounded by the Pacific Ocean, the Atlantic Ocean, and the two allies: Mexico and Canada. And the last thing we need to do is screw up those relationships. I think we've got them in a good place,\" Biden said Thursday.\nTrump said this week that he plans to sign an executive order when he takes office on Jan. 20, 2025, that would charge Mexico and Canada with a 25% tariff on all products those nations send to the United States, in an effort to stop the flow of drugs entering the country and illegal border crossings.\nHe also vowed to charge China with an additional 10% tariff on top of any additional tariffs on products coming into the U.S., arguing the country wasn't doing enough to stop the flow of illicit drugs.\nEconomists widely forecast that tariffs of this magnitude would increase prices paid by American shoppers, since importers typically pass along a share of the cost of those higher taxes to consumers.\nTrump's tariffs would cost the average U.S. household about $2,600 per year, according to an estimate from the Peterson Institute for International Economics.\nWith migrants being the central issue for Trump in threatening tariffs, Biden noted that illegal crossings are down considerably from what they were back when Trump was in office.\n\"There's a lot more to do, but, I hope they reconsider,\" he said on Thursday.\nThe president noted that with a thin GOP majority in Congress, there may have to be some \"real compromise\" in Trump's agenda.\n\"I want to make sure this transition goes smoothly and all the talk of what he's going to do and not do, I think there may be a little bit of internal reckoning on his part,\" Biden said.\nDespite the disagreements with Trump, Biden said he was thankful for his family and \"for a peaceful transition,\" adding that he's \"really thankful\" to havesecured a ceasefire dealbetween Israel and Hezbollah.\nThe president also said he spoke to all three Americans who werereleasedfrom Chinese custody Wednesday.\n\"I'm happy they're home,\" he said.\nBiden, who was joined by the first lady and his grandson Beau at a Nantucket firehouse, was asked what his message is to Americans worried about the future of the U.S. He told them to \"remember who we are.\"\nThe White House said the Bidens also called units from each branch of the military \"to thank them and their families for their service to the country.\"\nMeanwhile, Vice President Kamala Harris spent Thanksgiving morning with her family at DC Central Kitchen as part of a community service project.\nHarris said she will be making a turkey, her \"famous corn meal stuffing,\" sweet potatoes, cranberry sauce, scalloped potatoes, string beans, Brussels sprouts, salad and rolls for dinner.\n\"Lots of carbs,\" she said.\nWhen asked by a reporter, \"What's next for you?\" Harris joked, \"Thanksgiving dinner,\" and continued preparing collard greens.\nABC News' Max Zahn contributed to this report.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Mexico's president says its 'position is not to close borders' after Trump's claim", "link": "https://abcnews.go.com/Politics/mexicos-president-position-close-borders-response-trumps-claim/story?id=116295724", "content": "Trump claimed Mexico would stop border crossings, \"effective immediately.\"\nPresident-electDonald Trumpspoke with Mexico's President Claudia Sheinbaum on Wednesday. The call took placetwo days after he announcedthat he planned to impose a 25% tariff on all imports from Mexico on his first day in the White House.\nTrump called the conversation \"wonderful\" and \"very productive\" in apost on Truth Social, saying the two leaders talked about the border control and how to combat the flow of illegal drugs -- but these topical conversation points may be the only things on which the two could entirely agree.\nEarlier in the day, Sheinbaum confirmed that she had spoken with Trump, and that they did discuss the shared border,writing on X: \"I had an excellent conversation with President Donald Trump. We discussed Mexico's strategy on the migration phenomenon and I shared that caravans are not arriving at the northern border because they are being taken care of in Mexico.\"\nBut Trump went further, proclaiming that the Mexican president \"agreed to stop Migration through Mexico, and into theUnited States, effectively closing our Southern Border.\"\nIn a follow-up post, he added, \"Mexico will stop people from going to our Southern Border, effective immediately. THIS WILL GO A LONG WAY TOWARD STOPPING THE ILLEGAL INVASION OF THE USA.\"\nSheinbaum then appeared to directly contradict the president-elect's account of the conversation,posting on X: \"In our conversation with President Trump, I explained to him the comprehensive strategy that Mexico has followed to address the migration phenomenon, respecting human rights. Thanks to this, migrants and caravans are assisted before they reach the border. We reiterate that Mexico's position is not to close borders but to build bridges between governments and between peoples.\"\nTrump and Sheinbaum both also concur that they spoke about stemming the flow of illegal drugs, including fentanyl, into the U.S.\nSheinbaum wrote on X that they \"discussed strengthening collaboration on security issues within the framework of our sovereignty and the campaign we are carrying out in the country to prevent the consumption of fentanyl.\"\nAnd following their call, Trump announced on Truth Social that part of his plan to address the fentanyl epidemic in the U.S. will be a large advertising campaign.\n\"I will be working on a large scale United States Advertising Campaign, explaining how bad Fentanyl is for people to use - Millions of lives being so needlessly destroyed,\" Trump wrote. \"By the time the Campaign is over, everyone will know how really bad the horror of this Drug is.\"\nThe call was arranged after Trump this week announced plans toslap tariffson Mexico, as well as Canada and China, in an effort to stem illegal border crossings and stop the flow of drugs entering the U.S.\nOn Tuesday, Sheinbaum fired back, warning him not to start a trade war that she said would hurt the U.S.\n\"President Trump, it is not with threats nor with tariffs that migration and drug consumption in the U.S. will be dealt with,\" Sheinbaum said at a press conference, reading from a letter she'd written to Trump. \"These great challenges require cooperation and mutual understanding.\"\nShe also disputed Trump's claims about migration and drugs, and she blamed the U.S. for Mexico's drug war — pointing to U.S. consumption and American guns.\n\"We don't make guns, we don't consume synthetic drugs. Those killed by crime to meet the demand for drugs in your country are unfortunately our responsibility,\" she said.\nThe swift rebuke was a departure from Sheinbaum's mentor, former President Andrés Manuel López Obrador, who had a chummy relationship with Trump during his first term.\nWhen Trump similarly threatened tariffs on Mexico and to shut the border in 2018, the two men negotiated a deal to beef up Mexican immigration enforcement with U.S. support, reducing the numbers at the border — and Trump dropped his threats.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Trump Cabinet picks targets of bomb threats and swatting, spokesperson says", "link": "https://abcnews.go.com/Politics/trump-cabinet-picks-appointees-targets-bomb-threats-swatting/story?id=116277824", "content": "Trump's team said law enforcement \"acted quickly\" to ensure their safety.\nSeveral of President-elect Donald Trump's Cabinet picks and administration appointees were the targets of \"violent\" threats Tuesday night and Wednesday morning, Trump spokesperson Karoline Leavitt said in a statement Wednesday.\n\"These attacks ranged from bomb threats to 'swatting,'\" Leavitt said. \"In response, law enforcement and other authorities acted quickly to ensure the safety of those who were targeted. President Trump and the entire Transition team are grateful for their swift action.\"\nThe office of Trump's pick for U.S. ambassador to the U.N.,New YorkGOP Rep. Elise Stefanik, said in a post on X that she was one of those targeted.\n\"This morning, Congresswoman Elise Stefanik, her husband, and their three year old son were driving home to Saratoga County from Washington for Thanksgiving when they were informed of a bomb threat to their residence. New York State, County law enforcement, and U.S. Capitol Police responded immediately with the highest levels of professionalism,\" the statement said, before going on to thank action from law enforcement officers.\nThe FBI said it was taking the threats \"seriously.\"\n\"The FBI is aware of numerous bomb threats and swatting incidents targeting incoming administration nominees and appointees, and we are working with our law enforcement partners. We take all potential threats seriously, and as always, encourage members of the public to immediately report anything they consider suspicious to law enforcement,\" the agency said in a statement.\nBrooke Rollins, Trump’s pick for agriculture secretary, said she was the target of a threat Wednesday morning.\n\"This morning, we learned that a threat was issued against our home and family. Thanks to the swift efforts by the @fortworthpd, we were unharmed and quickly returned home. I want to express my deep gratitude to the law-enforcement professionals who did their utmost, in both speed and expertise, to protect us — as they protect our community every single day,\" she said in a statement.\nLee Zeldin, the former congressman Trump has tapped to lead the EPA, said he also was targeted Wednesday.\n“A pipe bomb threat targeting me and my family at our home today was sent in with a pro-Palestinian themed message,' he said in a statement. \"My family and I were not home at the time and are safe. We are working with law enforcement to learn more as this situation develops. We are thankful for the swift actions taken by local officers to keep our family, neighbors, and local community secure.”\nPete Hegseth, Trump's pick for defense secretary, said he was also the target of a bomb threat.\nThis morning, a police officer arrived at our home—where our seven children were still sleeping,\"Hegseth said on X. \"The officer notified my wife and I that they had received a credible pipe bomb threat targeting me and my family. We are all safe and the threat has been cleared. We want to thank law enforcement for their professionalism and bravery.\"\nABC News' Jack Date contributed to this report.\n24/7 coverage of breaking news and live events"}]