[{"source": "cnn", "title": "President", "link": "https://www.cnn.com/election/2024/results/president", "content": ""}, {"source": "cnn", "title": "Senate", "link": "https://www.cnn.com/election/2024/results/senate", "content": ""}, {"source": "cnn", "title": "House", "link": "https://www.cnn.com/election/2024/results/house", "content": ""}, {"source": "cnn", "title": "Governor", "link": "https://www.cnn.com/election/2024/results/governor", "content": ""}, {"source": "cnn", "title": "Ballot measures", "link": "https://www.cnn.com/election/2024/results/ballot-measures", "content": ""}, {"source": "cnn", "title": "Exit polls", "link": "https://www.cnn.com/election/2024/exit-polls/", "content": ""}, {"source": "cnn", "title": "Your Election", "link": "https://www.cnn.com/election/2024/your-election", "content": ""}, {"source": "cnn", "title": "CNN en Español", "link": "https://cnnespanol.cnn.com/", "content": ""}, {"source": "cnn", "title": "Trump will win second term, CNN projects, in historic comeback after losing four years ago", "link": "https://www.cnn.com/2024/11/06/politics/trump-wins-election/index.html", "content": "CNN—Donald Trumpwill be America’s 47th president,CNN projected Wednesday, after mounting the most momentous comeback in political history that will hand him massive, disruptive power at home and will send shockwaves around the world.Four years after leaving Washington as a pariah, following his attempt to overturn the 2020 election to stay in office, Trump’s victory defied two assassination attempts, two presidential impeachments, his criminal conviction and many othercriminal charges.Trump vowed at his Mar-a-Lago resort early Wednesday to “heal” the nation, to fix its borders and to deliver a strong and prosperous economy after millions of his voters turned to him amid frustration over high prices for food and housing and embraced his plans for a crackdown on undocumented immigrants.“I want to thank the American people for the extraordinary honor of being elected your 47th president and your 45th president,” said Trump, only the second president to win a nonconsecutive term. “This will truly be the golden age of America.”Video Ad FeedbackTrump speaks to his supporters on election night02:20- Source:CNNBut Trump’s new mandate will raise fresh fears that he plans to follow through on his belief that presidents enjoy almost unlimited authority. He vowed on the campaign trail to use a new White House term to enact “retribution” and has openly talked about using America’s governing institutions, and even the military, to punish his foes. He has pledged to launch a mass deportation of undocumented, and even some legal, immigrants that could set off a showdown with the courts.Vice President Kamala Harris speaks during a campaign rally at the Alliant Energy Center on October 30 in Madison, Wisconsin.Scott Olson/Getty ImagesRelated articleWhere Harris’ campaign went wrongCNN projected Trump’s victory after the state of Wisconsin put him over the top and he secured the270 electoral votesneeded to win the presidency. His win ended the Democrats’ desperate attempt to thwart his return to power, which saw Vice PresidentKamala Harrishurriedly elevated to the party nomination after already unpopular PresidentJoe Biden’s disastrous performance at the CNN debate against Trump in June.The former president outpaced his own performance in a losing cause four years ago, putting the states of Georgia and Pennsylvania back into the GOP column and retaining North Carolina for his party – all of which Democrats had targeted as part of the vice president’s path to the White House.Trump campaigned on searing authoritarian-style rhetoric and false claims that the nation’s towns and cities were under “occupation” from foreign criminals and gangs. But he also tapped into a palpable thirst for change among Americans still feeling the painful aftereffects of a now-cooled run of high inflation. And he warned that only he could stop a slide to World War III as foreign crises rage.He haspromised to create the greatest economyin the world and to make life more affordable for working Americans who form the populist base of the Republican Party that he transformed. Trump’s supporters see him as a unique figure whose blunt, sometimes vulgar and often racially suggestive rhetoric reveals him as a scourge of political correctness. But the spectacle of the final days of the campaign being dominated by debate overwhether Trump is a “fascist”reflects the fresh challenges he’s likely to pose to democratic guarantees and presidential decorum in the years ahead and the dread of at least half the electorate who voted for Harris that he plans to establish authoritarian-style rule.Former President Donald Trump appears in court with his lawyers Todd Blanche, Emil Bove and Susan Necheles for his hush money trial at Manhattan Criminal Court on May 28 in New York City.Spencer Platt/Getty ImagesRelated articleWhat happens to Trump’s criminal and civil cases now that he’s been reelectedTrump’s victory is also certain to lead to thedismissal of special counsel Jack Smithand will mean that the president-elect paid no electoral price for his attempt to overturn the result of the 2020 election, which culminated in his supporters’ mob attack on the US Capitol on January 6, 2021.After years highlighting Biden’s age, Trump, at 78, is now the oldest man to be elected president ,and his every act and utterance as commander in chief is likely to be scrutinized for signs of age-related slowing down or cognitive issues.Given the extreme nature of his campaign, his election may also augur a period of national andinternational turmoil. Trump has vowed to use his second term to seek “retribution” against his political adversaries and mused aloud about using the military against “the enemy from within.” Overseas, US allies are bracing for the return of the wild unpredictability in US foreign policy that Trump whipped up in his first term. There are also concerns about his willingness to enforce NATO’s bedrock principle of mutual defense.Former President Donald Trump appears with his wife, Melania, and son Barron on stage at his election night watch party in West Palm Beach, Florida, on Wednesday, November 6. “I want to thank the American people for the extraordinary honor of being elected your 47th president, and your 45th president,” he told supporters.Will Lanzoni/CNNVice President Kamala Harris deliversher concession speechWednesday at Howard University in Washington, DC. “The outcome of this election is not what we wanted, not what we fought for, not what we voted for,\" she said. \"But hear me when I say: The light of America’s promise will always burn bright.\"Austin Steele/CNNHarris supporters react during her concession speech at Howard University.Austin Steele/CNNTrump supporters cheer election results in Las Vegas.Ian Maule/APTrump supporters hold up posters that read \"47\" as they attend an election watch party in Chandler, Arizona.Go Nakamura/ReutersHarris supporters watch election results come in at Howard University.Austin Steele/CNNTrump supporters cheer at his election night watch party in West Palm Beach.Will Lanzoni/CNNTrump speaks in West Palm Beach early on Wednesday. “We have a country that needs help and it needs help very badly,\"he said. \"We’re going to fix our borders and we’re going to fix everything about our country.\"Jeff Roberson/APA Trump supporter reacts to election results during a Republican watch party in Pewaukee, Wisconsin.Vincent Alban/ReutersElection workers review ballots in Denver on Tuesday.Chet Strange/APNorth Carolina A&T students Leah Charles, left, and Tianna Adams attend an election night watch party in Greensboro, North Carolina.George Walker IV/APTrump supporters watch election results come in at his election night party at the Palm Beach County Convention Center.Will Lanzoni/CNNVoting results are posted at the Fulton County Election Hub and Operation Center in Fairburn, Georgia, on Tuesday.Christian Monterrosa/Bloomberg/Getty ImagesA Harris supporter reacts as election results come in at her watch party at Howard University.Austin Steele/CNNThe Empire State Building in New York is illuminated red, white and blue on Tuesday.Shelby Knowles/Bloomberg/Getty ImagesPeople in West Palm Beach attend Trump's election night watch party.Will Lanzoni/CNNElection observers watch ballots being sorted and counted in Reno, Nevada, on Tuesday.Jason Bean/Reno Gazette Journal/USA Today Network/Imagn ImagesAn American flag is raised at Howard University.Austin Steele/CNNSupporters of Florida's Amendment 4, which would have enshrined abortion rights in the state, react in St. Petersburg, Florida, afterthe amendment's defeat.Rebecca Blackwell/APObservers watch as ballots are scanned in Philadelphia on Tuesday.Leah Millis/ReutersStudents watch election coverage at Spelman College in Atlanta on Tuesday.Brynn Anderson/APVoters stand in line outside a polling place in Phoenix on Tuesday.Matt York/APAlverta Kellaher seals the security envelope of her ballot at the WellSpan York Hospital in York, Pennsylvania, on Tuesday. The hospital provided a secure, emergency vote process for patients.Paul Kuehnel/USA Today Network/Imagn ImagesPeople vote at the Kansas City Urban Youth Academy in Kansas City, Missouri, on Tuesday.David Robert Elliott/The New York Times/ReduxTrump supporters cheer as results come in at his election night watch party in West Palm Beach.Will Lanzoni/CNNHoward University students watch live election results on Tuesday.Nathan Howard/APA large American flag hangs from the ceiling as people vote at the San Francisco Columbarium & Funeral Home on Tuesday.Jeff Chiu/APVoters and their children wait in line at a polling place in Waleska, Georgia, on Tuesday.Nicole Craine/The New York Times/ReduxMembers of the Navajo Nation participate in a Ride to the Polls event in Kayenta, Arizona, on Tuesday.Ernesto Benavides/AFP/Getty ImagesSteven Vandenburgh votes at a grocery store in Lawrence, Kansas, on Tuesday.Charlie Riedel/APVoters fill out their ballots in Seattle on Tuesday.Lindsey Wasson/APVoters wait in line to cast their ballots on the Navajo Nation reservation in Chinle, Arizona, on Tuesday.Andres Leighton/APFrom left, NASA astronauts Butch Wilmore, Suni Williams, Nick Hague and Don Pettit show off their American-themed socks on the International Space Station. \"It doesn’t matter if you are sitting, standing, or floating - what matters is that you vote!\" Hague said in anInstagram postthat came with the photo on Tuesday.Nick Hague/NASAGiant fake flamingos are seen outside a polling location in West Palm Beach on Tuesday.Eva Marie Uzcategui/Bloomberg/Getty ImagesElection workers process mail-in ballots in West Chester, Pennsylvania, on Tuesday.Matt Slocum/APThe headstone of women's suffragist Susan B. Anthony is covered in \"I voted\" stickers at the Mount Hope Cemetery in Rochester, New York, on Tuesday.Lauren Petracca/APVoters take photos of a rainbow as they wait in line outside a polling location in Garden City, Georgia, on Tuesday.Richard Burkhart/Savannah Morning News/USA TodayVoters fill out their ballots at the Ronald Reagan Presidential Library in Simi Valley, California, on Tuesday.Chris Pizzello/APVoters wait in line at a polling location in Austin, Texas, on Tuesday.Jay Janner/Austin American-Statesman/USA TodayKen Brandon, a deacon at Hartford Memorial Baptist Church in Detroit, makes phone calls Tuesday to get out the vote and offer rides to a polling place.Charlie Neibergall/APPeople vote in the showroom of a Honda dealership in Omaha, Nebraska, on Tuesday.Scott Morgan/ReutersJordan Dunson casts her ballot Tuesday while holding her baby at the First Presbyterian Church in Savannah, Georgia.Richard Burkhart/Savannah Morning News/USA Today Network/Imagn ImagesPeople line up to vote outside Allegiant Stadium, home of the Las Vegas Raiders, on Tuesday.John Locher/APElection workers in San Francisco gather ballots at City Hall on Tuesday.Jeff Chiu/APA voter fills out a ballot at a high school gymnasium in Alexandria, Virginia, on Tuesday.Bill Clark/CQ-Roll Call, Inc./Getty ImagesVoters fill out their ballots at the First Presbyterian Church of Dearborn, Michigan, on Tuesday.David Goldman/APJanaye Ruhl votes at a bakery in San Francisco on Tuesday.Jeff Chiu/APPeople in New York vote at the Church of the Heavenly Rest on Tuesday.David Dee Delgado/AFP/Getty ImagesReading glasses are available at a polling location in Boston on Tuesday.Suzanne Kreiter/The Boston Globe/Getty ImagesA voter fills out a ballot at the Ronald Reagan Presidential Library on Tuesday.Chris Pizzello/APAn Amish family leaves a polling location in Intercourse, Pennsylvania, on Tuesday.Ryan Collerd/AFP via Getty ImagesA voter exits a booth at a polling location in Lancaster, New Hampshire, on Tuesday.Joseph Prezioso/AFP/Getty ImagesTrump and his wife, Melania, walk up to the press after voting in Palm Beach, Florida, on Tuesday.Evan Vucci/APMembers of a running group arrive at a polling station in Phoenix to drop off their ballots on Tuesday.Patrick T. Fallon/AFP via Getty ImagesA woman fills out her ballot in Chicago on Tuesday.Charles Rex Arbogast/APVoters cast their ballots at a laundromat in Chicago on Tuesday.Nam Y. Huh/APWorkers process mail-in ballots at a warehouse on the outskirts of Philadelphia on Tuesday.Ed Jones/AFP via Getty ImagesStickers are arranged on a table at a polling location in College Park, Georgia, on Tuesday.Elijah Nouvelage/AFP via Getty ImagesOhio Sen. JD Vance, the Republican Party's vice presidential nominee, arrives to vote with his children Tuesday in Cincinnati.Carolyn Kaster/APPeople line up to cast their votes in Phoenix on Tuesday.Go Nakamura/ReutersElection workers process mail-in ballots in West Chester, Pennsylvania, on Tuesday.Matt Slocum/APPeople arrive at a polling place in Dearborn, Michigan, on Tuesday.Charlie Neibergall/APVoters wait in line in Caguas, Puerto Rico, on Tuesday.Carlos Berríos Polanco/Sipa USA/APVoters receive their ballots at a polling place in Springfield, Pennsylvania, on Tuesday.Matt Slocum/APVoters stand in line outside a polling place in Phoenix on Tuesday morning.Matt York/APA cat named Skye looks on as ballots are cast in Pittsburgh on Tuesday.Quinn Glabicki/ReutersThe US Capitol is seen at sunrise on Tuesday.Jose Luis Magana/APA resident checks in to cast their ballot in Dixville Notch, New Hampshire, just after midnight on Tuesday. Trump and Harristied with three votes eachin the tiny New Hampshire township, kicking off Election Day.Joseph Prezioso/AFP/Getty ImagesElection workers prepare ballots in Denver on Monday, November 4.RJ Sangosti/The Denver Post/Getty ImagesA patron eats inside a restaurant near the White House that had plywood covering its windows on the eve of Election Day.Nathan Howard/ReutersElection workers move mail-in ballots at a processing center in City of Industry, California, on Monday.Robyn Beck/AFP/Getty ImagesA line for early voting stretches around a block in Des Moines, Iowa, on Monday. Some people said they waited more than two hours to cast their ballot.Zach Boyden-Holmes/The Register/USA Today Network/Imagn ImagesA man reads election materials before voting in Charlotte, North Carolina, on Saturday.Mike Stewart/APPeople vote at a polling station in Grand Rapids, Michigan, on Saturday.Carlos Osorio/ReutersVoters are reflected in a window Friday as they mark their ballots at City Hall in Providence, Rhode Island.Steven Senne/APPeople wait in line Friday to vote at Atlanta's High Museum of Art.Elijah Nouvelage/AFP/Getty ImagesVoters mark their ballots inside a mall in Henderson, Nevada, on Friday. It was the last day of early voting in the state.Ian Maule/Bloomberg/Getty ImagesA voter casts a ballot in the Bronx borough of New York during early voting on Friday.David Dee Delgado/AFP/Getty ImagesElection workers sort ballots during early voting in San Francisco on Thursday.David Paul Morris/Bloomberg/Getty ImagesFirst-time voter Kayria Hildebran holds her baby, Kayden, as she fills out her ballot in Cincinnati on Thursday.Carolyn Kaster/APA damaged ballot drop box is displayed during a news conference in Portland, Oregon, on October 28. Investigators in Oregon said they were looking for a man who is responsible forthree recent fires at ballot drop boxes. Hundreds of ballots were damaged.Jenny Kane/APPresident Joe Biden receives a sticker afterhe voted earlyin New Castle, Delaware, on October 28.Craig Hudson/ReutersNew Yorkers vote in the Mount Pisgah Baptist Church in Brooklyn on October 27.Bing Guan/The New York Times/ReduxA woman looks at a ballot while in line for early voting in New York on October 27.Bing Guan/The New York Times/ReduxA ballot box is transported while people vote in Kenosha, Wisconsin, on October 24.Scott Olson/Getty ImagesA voter casts a ballot on the first day of early voting in Miami on October 21.Lynne Sladky/APVoters wait in line as early voting begins in Wilmington, North Carolina, on October 17.Allison Joyce/Bloomberg/Getty ImagesPeople walk to a polling station in Atlanta on October 16.Megan Varner/ReutersVoter Scott Graham wears an early voting sticker after casting his ballot in Minneapolis on September 20.Adam Bettcher/APIn pictures: Trump wins back the presidencyPrevNextBut the billionaire real estate tycoon and former reality star’s win, based on a peerless grip on the GOP, also undeniably turns Trump into one of the most significant political figures in the history of the United States. It underlines that his victory in 2016 was not an aberration but heralded a major realignment in domestic politics and the US’ role in the world. It also means that Biden’s legacy will no longer be defined by his success in ejecting Trump from power in 2020 but by his hubris in seeking a second term that would have ended when he was 86, which opened the door to his rival again.Former President Donald Trump emerges to speak at the Palm Beach County Convention Center in West Palm Beach, Florida, on Wednesday, November 6, 2024.Will Lanzoni/CNNRelated articleTrump’s second term will look nothing like his firstAnd Trump’s success means that he has for the second time defied the aspirations of millions of Americans for a female president, since his vanquishing of Harris follows his 2016 defeat of Hillary Clinton, again preventing the shattering of what she called “the highest, hardest glass ceiling” in US politics.Trump’s false claims that he was illegally ejected from power in 2020 formed the foundation of his return four years later, since millions of Americans bought into his alternative reality. The ex-president’s defiance – and his capacity to weaponize charges against him – was best illustrated by the way he seized onhis mug shot, taken in a Georgia jail after he was indicted over election interference in the state. He turned the photo into a political rallying call for a primary campaign that previously lacked juice, using subsequent legal woes – including a criminal conviction in Manhattan in ahush money case– to keep his base energized by claiming he was being indicted for them. His sense of indestructibility – and the almost divine purpose felt by many of his supporters – was reinforcedwhen he narrowly escapeda would-be assassin’s bullet at a rally in Pennsylvania, and rose, with his ear bloodied and his fist in the air, and told his supporters to “fight, fight, fight.”Former President Donald Trump, with blood on his face, raises his fist to the crowd as he is surrounded by Secret Service agents at his campaign rally in Butler, Pennsylvania.Evan Vucci/APThe promises that Trump made on the campaign trail leave many Americans braced for one of the most disruptive and divisive periods in the country’s modern memory. Trump has promised to immediately launch thebiggest deportation operationin history on Day 1 – targeting undocumented immigrants and legal Haitian refugees whomhe falsely accusedof eating the pets of Ohio residents. The president-elect has also pledged a fundamental overhaul of the US economic system and plans to introduce sweeping tariffs on foreign imports – with especially punitive hikes on Chinese goods – that willcause global shockwaves.Republicans have alreadywon back the Senate, according to CNN’s projection, meaning that the president-elect will have huge latitude to complete his bid to transform the judiciary to ensure conservative legal dominance continues for decades. The race for the House of Representatives is still in the balance, but if Republicans can retain their narrow majority, Trump will face few challenges to his rule in Washington.An unfettered presidency?Trump and his supporters have made clear that they believe his most authentic instincts were thwarted in his first term by establishment figures in Washington. He and his loyalists have therefore proposed plans that could gut the government’s administrative departments and replace civil servants with political loyalists who will carry out his most draconian political desires. Trump has also vowed to sweep away the top layers of personnel at the Justice Department and in the intelligence agencies that he considers biased against him.Former President Donald Trump speaks at the Palm Beach County Convention Center in West Palm Beach, Florida, on November 6, 2024.Will Lanzoni/CNNRelated articleHere’s what Trump is proposing for the economyHis plans will almost certainly cause a showdown over the extent of presidential powers between the White House and the courts. And any efforts to use the instruments of government to push his own personal and political agendas and to punish his enemies could severely test the rule of law. But Trump has made no secret that he plans to fully exploitthis summer’s Supreme Court rulingthat granted commanders in chief substantial immunity for White House official acts and bolstered his already questionable claims that the president enjoys unchecked power.Trump’s return to power is alsocertain to end the federal prosecutionsthat resulted from his attempts to overturn the 2020 election. Trump’s new attorney general will be able to end the case being brought by Smith on election interference and his appeal to revive a trial over Trump’s hoarding of classified documents at his Mar-a-Lago resort in Florida. The status of a state prosecution in Georgia over Trump’s bid to overturn Biden’s victory there is more uncertain but is likely to result in a legal tussle over the capacity of a state to put a sitting president on trial. Trump has, meanwhile, made clear that he is open to pardoning supporters convicted and sent to prison for their role in the Capitol insurrection.Police clash with pro-Trump rioters who had entered the Capitol. This was the first time the Capitol had been breached since the British attacked and burned the building in August 1814, during the War of 1812. It took several hours for the Capitol to be secured.Mostafa Bassim/Anadolu Agency/Getty ImagesWEST PALM BEACH, FLORIDA - NOVEMBER 06:  Republican presidential nominee, former U.S. President Donald Trump speaks during an election night event at the Palm Beach Convention Center on November 06, 2024 in West Palm Beach, Florida. Americans cast their ballots today in the presidential race between Republican nominee former President Donald Trump and Vice President Kamala Harris, as well as multiple state elections that will determine the balance of power in Congress.   (Photo by Chip Somodevilla/Getty Images)Chip Somodevilla/Getty ImagesRelated articleTrump’s victory could mean US withdraws support for Ukraine in war with RussiaAbroad, Trump is likely to again turn the United States into the one of the world’s greatest sources of unpredictability. A mercurial foreign policy that mirrors his volcanic character is expected to further erode Washington’s position as the head of a rules-based, Western democratic world order. He has pledged to end the war in Ukraine shortly after taking power. His affinity for Russian President Vladimir Putin, whom he referred to as a “genius” on the campaign trail, risks a resolution that validates the Kremlin’s illegal and bloody assault on a sovereign democratic nation. Such a strategy would raise questions about America’s potential appeasement of foreign autocrats and its traditional support for upholding the territorial integrity of its allies in Europe and the Pacific, including NATO partners and Taiwan.The president-elect has not wavered in his view that American allies have been freeloading off US security guarantees for decades, and he is likely to put intense pressure on them to do more to ensure their own means of defense. Some experts credit him with forcing NATO nations into bolstering their own military capacity in his first term. And his victory is likely to be welcomed by Israel, as it pursues its wars against Hamas in Gaza and against Hezbollah in Lebanon, and in some Gulf states that agreed with Trump’s extreme hardline stance against Iran in his first term. Trump’s supporters believe that he will fix what they see as America’s weakness abroad, especially after thechaotic US withdrawalfrom Afghanistan on Biden’s watch.A new test for a rattled national psycheTrump, if he completes his four-year second term, will become the oldest sitting president in history, a milestone that will be rich in irony since his relentless attacks on Biden’s age and mental faculties paved the way for his successor’s exit from the political stage.During the campaign, Trump’s own mental lapses and unpredictable behavior raised speculation about his health and cognition – a theme that is likely to last throughout his second presidency. And the former president’s undimmed habit of inserting himself into every cultural and political debate and incessant zeal for igniting clashes with his political and personal adversaries promise another test for the national psyche.Trump will be accompanied into the White House byVice President-elect JD Vance, an Ohio senator who emerged as a potential heir to Trumpism with his vehement defenses of his new boss on the campaign trail. Trump’s first vice president, Mike Pence, is now persona non grata in the Republican Party after he refused Trump’s demands to thwart the Constitution to overturn the result of the 2020 election during the certification process.Sen. JD Vance (R-OH) introduces former President Donald Trump during a rally at Herb Brooks National Hockey Center on July 27, 2024 in St Cloud, Minnesota.Stephen Maturen/Getty ImagesThe former president’s return to the Oval Office makes him only the second president since Grover Cleveland in 1892 to claim a second term after losing reelection.His supporters will be waiting with high anticipation – while millions of other Americans will be watching with dread – for the second iteration of his “American carnage” inaugural address from 2017, when he raises his hand to pledge to preserve, protect and defend the Constitution, in January."}, {"source": "cnn", "title": "Republicans will flip the Senate, CNN projects, shifting balance of power in Washington", "link": "https://www.cnn.com/2024/11/06/politics/senate-flip-republicans/index.html", "content": "CNN—Republicans will win the US Senate majority, CNN projects, shifting the balance of power in Washington and putting the chamber in position to boost Donald Trump‚Äôs presidency.Withseveral racesstill to be declared,Republicans now have 52 seatsin the chamber and will assume control under ayet-to-be chosen Republican leaderwhen the new Congress convenes in January.The Senate takeover was the first big success of the night for Republicans, and the destiny of the House of Representatives, where the GOP is trying to defend its narrow majority, remains up in the air.The new GOP Senate will be in a position to back Trump‚Äôs agenda and to resume the ex-president‚Äôs significant reshaping of the judiciary with scores of more conservatives.The Republican march to control started early on election night when West Virginia Gov. Jim Justice was projected to pick up the Senate seat vacated by retiring Democrat-turned-independent Sen. Joe Manchin. Democrats had stopped contesting the seat after Manchin announced he wouldn‚Äôt seek reelection.In Ohio, Democratic Sen. Sherrod Brown, who has served in the chamber for three terms, willlose his reelection bid, CNN projects, in a state that has gone from a perennial political bellwether during his tenure to a deep red stronghold. The new Republican senator will be businessman Bernie Moreno, a vehement Trump supporter.And early Wednesday morning,CNN projectedthat in Montana, Republican businessman Tim Sheehy, a retired Navy SEAL, defeated three-term Democratic Sen. Jon Tester.Cruz and Scott cruise to reelectionThe few Democratic opportunities to mitigate their losses dwindled quickly throughout the night.In Florida,GOP Sen. Rick Scotteasily dispatched a challenge from Democratic former Rep. Debbie Mucarsel-Powell, who had built her campaign partly on a backlash to the overturning of the federal right to an abortion and Florida‚Äôs six-week abortion ban. Democrats had hoped that an abortion measure on the state‚Äôs ballot could boost Democratic turnout, but that measure failed Tuesday night.The party‚Äôs best chance to pick up a seat had been in Texas, where national party groups made late multimillion-dollar investments into trying to unseatGOP Sen. Ted Cruz. But the two-term senator will defeat Democratic Rep. Colin Allred, CNN projects, in yet another disappointment for Democrats as they chase the mirage of making inroads in the longtime Republican state.And in Nebraska, CNN projects that RepublicanSen. Deb Fischerwill defeat a stronger-than-expected challenge from independent Dan Osborn, who, along with his allies, outspent Republican forces in the state. Her loss wouldn‚Äôt necessarily have flipped the seat to the Democrats, since Osborn hadn‚Äôt said which party he‚Äôd caucus with in Washington. But with Democrats trying to stave off a GOP majority, an Osborn win would have deprived Republicans of a seat.Outstanding racesDemocrats had always faced a prohibitive path this year in defending their narrow control of the Senate, given the incumbents facing reelection are either in states Trump had carried twice before or narrowly lost in 2020.There are several key outstanding competitive races that have not been called.Wisconsin Democratic Sen. Tammy Baldwin, who is running for a third term, is in a tight race with Republican Eric Hovde, in a state also critical to the presidential race.In another blue wall state critical to Democrats‚Äô success up and down the ballot, two national security specialists are facing off in Michigan. Democratic Rep. Elissa Slotkin is seeking to hold the seat being vacated by retiring Sen. Debbie Stabenow. She is facing Republican former Rep. Mike Rogers, the one-time chairman of the House Intelligence Committee who left Congress in 2015.In Pennsylvania, Democratic Sen. Bob Casey is trying to hold off a challenge from Republican Dave McCormick, who lost out on Trump‚Äôs backing during the 2022 Senate primary but secured it, and the GOP nomination, this year.The final numbers in the Senate will also have to await the result from Nevada, where first-term Democratic Sen. Jacky Rosen is up against Republican Sam Brown, an Army veteran who also lost a primary two years ago for the state‚Äôs other Senate seat. And in Arizona, where Democratic-turned-independent Sen. Kyrsten Sinema is retiring, Democratic Rep. Ruben Gallego is facing Trump acolyte Kari Lake, the 2022 gubernatorial nominee who still refuses to acknowledge her defeat in that race.There was not much to cheer for Democrats on the Senate map on Tuesday, but Democrat Angela Alsobrooks was projected to beat Maryland‚Äôs Republican formerGov. Larry Hogan, who was popular in the solidly blue state. Hogan was often critical of Trump, a stand that was challenging for him with deeply conservative Republicans in Maryland‚Äôs western districts and areas close to the eastern shore. Alsobrooks will become just the fourth Black woman elected to the Senate after Democrat Lisa Blunt Rochester, the third, was projected to win Delaware‚Äôs open Senate seat earlier in the night.This story has been updated with additional developments."}, {"source": "cnn", "title": "Republicans will retain House majority, CNN projects, completing GOP’s dominance of Washington", "link": "https://www.cnn.com/2024/11/13/politics/house-control-republicans-trifecta/index.html", "content": "CNN—Republicans have secured their monopoly on power inDonald Trump‚Äôs new Washington, retainingtheir majorityin the House of Representatives, CNN projected Wednesday, ushering in a dramatic new era of right-wing populist rule.The GOP‚Äôs control of both chambers of Congress ‚Äì won after Republicans were projected to hold two House seats in California and Arizona ‚Äì means that the president-elect will have a path to enact an agenda that could profoundly change America, including sweeping tax cuts, hardline immigration enforcement and a transformation of domestic and foreign policy.Republican dominance of Capitol Hill is just one aspect of Trump‚Äôs formidable new power base. A president-elect who already believed that he had all-but-limitless power will be emboldened by last summer‚Äôs Supreme Court ruling offering substantial immunity to the commander in chief for official acts taken in office.Trump may also have the chance in the next four years to replace older members of the court, potentially extending until the middle of the century the conservative majority he built in his first term.And as Trump unveils his team of Cabinet members and top West Wing staff, made up largely of ultra loyalists, it‚Äôs already clear that the 47th president will face few of the restraints that experienced career officials tried to impose on some of his most outlandish schemes when he was the 45th president.Trump‚Äôs team is promising an aggressive first 100-day agenda to enact as much of his ‚ÄúMake America Great Again‚Äù plan early next year after tapping into the public‚Äôs concern about high prices and undocumented migrants to help the GOP win the White House, the Senate and now the House.Republicans flipped the Senate by defeating Democrats defending red states and, with one outstanding race yet to be projected, they control 52 seats. While the Senate filibuster means that 60 votes are needed to pass most major legislation, party leaders will be able to use the same budgetary devices that helped President Joe Biden pass some big-ticket items.The GOP‚Äôs victory in the House represents a triumph for Speaker Mike Johnson, who struggled to control his restive conference over the last year. The House GOP often plunged into chaos and infighting ‚Äî some of which was exacerbated by Trump‚Äôs interventions and the behavior of some of his most outspoken supporters. The narrow majority meant that any one member could decide to stage a revolt or to break with leadership for personal political gain.The question now will be how large next year‚Äôs House majority becomes and whether the GOP can widen the margin of a handful of seats that has made managing the conference so complex for Johnson. The fact that Trump will be in the White House with the GOP in full control could make unity easier next year. However, Trump is alreadypoaching from the incoming majorityfor his Cabinet picks, and even with those members hailing from safe Republican seats, their likely vacancies could last long enough to cause headaches for Johnson.Democrats had held out fading hopes in the days after the election that they could flip the House and create a sole bastion against Trump‚Äôs rule ‚Äî a feat that looked like a possibility for much of the year given the chamber‚Äôs unproductive record and Johnson‚Äôs struggle to assert control. Democrats were targeting Republicans sitting in districts that Biden had won four years ago ‚Äì many of which were in New York and California ‚Äì but with Trump‚Äôs resounding victory this year, some of those seats became harder to pick off.Democrats are now left with the momentous task of regrouping ahead of the midterm elections in 2026 ‚Äî without a single platform of power in Washington.Republicans had seized back the House in the 2022 midterm elections to put a brake on Biden‚Äôs term, largely through winning a flurry of those competitive seats in New York and California. Democrats managed to flip several New York seats this year, but Trump‚Äôs relative strength for a Republican presidential candidate in the state of his birth helped limit Democratic gains. Democrats also failed to knock off some other key targets, like GOP Rep. Don Bacon, whose Omaha-area district in Nebraska gave Vice President Kamala Harris an electoral vote. And the GOP captured some of its top targets in Pennsylvania and Michigan.That left the destiny of the House playing out in counts stretching well past Election Day in California, Oregon, Arizona, Iowa and Alaska, among other places.Democrats held on to some of their most competitive seats, however, like that of vulnerable Washington state Rep. Marie Gluesenkamp Perez, and were hopeful about others in Ohio and Maine in strong Trump territory.Johnson, who rose from obscurity on the backbenches to the speakership after a party meltdown following the ouster of previous House Speaker Kevin McCarthy in 2023, anchored his strategy to keep the chamber ‚Äî and, if possible, enlarge his majority ‚Äî on a tight alliance with Trump. The Louisiana Republican traveled to the president-elect‚Äôs Mar-a-Lago resort to celebrate on election night and his office has been coordinating closely with the transition team.And on Wednesday, before Trump‚Äôs arrival at a closed-door meeting with House Republicans, Johnson heralded the president-elect as ‚Äúthe comeback king,‚Äù according to a source in the room.Trump backed his bid to remain speaker, and the Louisiana Republican was later nominated unanimously by voice vote, two sources in the room told CNN. He‚Äôll face a House floor vote on January 3.Despite some conservatives pressing Johnson ‚Äì on everything from not sending more money to Ukraine to why the GOP didn‚Äôt win more seats ‚Äì the party largely projected unity behind Trump and his backing of Johnson.‚ÄúIf Donald Trump says jump three feet high and scratch your head, we all jump three feet high and scratch our heads,‚Äù GOP Rep. Troy Nehls of Texas told CNN. ‚ÄúThat‚Äôs it.‚ÄùThe speaker does face one looming crisis ‚Äî a need to raise the government‚Äôs borrowing limit, perhaps by early summer, although there may be limited appetite from fiscal hawks in the party to provoke a showdown that could anger Trump.This story has been updated with additional developments.CNN‚ÄôsAnnie Grayer, Haley Talbot and Aileen Graef contributed to this report."}, {"source": "cnn", "title": "Eight takeaways from the 2024 election", "link": "https://www.cnn.com/2024/11/06/politics/takeaways-election-day/index.html", "content": "CNN—Donald Trumphas completed a paradigm-shattering political comeback,winning the White Housein an election shaped more by Americans’ dissatisfaction with the direction of the country than by Democrats’ dire warnings of the threat the 45th and soon-to-be 47th president poses to its founding principles.In a repeat of his 2016 victory, Trump once again broke through the “blue wall.” He defeated Vice President Kamala Harris in Pennsylvania and was leading in two more Great Lakes swing states, Michigan and Wisconsin. He also romped in the Sun Belt battlegrounds, winning Georgia and North Carolina and leading in Arizona and Nevada.CNNRelated cardAnatomy of three Trump elections: How Americans shifted in 2024 vs. 2020 and 2016Trump made gains with nearly every demographic group compared with his 2020 loss,CNN’s exit polls showed. And his apparent near-mirroring of the 2016 map would indicate that he paid no political price for his lies about fraud in that election, his efforts to overturn it, or the criminal charges he has faced since then.He is now poised to return to office with a Republican Senate majority, easing his path to confirming his choices for key government posts. It’s not yet clear which party will control the House.Democrats, meanwhile, will be forced to confront difficult questions about the direction of the party — on the issues, and on its appeal to critical segments of the electorate, particularly the Latinos whose realignment could reshape American politics.Here are eight takeaways from the 2024 election:Trump undoes the Biden mapThough several states are still tallying their results, Trump’sroad to victory in 2024appears to have been nearly identical to his 2016 win.Both campaigns had long been focused on seven swing states: the “blue wall” of Michigan, Pennsylvania and Wisconsin, and the Sun Belt battlegrounds of Arizona, Georgia, North Carolina and Nevada.There were no surprises — no states that unexpectedly slipped into Trump’s column, despite his musings about winning blue states like New Mexico and Virginia.However, Trump has already claimed Georgia, North Carolina and Pennsylvania, and he leads in all seven battlegrounds. In 2020,Joe Bidenhad won six of those seven — losing only North Carolina to Trump.The final count could take weeks, but Trump also holds the popular vote lead. If that edge holds, he’d be the first Republican since George W. Bush in 2004 to win the popular vote.The ‘glass ceiling’ remains intactHarris’ loss will once again leave disappointed the millions of women who hoped to see the history-making moment when what Hillary Clinton famously called the “glass ceiling” was shattered.There was a significant gender split, with the majority of women backing Harris, but men supporting Trump, CNN’s exit polls showed.The only segment of the electorate with which Harris made notable gains over Biden’s 2020 performance was with college-educated women — the voters who had propelled the party’s strong suburban performance in the 2022 midterms.A supporter of Vice President Kamala Harris reacts as election results come in at Harris' watch party at Howard University in Washington, DC.Austin Steele/CNNAbortion rights, the issue that fueled Democratic wins in 2022, on ballot initiatives and in special elections, proved less potent this year.Harris performed much worse than Biden among voters who said they thought abortion should be legal in most cases — even though the Supreme Court reversed Roe v. Wade in between the two elections.Four years ago, 26% of the electorate held that opinion, and Biden won them by 38 points. This year, 33% held that opinion, and Harris won them by just 3 points.It’s a result that suggests the issue wasn’t the deciding factor for many of those voters — even though Democrats had succeeded in the 2022 midterms, special elections and more by highlighting the GOP’s role in ending Roe v. Wade’s national abortion rights protections.Republicans win the SenateRepublicanswon back the Senate majoritythat they held during Trump’s first term but lost when he was defeated in 2020.The GOP win would have significant ramifications for a new president —easing Trump’s path to having nominees for the Cabinet and other key posts confirmed.Democrats entered the 2024 election cycle with only one or two seats to spare (depending on which party was in the White House, and therefore held the vice president’s tie-breaking vote) — and an all-but-impossible map to defend, with three seats in deep-red states on the ballot.Republicans won all three of those races. West Virginia Sen. Joe Manchin’s retirement effectively guaranteed Republican Jim Justice’s win there. Montana Sen. Jon Tester lost to 38-year-old former Navy SEAL Tim Sheehy. Ohio Sen. Sherrod Brown fell short against businessman Bernie Moreno.Ohio Republican Senate candidate Bernie Moreno during a watch party on election night in Westlake, Ohio.Sue Ogrocki/APDemocrats hoped a long shot would materialize — crossing their fingers that Rep. Colin Allred could oust Texas Sen. Ted Cruz, or that former Rep. Debbie Mucarsel-Powell could buck Florida’s rightward trend and beat Sen. Rick Scott. Neither came close.Three Senate races in the Great Lakes battleground states of Michigan, Pennsylvania and Wisconsin were also neck-and-neck. Their outcome will determine the size of the GOP majority.Republicans now face a battle to replace Mitch McConnell as the party’s leader in the chamber, after the Kentucky senator said in February he would step down from his leadership post. Texas Sen. John Cornyn and South Dakota Sen. John Thuneare the two top candidates.Democrats could find some shelter in the HouseDemocrats didn’t want to discuss it before the election, but they’re talking about it now.With Harris’ loss of the presidency and with the Senate coming under GOP control, the House could become the party’s last line of defense in Washington.With so many votes still to be counted and races to be called, it’s hard to say whether House Democrats are on a path to victory or are headed for another close defeat. Democrats have had some good news out of New York and California, which could on their own kick out enough GOP incumbents to make Hakeem Jeffries the next House speaker.What that would mean is, simply, that Trump would be unable to pass much, if any, legislation and perhaps more importantly would find himself hamstrung as he tries to wind back Biden’s policies.Former first lady Melania Trump, former President Donald Trump and Barron Trump at the Palm Beach County Convention Center in West Palm Beach, Florida, on Wednesday, November 6.Will Lanzoni/CNNRelated articleTrump will win second term, CNN projects, in historic comeback after losing four years agoThe CHIPS Act, a bipartisan law investing in memory chip manufacturing, would be on the chopping block if Republicans keep their majority, but absent that, most would assume it’s off the table. Same goes for any move to uproot the public investments doled out by the Bipartisan Infrastructure and Inflation Reduction acts, which appear safe for the time being.Obamacare, too, would almost surely be in the clear. (Republicans couldn’t repeal it with a governing trifecta in 2017, so talk of repeal might be over anyway.) Though all of these laws – the signature achievements of the last two Democratic administrations – seem safe if Democrats get their majority, there will still be tough fights at the administration and agency levels about how they’re managed.But on an otherwise bleak night for Democrats, a fighting chance is the best the party can ask for.Rural voters are an even more potent force than many realizedIf Trump does return to the White House, he will have rural counties across the battleground states to thank.There will be a lot of back-and-forth over why Harris underperformed Biden in big cities and their suburbs, but the fact remains she won in those places mostly by significant margins.Former President Donald Trump speaks at the Palm Beach County Convention Center in West Palm Beach, Florida, on November 6, 2024.Will Lanzoni/CNNRelated articleHere’s what Trump is proposing for the economyStill, Trump’s margins in rural America appear to have been simply too large to overtake. It turns out that there were, in fact, more votes for the former president to mine in counties like central Pennsylvania’s Huntingdon, a short drive from the campus of Penn State University, where he’s on pace to outperform both his vote total and margin from four years ago.Harris’s performance in corresponding strongholds was pretty much the inverse.In Montgomery County, home to a big chunk of the Philadelphia suburbs, Harris is on pace to win about 60% of the vote. The problem for the vice president – and it’ll be something Democrats spend a lot of time chewing on – is Biden fared about 2.5 points better than that.There was a similar dynamic on display in Michigan’s Oakland County, too, where Trump again turned out his base and, in some places, added to it, while Harris appears unlikely to match Biden’s 14-point advantage.Small numbers in the grander scheme of an election so big, expensive and plainly complicated could seem negligible – but they add up. And on Tuesday, the math appeared to be on Trump’s side.Democrats will do some soul searchingWell before the outcome of the presidential election came into view, one thing was crystal clear for Democrats as Tuesday night rolled on: There would be lots of finger-pointing around the party. The results were not just a disappointment at the presidential level. In parts of the country where Democrats won and expected to win, the margin was far from comfortable.Vice President Kamala Harris speaks during a campaign rally at the Alliant Energy Center on October 30 in Madison, Wisconsin.Scott Olson/Getty ImagesRelated articleWhere Harris’ campaign went wrongEven in a scenario where Trump would be able to turn out his base, Democrats thought a surge of support among women voters thanks to an emphasis on abortion rights in races across the country would keep the presidential race close.“As we have known all along, this is a razor thin race,” wrote Harris campaign chair Jen O’Malley Dillon in an email at one point in the night.But as the night dragged on, it was not nearly as narrow as Democratic polling and public polling had projected. It became clear to Democrats that they were no longer the party with an ongoing advantage among minority voters and labor unions. And they will have to think about how to win over those constituencies and where they went wrong in messaging and ground game.“There’ll be plenty of critiques and so on,” Democratic strategist David Axelrod said on CNN – before going on to praise Harris as a candidate despite the results.Trump makes big gains with Latino menTrump’s campaign pushed hard to court men, and particularly men of color. CNN’s exit polls showed it paid off.Chief among Trump’s gains compared with his performance against Biden in 2020: Latino men. Trump won that cohort by 8 points, four years after losing them by 23 points. It’s a result that showed his campaign’s efforts to court those voters paid off — and that the late focus on acomedian mocking Puerto Ricoat Trump’s Madison Square Garden rally didn’t cause the damage Harris’ campaign hoped it would. The gains were concentrated most heavily among Latinos under age 65.Trump also made gains in key places among Black men, more than doubling his 2020 performance in North Carolina.Former President Donald Trump speaks during a campaign rally at the J.S. Dorton Arena on November 4, 2024, in Raleigh, North Carolina.Chip Somodevilla/Getty ImagesOverall, the exit polls painted a picture of an electorate displeased with the state of the nation and its leadership.Nearly three-fourths of voters said they were dissatisfied or angry with the way things are going in the United States, CNN’s exit polls found. Trump won about three-fifths of those voters. Biden was deeply underwater, with 58% of voters saying they disapprove of his performance as president. Four in five of those voters backed Trump.Harris slipped compared with Biden’s performance four years ago among young voters, independents, moderates and union households.Voters who said democracy was the most important issue overwhelmingly backed Harris, but Trump won those who identified the economy as most important by nearly the same margin.Florida and Ohio are no longer battlegroundsFlorida’s decades-long status as a presidential swing state is over.Two years after Republican Gov. Ron DeSantis romped to a 19-percentage-point reelection victory, Trump backed it up with another double-digit GOP win.In heavily Hispanic Miami-Dade County — traditionally a huge source of Democratic votes — the massive swing was on full display. What had been a 29-point Hillary Clinton win in 2016 was an 11-point Trump victory this year.Florida even bucked the national trend of states of all political stripes backing abortion rights ballot measures in the two and a half years since Roe v. Wade’s reversal.A majority of Florida voters there backed a ballot measure to legalize abortion, but it fell short of the state’s 60% threshold to win passage — meaning the state’s six-week ban remains in place.Former President Donald Trump appears with his wife, Melania, and son Barron on stage at his election night watch party in West Palm Beach, Florida, on Wednesday, November 6. “I want to thank the American people for the extraordinary honor of being elected your 47th president, and your 45th president,” he told supporters.Will Lanzoni/CNNVice President Kamala Harris deliversher concession speechWednesday at Howard University in Washington, DC. “The outcome of this election is not what we wanted, not what we fought for, not what we voted for,\" she said. \"But hear me when I say: The light of America’s promise will always burn bright.\"Austin Steele/CNNHarris supporters react during her concession speech at Howard University.Austin Steele/CNNTrump supporters cheer election results in Las Vegas.Ian Maule/APTrump supporters hold up posters that read \"47\" as they attend an election watch party in Chandler, Arizona.Go Nakamura/ReutersHarris supporters watch election results come in at Howard University.Austin Steele/CNNTrump supporters cheer at his election night watch party in West Palm Beach.Will Lanzoni/CNNTrump speaks in West Palm Beach early on Wednesday. “We have a country that needs help and it needs help very badly,\"he said. \"We’re going to fix our borders and we’re going to fix everything about our country.\"Jeff Roberson/APA Trump supporter reacts to election results during a Republican watch party in Pewaukee, Wisconsin.Vincent Alban/ReutersElection workers review ballots in Denver on Tuesday.Chet Strange/APNorth Carolina A&T students Leah Charles, left, and Tianna Adams attend an election night watch party in Greensboro, North Carolina.George Walker IV/APTrump supporters watch election results come in at his election night party at the Palm Beach County Convention Center.Will Lanzoni/CNNVoting results are posted at the Fulton County Election Hub and Operation Center in Fairburn, Georgia, on Tuesday.Christian Monterrosa/Bloomberg/Getty ImagesA Harris supporter reacts as election results come in at her watch party at Howard University.Austin Steele/CNNThe Empire State Building in New York is illuminated red, white and blue on Tuesday.Shelby Knowles/Bloomberg/Getty ImagesPeople in West Palm Beach attend Trump's election night watch party.Will Lanzoni/CNNElection observers watch ballots being sorted and counted in Reno, Nevada, on Tuesday.Jason Bean/Reno Gazette Journal/USA Today Network/Imagn ImagesAn American flag is raised at Howard University.Austin Steele/CNNSupporters of Florida's Amendment 4, which would have enshrined abortion rights in the state, react in St. Petersburg, Florida, afterthe amendment's defeat.Rebecca Blackwell/APObservers watch as ballots are scanned in Philadelphia on Tuesday.Leah Millis/ReutersStudents watch election coverage at Spelman College in Atlanta on Tuesday.Brynn Anderson/APVoters stand in line outside a polling place in Phoenix on Tuesday.Matt York/APAlverta Kellaher seals the security envelope of her ballot at the WellSpan York Hospital in York, Pennsylvania, on Tuesday. The hospital provided a secure, emergency vote process for patients.Paul Kuehnel/USA Today Network/Imagn ImagesPeople vote at the Kansas City Urban Youth Academy in Kansas City, Missouri, on Tuesday.David Robert Elliott/The New York Times/ReduxTrump supporters cheer as results come in at his election night watch party in West Palm Beach.Will Lanzoni/CNNHoward University students watch live election results on Tuesday.Nathan Howard/APA large American flag hangs from the ceiling as people vote at the San Francisco Columbarium & Funeral Home on Tuesday.Jeff Chiu/APVoters and their children wait in line at a polling place in Waleska, Georgia, on Tuesday.Nicole Craine/The New York Times/ReduxMembers of the Navajo Nation participate in a Ride to the Polls event in Kayenta, Arizona, on Tuesday.Ernesto Benavides/AFP/Getty ImagesSteven Vandenburgh votes at a grocery store in Lawrence, Kansas, on Tuesday.Charlie Riedel/APVoters fill out their ballots in Seattle on Tuesday.Lindsey Wasson/APVoters wait in line to cast their ballots on the Navajo Nation reservation in Chinle, Arizona, on Tuesday.Andres Leighton/APFrom left, NASA astronauts Butch Wilmore, Suni Williams, Nick Hague and Don Pettit show off their American-themed socks on the International Space Station. \"It doesn’t matter if you are sitting, standing, or floating - what matters is that you vote!\" Hague said in anInstagram postthat came with the photo on Tuesday.Nick Hague/NASAGiant fake flamingos are seen outside a polling location in West Palm Beach on Tuesday.Eva Marie Uzcategui/Bloomberg/Getty ImagesElection workers process mail-in ballots in West Chester, Pennsylvania, on Tuesday.Matt Slocum/APThe headstone of women's suffragist Susan B. Anthony is covered in \"I voted\" stickers at the Mount Hope Cemetery in Rochester, New York, on Tuesday.Lauren Petracca/APVoters take photos of a rainbow as they wait in line outside a polling location in Garden City, Georgia, on Tuesday.Richard Burkhart/Savannah Morning News/USA TodayVoters fill out their ballots at the Ronald Reagan Presidential Library in Simi Valley, California, on Tuesday.Chris Pizzello/APVoters wait in line at a polling location in Austin, Texas, on Tuesday.Jay Janner/Austin American-Statesman/USA TodayKen Brandon, a deacon at Hartford Memorial Baptist Church in Detroit, makes phone calls Tuesday to get out the vote and offer rides to a polling place.Charlie Neibergall/APPeople vote in the showroom of a Honda dealership in Omaha, Nebraska, on Tuesday.Scott Morgan/ReutersJordan Dunson casts her ballot Tuesday while holding her baby at the First Presbyterian Church in Savannah, Georgia.Richard Burkhart/Savannah Morning News/USA Today Network/Imagn ImagesPeople line up to vote outside Allegiant Stadium, home of the Las Vegas Raiders, on Tuesday.John Locher/APElection workers in San Francisco gather ballots at City Hall on Tuesday.Jeff Chiu/APA voter fills out a ballot at a high school gymnasium in Alexandria, Virginia, on Tuesday.Bill Clark/CQ-Roll Call, Inc./Getty ImagesVoters fill out their ballots at the First Presbyterian Church of Dearborn, Michigan, on Tuesday.David Goldman/APJanaye Ruhl votes at a bakery in San Francisco on Tuesday.Jeff Chiu/APPeople in New York vote at the Church of the Heavenly Rest on Tuesday.David Dee Delgado/AFP/Getty ImagesReading glasses are available at a polling location in Boston on Tuesday.Suzanne Kreiter/The Boston Globe/Getty ImagesA voter fills out a ballot at the Ronald Reagan Presidential Library on Tuesday.Chris Pizzello/APAn Amish family leaves a polling location in Intercourse, Pennsylvania, on Tuesday.Ryan Collerd/AFP via Getty ImagesA voter exits a booth at a polling location in Lancaster, New Hampshire, on Tuesday.Joseph Prezioso/AFP/Getty ImagesTrump and his wife, Melania, walk up to the press after voting in Palm Beach, Florida, on Tuesday.Evan Vucci/APMembers of a running group arrive at a polling station in Phoenix to drop off their ballots on Tuesday.Patrick T. Fallon/AFP via Getty ImagesA woman fills out her ballot in Chicago on Tuesday.Charles Rex Arbogast/APVoters cast their ballots at a laundromat in Chicago on Tuesday.Nam Y. Huh/APWorkers process mail-in ballots at a warehouse on the outskirts of Philadelphia on Tuesday.Ed Jones/AFP via Getty ImagesStickers are arranged on a table at a polling location in College Park, Georgia, on Tuesday.Elijah Nouvelage/AFP via Getty ImagesOhio Sen. JD Vance, the Republican Party's vice presidential nominee, arrives to vote with his children Tuesday in Cincinnati.Carolyn Kaster/APPeople line up to cast their votes in Phoenix on Tuesday.Go Nakamura/ReutersElection workers process mail-in ballots in West Chester, Pennsylvania, on Tuesday.Matt Slocum/APPeople arrive at a polling place in Dearborn, Michigan, on Tuesday.Charlie Neibergall/APVoters wait in line in Caguas, Puerto Rico, on Tuesday.Carlos Berríos Polanco/Sipa USA/APVoters receive their ballots at a polling place in Springfield, Pennsylvania, on Tuesday.Matt Slocum/APVoters stand in line outside a polling place in Phoenix on Tuesday morning.Matt York/APA cat named Skye looks on as ballots are cast in Pittsburgh on Tuesday.Quinn Glabicki/ReutersThe US Capitol is seen at sunrise on Tuesday.Jose Luis Magana/APA resident checks in to cast their ballot in Dixville Notch, New Hampshire, just after midnight on Tuesday. Trump and Harristied with three votes eachin the tiny New Hampshire township, kicking off Election Day.Joseph Prezioso/AFP/Getty ImagesElection workers prepare ballots in Denver on Monday, November 4.RJ Sangosti/The Denver Post/Getty ImagesA patron eats inside a restaurant near the White House that had plywood covering its windows on the eve of Election Day.Nathan Howard/ReutersElection workers move mail-in ballots at a processing center in City of Industry, California, on Monday.Robyn Beck/AFP/Getty ImagesA line for early voting stretches around a block in Des Moines, Iowa, on Monday. Some people said they waited more than two hours to cast their ballot.Zach Boyden-Holmes/The Register/USA Today Network/Imagn ImagesA man reads election materials before voting in Charlotte, North Carolina, on Saturday.Mike Stewart/APPeople vote at a polling station in Grand Rapids, Michigan, on Saturday.Carlos Osorio/ReutersVoters are reflected in a window Friday as they mark their ballots at City Hall in Providence, Rhode Island.Steven Senne/APPeople wait in line Friday to vote at Atlanta's High Museum of Art.Elijah Nouvelage/AFP/Getty ImagesVoters mark their ballots inside a mall in Henderson, Nevada, on Friday. It was the last day of early voting in the state.Ian Maule/Bloomberg/Getty ImagesA voter casts a ballot in the Bronx borough of New York during early voting on Friday.David Dee Delgado/AFP/Getty ImagesElection workers sort ballots during early voting in San Francisco on Thursday.David Paul Morris/Bloomberg/Getty ImagesFirst-time voter Kayria Hildebran holds her baby, Kayden, as she fills out her ballot in Cincinnati on Thursday.Carolyn Kaster/APA damaged ballot drop box is displayed during a news conference in Portland, Oregon, on October 28. Investigators in Oregon said they were looking for a man who is responsible forthree recent fires at ballot drop boxes. Hundreds of ballots were damaged.Jenny Kane/APPresident Joe Biden receives a sticker afterhe voted earlyin New Castle, Delaware, on October 28.Craig Hudson/ReutersNew Yorkers vote in the Mount Pisgah Baptist Church in Brooklyn on October 27.Bing Guan/The New York Times/ReduxA woman looks at a ballot while in line for early voting in New York on October 27.Bing Guan/The New York Times/ReduxA ballot box is transported while people vote in Kenosha, Wisconsin, on October 24.Scott Olson/Getty ImagesA voter casts a ballot on the first day of early voting in Miami on October 21.Lynne Sladky/APVoters wait in line as early voting begins in Wilmington, North Carolina, on October 17.Allison Joyce/Bloomberg/Getty ImagesPeople walk to a polling station in Atlanta on October 16.Megan Varner/ReutersVoter Scott Graham wears an early voting sticker after casting his ballot in Minneapolis on September 20.Adam Bettcher/APIn pictures: Trump wins back the presidencyPrevNextThere are deeper reasons for Democrats to despair. The party’s historic voter registration edge has all but evaporated by 2020, and now Republicans — fueled by migration to the state since the coronavirus pandemic — have the lead. The GOP has won every governor’s race since 1994, and gerrymandered districts have locked in its supermajority in both chambers of the state legislature.As it sheds its swing-state status, Florida could be on track to become the next Texas — poised for a generation of Republican dominance built on a coalition of older, non-college-educated voters, younger Hispanic voters, conservatives migrating from other states and more.Ohio, another traditional presidential battleground, is also now solidly in the red column. Trump was cruising to a double-digit victory there.This story has been updated with additional developments."}, {"source": "cnn", "title": "Harris concedes the election, but not ‘the fight that fueled this campaign’", "link": "https://www.cnn.com/2024/11/06/politics/harris-concedes-election/index.html", "content": "WashingtonCNN—Vice President Kamala Harris offered an uplifting, positive charge to her supporters as she conceded the 2024 presidential election, acknowledging the stinging loss while committing to a peaceful transfer of power and vowing to ‚Äúfight‚Äù in a much different way than a defeated presidential candidate promised four years ago.‚ÄúEarlier today, I spoke with President-elect (Donald) Trump and congratulated him on his victory. I also told him that we will help him and his team with their transition and that we will engage in a peaceful transfer of power,‚Äù she said in remarks at Howard University, her alma mater, in Washington, DC.In making the remarks, Harris did something her opponent refused to do in the aftermath of the 2020 election: Accept its results.‚ÄúA fundamental principle of American democracy is that when we lose an election, we accept the results. ‚Ä¶ At the same time, in our nation, we owe loyalty not to a president or a party, but to the Constitution of the United States, and loyalty to our conscience and to our God. My allegiance to all three is why I am here to say: While I concede this election, I do not concede the fight that fueled this campaign,‚Äù she said.One hundred and eight days after her campaign began, the self-described ‚Äújoyful warrior‚Äù spoke about her loss in determined terms as she sought to reassure the American people.‚ÄúI know folks are feeling and experiencing a range of emotions right now. I get it. But we must accept the results of this election,‚Äù she said.Closing a chapter in the history books after a tense campaign, the vice president offered a call to supporters to ‚Äúroll up our sleeves‚Äù in response to the election results.Supporters of Vice President Kamala Harris react following Harris' remarks, conceding 2024 U.S. presidential election to President-elect Donald Trump, at Howard University in Washington, DC, on November 6.Hannah McKay/Reuters‚ÄúDo not despair. This is not a time to throw up our hands. This is a time to roll up our sleeves. This is a time to organize, to mobilize, and to stay engaged for the sake of freedom and justice and the future that we all know we can build together,‚Äù she said in her 12-minute remarks.She vowed to wage that fight ‚Äúin the voting booth, in the courts, and in the public square,‚Äù as well as in ‚Äúquieter ways: By treating one another with kindness and respect ‚Ä¶ by always using our strength to lift people up.‚ÄùShe also sent messages to her more youthful supporters.‚ÄúTo the young people who are watching, it is okay to feel sad and disappointed, but please know it‚Äôs going to be OK. On the campaign, I would often say, ‚ÄòWhen we fight, we win.‚Äô But here‚Äôs the thing, here‚Äôs the thing, sometimes the fight takes a while. That doesn‚Äôt mean we won‚Äôt win. That doesn‚Äôt mean we won‚Äôt win,‚Äù she said.‚ÄúThe important thing is don‚Äôt ever give up. Don‚Äôt ever give up. Don‚Äôt ever stop trying to make the world a better place,‚Äù she continued. ‚ÄúYou have the capacity to do extraordinary good in the world.‚ÄùWith the glass ceiling still intact, Harris did not directly address the nation‚Äôs failure to reach the historic, barrier-breaking outcome of a female president for the second time, something she largely avoiding highlighting on the campaign trail, rather letting surrogates do the talking for her.But she offered a nod to the moment: ‚ÄúDon‚Äôt you ever listen when anyone tells you something is impossible because it has never been done before.‚ÄùThe speech marked a conclusion to a historic and tumultuous election season that included President Joe Biden‚Äôs decision to step aside following a catastrophic debate performance. His running mate quickly consolidated the party‚Äôs support, ascending to the top of the Democratic ticket.Harris wore a dark suit late Wednesday afternoon and walked out to Beyonc√©‚Äôs up-tempo anthem, ‚ÄúFreedom,‚Äù as she has throughout her time on the campaign trail, pausing for several moments as the crowd applauded her.Her running mate, Minnesota Gov. Tim Walz, could be seen crying, as well as multiple attendees standing in the front row before her.Vice President Kamala Harris and second gentleman Doug Emhoff at Howard University in Washington, DC, on Wednesday, November 6, 2024.Austin Steele/CNNHarris had gathered with close family and aides at the Naval Observatory on Tuesday evening and did not appear at her campaign‚Äôs watch party at Howard University as thousands of her supporters gathered at her alma mater to watch the results come in.She officially conceded the race earlier Wednesday afternoon, offering her congratulations to Trump in a call that lasted only a few minutes, a person familiar said.Harris, a senior aide said, ‚Äúdiscussed the importance of a peaceful transfer of power and being a president for all Americans.‚ÄùIn a twist of irony, Harris‚Äô day job will soon require her to officially certify her own loss.The vice president, as president of the Senate, ‚Äúpresides over the count and announces the results of the Electoral College vote‚Äù on January 6, 2025,according tothe National Archives."}, {"source": "cnn", "title": "Where Harris’ campaign went wrong", "link": "https://www.cnn.com/2024/11/06/politics/harris-campaign-went-wrong/index.html", "content": "CNN—It was supposed to be everything short of a free ad – a panel of women not containing their excitement to welcome Kamala Harris, ready to introduce her to their committed daytime audience of exactly the type of women the vice president’s campaign always hoped were going to be critical to her base.It was a momentthat encapsulated one of the biggest challenges facing her campaign – which, in the end,proved insurmountable.“What, if anything, would you have done something differently than President Biden during the past four years?” co-host of ABC’s “The View” Sunny Hostin asked Harris, looking to give her a set for her to spike over the net.Former first lady Melania Trump, former President Donald Trump and Barron Trump at the Palm Beach County Convention Center in West Palm Beach, Florida, on Wednesday, November 6.Will Lanzoni/CNNRelated articleTrump will win second term, CNN projects, in historic comeback after losing four years ago“There is not a thing that comes to mind,” she said.Even Harris realized she had a problem, trying to adjust a moment later by saying she would put a Republican in her Cabinet.Aides didn’t wait until Harris was off the set to start trying to clean it up. A Democrat who had spoken with her told CNN at the time that she didn’t want to name her differences with PresidentJoe Biden– including a higher capital gains tax rate, a bigger child tax credit and a tougher border policy – because she thought it would look disloyal to the man who had picked her as his running mate and then stepped aside for her.The thud fell in a campaign already struggling with a listless October, which had replaced thelate summer exuberanceand aSeptember debatethat nearly every political observer other thanDonald Trumpacknowledged she crushed. As aides new to the Harris orbit exerted control, she struggled with preparation. She grew hesitant, losing some of the confidence and swagger that had defined the early weeks of her reintroduction to the country. Aides who had successfully pushed her out of her comfort zone earlier in the year felt like they were running into the kind of walls she used to put up.CNN spoke with over a dozen senior Harris campaign aides both in the Wilmington, Delaware, campaign headquarters and on the ground in the states, as well as multiple volunteers and local elected officials, over the course of the final weeks of the race.A country crying out for change got a candidate who, at a crucial moment as more voters were tuning in, decided to soft-pedal the change she knew she represented.In the scope of a Democratic ticket that pulled off the biggest turnaround in approval ratings and the fastest consolidation around a new candidate in the history of modern presidential politics, this may have seemed like a minor moment. But it reflected deeper problems: some, like with the staff around her, that she might have been able to adjust; and one, with Biden, that she could never shake, with internal polls showing overwhelming majorities of voters thought the country was on the wrong track.Vice President Kamala Harris makes her way to board Air Force Two before departing Dane County Regional Airport in Madison, Wisconsin on September 20.Mandel Ngan/AFP/Getty ImagesBy the time Harris got a clearer, sharper contrast answer out on the Biden question, the situation had congealed in ways she never got past – both among voters wavering in the center who wanted to hear her rebuff the president on his handling of the economy and voters on the left who wanted to hear her more forcefully disavow Biden’s support for Israel.But perhaps the bigger problem with Biden, top Democrats fumed in the aftermath of thatfateful debate in Juneand then again as they watched the results turn red on Tuesday, is that he should have never been anywhere near the 2024 race. If he had stepped aside after the midterms, as some aides urged him to, the Democratic Party process could have played out in a primary campaign. Candidates’ kinks could have been worked out – or not. Almost certainly whoever emerged as the nominee would have gone into the final weeks without so many Americans complaining they didn’t know enough, as they said about Harris. Biden could have taken on a role as steward and elder statesman, rather than a guy the Harris campaign never knew quite what do with.Late surge of optimism crashesIf the election had been two weeks ago, senior aides to Harris were admitting in recent days, the vice president probably would have lost. But they went into Tuesday feeling like she had gotten herself to a likely squeaker victory. One-on-one conversations volunteers were having as they knocked on doors seemed to be clicking. For the first time in his nine years dominating American politics, Trump’s character seemed to be breaking through as an actual weight on people who wanted to vote for him.Former President Donald Trump appears in court with his lawyers Todd Blanche, Emil Bove and Susan Necheles for his hush money trial at Manhattan Criminal Court on May 28 in New York City.Spencer Platt/Getty ImagesRelated articleWhat happens to Trump’s criminal and civil cases now that he’s been reelectedLeading Democrats smiled just thinking about what it would mean to beat Trump with the first female president — a woman of color, a child of two immigrants, a prosecutor, and a candidate who talked about joy and offered up her smile against the scowl that had become his most common expression. Her candidacy sparked in them the unfamiliar feeling of hope.That sentiment evaporated by 11 p.m. on Tuesday. But for many anxious Democrats, this is just the beginning. Going into Election Day, many top Democratic operatives across the campaign and in the states told CNN different versions of the same thought: If this didn’t work – with the massive campaign they’d put together, with millions of doors knocked by volunteers who flooded into battleground states, withGOP former Rep. Liz Cheneyand formerPresident Bill Clintonunited under the same tent stumping hard for her,with celebritiesfrom Bad Bunny and Arnold Schwarzenegger throwing their cultural weight behind her – what will?Former President Donald Trump appears with his wife, Melania, and son Barron on stage at his election night watch party in West Palm Beach, Florida, on November 6.Will Lanzoni/CNNVice President Kamala Harris deliversher concession speechon November 6 at Howard University in Washington, DC. “The outcome of this election is not what we wanted, not what we fought for, not what we voted for,\" she said. \"But hear me when I say: The light of America’s promise will always burn bright.\"Austin Steele/CNNTrump supporters cheer at his election night watch party in West Palm Beach.Will Lanzoni/CNNVoters cast their ballots at a mall in Las Vegas on Election Day.David Becker/Getty ImagesHarris supporters watch election results come in at Howard University in Washington, DC.Austin Steele/CNNTrump speaks at an Election Day rally in Grand Rapids, Michigan.Scott Olson/Getty ImagesA resident checks in to cast their ballot in Dixville Notch, New Hampshire, just after midnight on Election Day. Harristied with three votes eachin the tiny New Hampshire township.Joseph Prezioso/AFP/Getty ImagesHarris takes the stage during a rally in Philadelphia on November 4.Hannah Beier/Bloomberg/Getty ImagesAn advertisement for Harris is displayed on the Sphere in Las Vegas on November 4.John Locher/APTrump dances on stage after speaking at a campaign rally in Pittsburgh on November 4.Charly Triballeau/AFP/Getty ImagesElection workers prepare to process mail-in ballots in City of Industry, California, on November 4.Robyn Beck/AFP/Getty ImagesHarris shares a laugh with second gentleman Doug Emhoff after reuniting aboard Air Force Two on November 4. They had just taken off from Pittsburgh for her final campaign rally in Philadelphia.Jacquelyn Martin/AP/PoolTrump speaks during a campaign rally in Macon, Georgia, on November 3.Elijah Nouvelage/AFP/Getty ImagesHarris makesa surprise appearanceon \"Saturday Night Live\" on November 2. “You got this,” Harris told her “SNL” alter ego, played by Maya Rudolph.Chary Triballeau/AFP/Getty ImagesSupporters cheer on Trump as he arrives for a campaign rally in Gastonia, North Carolina, on November 2.Chip Somodevilla/Getty ImagesElection workers sort ballots during early voting in San Francisco on October 31.David Paul Morris/Bloomberg/Getty ImagesAreli Sanchez holds a Puerto Rican flag during a Harris campaign rally in North Las Vegas, Nevada, on October 31. Puerto Rico has been in the headlines since a comedian at a Trump rally made commentsassailing the US island territory,calling it a \"floating pile of garbage.\"Evelyn Hockstein/ReutersTrump speaks from a garbage truck in Green Bay, Wisconsin, on October 30.He was seizing on a garbled remark by President Joe Bidenthat seemed to insult Trump voters as “garbage.” Biden has personally denied calling Trump supporters “garbage,” saying his comment on a video call was misinterpreted. The White House, on cleanup duty, insisted the president was only talking about one person, the comedian who called Puerto Rico a “floating island of garbage” during a Trump rally.Doug Mills/The New York Times/ReduxHarris speaks from the Ellipse in Washington, DC, on October 29. The Harris-Walz campaign billed the speech asher \"closing argument\"one week before the election.Jim Bourg/ReduxBiden is handed an \"I Voted Early\" sticker after he cast his vote in New Castle, Delaware, on October 28.Craig Hudson/ReutersTrump speaks at acampaign rally at New York's Madison Square Gardenon October 27.Anna Moneymaker/Getty ImagesSinger Beyoncé embraces Harris at acampaign rally in Houstonon October 25.Marco Bello/ReutersTrump attends a rally in Tempe, Arizona, on October 24.Carlos Barria/ReutersHarris and former President Barack Obama walk and talk backstage before speaking at a campaign rally in Clarkston, Georgia, on October 24.Erin Schaff/The New York Times/ReduxHarris participates in a CNN town hall in Delaware County, Pennsylvania, on October 23. Harris took questionsfrom undecided and persuadable votersin the battleground state. Trumpwas invited to a CNN town hall but declined to participate.Rebecca Wright/CNNTrump supporters attend a campaign event in Duluth, Georgia, on October 23.Elijah Nouvelage/ReutersTrumpworks the drive-through lineas he visits a McDonald's restaurant in Feasterville-Trevose, Pennsylvania, on October 20.Win McNamee/Getty ImagesHarris is surprised by campaign staff with birthday decorations before Air Force Two departed from Atlanta on October 20. Harris just turned 60.Jacquelyn Martin/APVoters wait in line in Wilmington, North Carolina, during the first day of early voting there on October 17.Allison Joyce/Bloomberg/Getty ImagesHarris hugs a child after speaking at a campaign event in Washington Crossing, Pennsylvania, on October 16.Jacquelyn Martin/APTrump dances near South Dakota Gov. Kristi Noem at a town hall in Oaks, Pennsylvania, on October 14. Trump ended the town hall early butstayed on stage for more than 30 minutes as music played, occasionally making brief remarks between songs.Jabin Botsford/The Washington Post/Getty ImagesStaff members steam wrinkles out of the US flag that was being used as a backdrop for former President Obama, who would be campaigning for Harris in Pittsburgh on October 10.Ryan Collerd/AFP/Getty ImagesElon Musk jumps on stage as he joins Trump during acampaign rallyin Butler, Pennsylvania, on October 5. Trump was returning to the same venue where he narrowly survived anassassination attempt in July.Jim Watson/AFP/Getty ImagesHarris and former US Rep. Liz Cheney greet attendees during a Harris campaign event in Ripon, Wisconsin, on October 3. Cheney, a Republican,said she would be “proudly” casting her vote for Harris.Mark Schiefelbein/APRepublican JD Vance, left, and Democrat Tim Walz take part in avice presidential debateat the CBS Broadcast Center in New York on October 1. The matchup between Vance, the 40-year-old Ohio senator, and Walz, the 60-year-old Minnesota governor, took place in New York without a live audience.Al Drago/Bloomberg/Getty ImagesHarris shakes hands with media mogul Oprah Winfrey at a rally in Farmington Hills, Michigan, on September 19.Saul Loeb/AFP/Getty ImagesLaw enforcement officials work at the scene of the Trump International Golf Club in West Palm Beach, Florida, on September 17. The FBI was investigating what it said wasan apparent assassination attempton Trump — the second time in two months there’s been an apparent attempt on his life. Trump, who was playing golf at the time, was not harmed. A Secret Service agent spotted a rifle barrel with a scope sticking out of the fence of the golf course and “immediately engaged” with the person, firing shots at the man, Palm Beach County Sheriff Ric Bradshaw said.Lynne Sladky/APTrump speaks during a news conference in Rancho Palos Verdes, California, on September 13. Trump, the Republican Party’s presidential nominee, suggested he might change his mind about a second debate with Harris: “I did great with the debates, and I think they’ve answered everything. But maybe if I got in the right mood, I don’t know.”Jae C. Hong/APFrom left, Senate Majority Leader Chuck Schumer, Harris, President Joe Biden, former New York City Mayor Michael Bloomberg, Trump and Vance attend a ceremony in New Yorkmarking the 23rd anniversary of the September 11 attacks.Mike Segar/ReutersA countdown clock over debate moderators David Muir and Linsey Davis shows how much time Trump has left to answer a question during hispresidential debatewith Harris on September 10. The debate, which took place in Philadelphia, was the first time Trump and Harris had met.Michael Le Brecht II/ABC NewsCNN’s Dana Bash, right, interviews Harris and Walz in Savannah, Georgia, on August 29. It wasHarris’ first in-depth interview with a major media outletsince she became the Democratic nominee.Will Lanzoni/CNNTrump, left, greets Robert F. Kennedy Jr., at a campaign rally in Glendale, Arizona, on August 23. Kennedy had just suspended his independent campaign andthrew his support behind Trump.Adriana Zehbrauskas/The New York Times/ReduxAmara Ajagu watches Harris formally accept her party's presidential nomination at theDemocratic National Conventionin Chicago on August 22.Ajaguis one of Harris' young grandnieces. Harris is the first Black woman and first Asian American to lead a major-party ticket. If elected, she would be the first woman and Indian American president.Todd Heisler/The New York Times/ReduxOn the night of Harris' speech, many delegates at the Democratic National Conventionwore white, the color associated with the suffragette movement.Rebecca Wright/CNNWalz is joined by his daughter, Hope; his son, Gus; and his wife, Gwen, at the Democratic National Convention on August 21. Walz said accepting the vice presidential nomination was“the honor of my life.”Bernadette Tuazon/CNNA Trump supporter carries a Trump standup after a campaign rally in Asheboro, North Carolina, on August 21.Julia Nikhinson/APFormer President Barack Obama speaks at the Democratic National Convention on August 20.He told the crowd that he is “feeling hopeful”because Harris is ready to step into the White House. “This convention has always been pretty good to kids with funny names who believe in a country where anything is possible,” Obama said. “Because we have a chance to elect someone who has spent her entire life trying to give people the same chances America gave her.”Austin Steele/CNNHarris watches Walz speak as she sits backstage at their rally in Glendale, Arizona, on August 9.Erin Schaff/The New York Times/ReduxTrump arrives for a news conference at his Mar-a-Lago estate in Palm Beach, Florida, on August 8. It washis first news conference since the Democratic ticket was announced. Over about an hour, Trump fielded a variety of questions and swerved into familiar talking points.Doug Mills/The New York Times/ReduxHarris and Walz holdtheir first joint campaign rallyin Philadelphia on August 6.Brendan Smialowski/AFP/Getty ImagesRachel Scott, senior congressional correspondent for ABC News, looks away as Trump speaks during a Q&A session at the National Association of Black Journalists convention on July 31. Scott asked Trump why Black voters should trust him given his past racist comments about members of Congress and political rivals like Nikki Haley and Barack Obama.Trump called it a “very nasty question” and a “rude introduction.”Later in the session, Trump falsely claimed that Vice President Harris“happened to turn Black”a few years ago.Vincent Alban/ReutersPresident Joe Bidenaddresses the nationfrom the White House Oval Office on July 24, explaining his decision not to seek reelection. It’s the first time a one-term US president has dropped out of a reelection run in decades. \"I believe my record as president, my leadership in the world, my vision for America’s future all merited a second term,” said Biden,who had been fighting for his political lifeafter a disastrous debate performance in June. “But nothing, nothing can come in the way of saving our democracy. That includes personal ambition. So, I’ve decided the best way forward is to pass the torch to a new generation. It’s the best way to unite our nation.”Evan Vucci/APHarris, bottom left in the blue jacket, attendsher first campaign rallyin West Allis, Wisconsin, on July 23. The former US senator from California, who previously served as the state’s attorney general, was endorsed by Biden to be his successor.Kevin Mohatt/ReutersBiden wears a mask while returning to the White House on July 23. He tested positive for Covid-19 a few days before he dropped out of the race, and he spent the weekend at his beach house in Rehoboth Beach, Delaware. He was in Delaware when he announced his decision to drop out.Julia Nikhinson/APSenate Majority Leader Chuck Schumer, left, and House Minority Leader Hakeem Jeffries leave a news conference afterendorsing Harris for presidenton July 23. “Kamala Harris and her candidacy has excited and energized the House Democratic Caucus, the Democratic Party and the nation,” Jeffries said.J. Scott Applewhite/APTrump raises his fist during theRepublican National Conventionin Milwaukee on July 18. At the convention, Trump formally accepted his party’s presidential nomination for a third straight election. His keynote speech came five days afterhe survived an assassination attemptin Butler, Pennsylvania. “I stand before you in this arena only by the grace of almighty God,” he said.Will Lanzoni/CNNOhio Sen. JD Vance, Trump's running mate, is greeted by his wife, Usha, after his speech at the Republican National Convention on July 17.Vance was announced as Trump's vice presidential picktwo days earlier.Rebecca Wright/CNNPeople watch the Republican National Convention from inside the Fiserv Forum in Milwaukee on July 17.Bernadette Tuazon/CNNMarine One takes off from the South Lawn of the White House, taking Biden to Las Vegas on July 15. Biden traveled to Las Vegas for campaign stops, speeches and interviews. Up to this point, he had been adamant that he was staying in the presidential race despite a growing list of Democratic lawmakers calling for him to step aside.Samuel Corum/AFP/Getty ImagesBiden addresses the nation from the Roosevelt Room of the White House on July 14.In a speech from the Oval Office later than day, he called on the country to \"lower the temperature in our politics\" following the assassination attempt on Trump.Demetrius Freeman/The Washington Post/Getty ImagesTrump, with blood on his face, raises his fist to the crowd as he is helped by Secret Service agents at his campaign rally in Butler, Pennsylvania, on July 13. Trump’s right ear was struck by a bullet during anassassination attempt, according to law enforcement.The shooter was killed by the Secret Service, the agency said.The FBI identified the shooter as 20-year-old Thomas Matthew Crooks, and authorities told CNN that he was positioned on a building rooftop just outside the rally venue. One rally attendee, Corey Comperatore, was killed, and two others were critically injured.Evan Vucci/APBlood can be seen on Trump's face as he is covered by Secret Service agents immediately after gunshots rang out in Butler on July 13.Anna Moneymaker/Getty ImagesHarris speaks at the Essence Festival of Culture in New Orleans on July 6.She often defended Bidenin the weeks following his debate with Trump.Erin Schaff/The New York Times/ReduxA sign reading “Pass the torch, Joe” is held up at a campaign rally for Biden in Madison, Wisconsin, on July 5.Saul Loeb/AFP/Getty ImagesJournalists run across the Supreme Court plaza, carrying an opinion to a news correspondent, as the court handed down decisions in Washington, DC, on July 1.The court ruledthat Trump may claim immunity from criminal prosecution for some of the actions he took in the waning days of his presidency.Drew Angerer/AFP/Getty ImagesBiden talks on the phone as he heads to Camp David with his wife, Jill, and granddaughters Finnegan and Natalie on June 29. Following his debate with Trump, some Democratic officials said they wanted him to step aside from the 2024 race for the good of the party and the country.Haiyun Jiang/The New York Times/ReduxTrump holds a campaign rally in Chesapeake, Virginia, on June 28.Tom Brenner/The New York Times/ReduxTrump and Biden take part in theCNN presidential debateon June 27. It was the first time in history that a sitting US president faced a former president in a debate.Biden’s poor performanceset off alarm bells among top Democrats, leaving some to openly question whether he could stay atop the Democratic ticket.Will Lanzoni/CNNPeople watch the CNN presidential debate from Union Pub in Washington, DC.Tristen Rouse/CNNBiden appeared to struggle with his deliveryat multiple points during the debate. At 81, he is the oldest president in history, and he would have been 86 at the end of a second term. The debate offered a key test for the president to exhibit vigor and energy — andDemocratic sources reacting to the debate described emotions ranging from concern to straight-up panicabout Biden’s biggest vulnerability.Austin Steele/CNNSupporters of Trump hold up placards as they wait for him to speak at a rally in Philadelphia on June 22.Jim Watson/AFP/Getty ImagesTrump shakes hands with Senate Minority Leader Mitch McConnell as he meets with GOP lawmakers in Washington, DC, on June 13.Trump led House Republicans through a gripe-filled closed-door meeting, airing grievances about his legal and electoral challenges, attacking his critics in the room, and only briefly addressing policy matters like abortion and taxes, according to multiple GOP lawmakers in the room. It was Trump’s first time returning to the Capitol campus area since leaving office after the January 6, 2021, riot.Doug Mills/The New York Times/ReduxTrump leaves the Manhattan Criminal Court in New York afterhe was found guilty in his hush money trialon May 30. It was the first time in history that a former US president had beenconvicted of a felony. A jury found Trump guilty on 34 charges of falsifying business records. Prosecutors alleged that the former president engaged in a cover-up scheme to hide reimbursement payments made to his former attorney, Michael Cohen, who had paid hush money to adult film star Stormy Daniels to stop her from going public about a past affair with Trump before the 2016 presidential election. Trump has denied the affair.Justin Lane/Pool/Getty ImagesBiden delivers remarks at a campaign event in Philadelphia on May 29. Biden and Harris rolled out an initiative called Black Voters for Biden-Harris.Yuri Gripas/The New York Times/ReduxTrump attends a campaign event in Waukesha, Wisconsin, on May 1.Brian Snyder/ReutersTrump attends his hush money trial at the start of jury selection on April 15.Jabin Botsford/Pool/Getty ImagesFormer Presidents Barack Obama and Bill Clinton join Biden on stage fora campaign fundraising eventat New York's Radio City Music Hall on March 28.Brendan Smialowski/AFP/Getty ImagesHarris embraces Biden after a speech in Raleigh, North Carolina, on March 26.The rare joint appearancehighlighted the emphasis that the duo would place on health care, which they believe is a winning issue for Democrats ahead of November's election.Matt Kelley/APVinay Reddy, Biden's director of speechwriting, works at his laptop while White House economic advisor Lael Brainard talks on her phone outside a Mexican restaurant in Phoenix where Biden was holding a campaign event on March 19.Kevin Lamarque/ReutersTrump speaks during a rally in Dayton, Ohio, on March 16.Maddie McGarvey/The New York Times/ReduxBiden looks out at a crowd as he arrives to greet people during a campaign event in Saginaw, Michigan, on March 14.Maansi Srivastava/The New York Times/ReduxFormer South Carolina Gov. Nikki Haley walks off stage after announcing that she would besuspending her presidential campaignon March 6. Haley made the announcement after a series of losses on Super Tuesday, and it left Trump as the presumptive GOP nominee.Ruth Fremson/The New York Times/ReduxA volunteer holds a sign that says \"vote uncommitted\" outside of a polling station in Dearborn, Michigan, on February 27. Biden's victory in the Democratic primary came with a warning from progressives, young voters and Arab American Democratsin the form of an \"uncommitted\" protest vote: change course on Israel's approach to the war in Gaza or risk losing a significant chunk of support in what could be a decisive general election state.Nic Antaya/Bloomberg/Getty ImagesTrump arrives to speak at the Conservative Political Action Conference in National Harbor, Maryland, on February 24.Trump declared himself a \"proud political dissident\" at CPAC, telling a conservative gathering that his reelection would be \"liberation day\" for his supporters and \"judgment day\" for his political enemies.Alex Brandon/APSupporters of a write-in campaign for Biden gather for an election night watch party in Manchester, New Hampshire, on January 23. Biden was not among the 21 candidates listed on the ballot after New Hampshire defied the primary calendar set by the national Democratic Party. Despite not being on the ballot, Biden still won the primary.Hilary Swift/The New York Times/ReduxHaley speaks to supporters at her election night watch party in Concord, New Hampshire, on January 23. She said she would remain in the race after losing the primary there to Trump.Haiyun Jiang/Bloomberg/Getty ImagesKara Simard — with her 5-year-old daughter, Violet — casts a primary vote at a polling site in Manchester, New Hampshire, on January 23.David Goldman/APFrom left, first lady Jill Biden, President Biden, Harris and second gentleman Doug Emhoff attend a campaign event in Manassas, Virginia, on January 23.Evelyn Hockstein/ReutersTrump delivers remarks at a campaign rally in Manchester, New Hampshire, on January 20.Jabin Botsford/The Washington Post/Getty ImagesFlorida Gov. Ron DeSantis holds a town hall in Hampton, New Hampshire, on January 17. DeSantis edged out former Haley for a distant second-place finish in the Iowa Republican Caucuses, buthe dropped out of the raceahead of the New Hampshire primary.Will Lanzoni/CNNIsaac Hammond braves subzero temperatures to caucus in Malcolm, Iowa, on January 15.The caucuses were the coldest ever, with temperatures below zero across much of the state.Geoff Stellfox/The Gazette/APDeSantis and Haley take part in aCNN debatein Des Moines, Iowa, on January 10.Will Lanzoni/CNNIn pictures: A historic race for the White HousePrevNext“I can’t imagine, I can’t even get my mind around what it would be like if Donald Trump won, because he is telling us such dark and sinister things that he’s going to do, and I believe him,” Sen. Cory Booker told CNN after a campaign stop late Monday afternoon in Bucks County, Pennsylvania – one of the key swing districts in the crucial battleground state.The New Jersey Democrat said he had already warned his own staff about not giving up.“We need to get up the next morning and forge forward,” Booker said. “I told them how much I don’t like hearing people say, ‘Oh, if so-and-so wins, I’m going to go to Canada. That’s just not our history. We’ve seen really bad outcomes out of bad historical events in our country, and we’re here because of the resiliency, the toughness, the strength of our country — and people even in the worst of times dug in and tried to do the best for our country.”Simmering internal fights and a revealing pick in WalzHarris’ team would have gladly taken more time to introduce the vice president to the country, or to put together an operation, which, after the ticket switch in July, woke up every morning at campaign headquarters and in the states feeling behind on planning.But by the time the campaign pulled off its multi-state simultaneous rally across battleground states Monday evening – which ended with Lady Gaga singing her song “The Edge of Glory” and adding in, “I’m an American woman on the edge” on the steps of the Philadelphia Museum of Art – a nervous feeling of maybe having made a movement happen was spreading among Harris aides and top supporters.Those aides were a hodgepodge. Biden hadn’t just struggled as a candidate, but had failed to attract some top talent to his campaign because a generation of up-and-coming Democrats could never get excited about him. Harris tried to graft some of her own team onto them, even overlooking tensions between them from the early days of the Biden administration with campaign chair Jen O’Malley Dillon and keeping her in charge.Former President Donald Trump speaks at the Palm Beach County Convention Center in West Palm Beach, Florida, on November 6, 2024.Will Lanzoni/CNNRelated articleHere’s what Trump is proposing for the economyBut some of those who had been in Wilmington for a year before Harris became the candidate bucked at their new bosses. Alumni of Barack Obama – most prominently his 2008, campaign manager David Plouffe, but also many others who moved into state operations – tried to flex a sometimes dated but often more incisive sense of how to win voters.Along the way, multiple aides told CNN how much they were grinding on one another. But the mission to beat Trump and the short timeline to try to get there helped paper over a lot of the infighting that might have exploded in a longer campaign. It instead just raged behind the scenes as aides like Stephanie Cutter moved to exert dominance over defining how and what Harris said what she said.And those tensions manifested from almost the start of this short campaign, in the internal wrangling over who Harris should pick as her running mate. The case for Pennsylvania Gov. Josh Shapiro was strong, and not just because Harris’ brother-in-law Tony West was telling her they looked like the future of the Democratic Party together, and that the popular governor would make sure she won Pennsylvania. Right-wing media types weren’t the only ones who noticed how much Shapiro had made himself into an Obama clone, as much a Jewish guy from the Philadelphia suburbs could be: The Obama alumni suddenly rushing onto her campaign were pushing for Shapiro.Harrisliked Minnesota Gov. Tim Walz, though. She liked his line about Republicans being weird. She liked the way he came off as easy and unassuming. She liked the way they’d gotten along in their interview, including his very open stress that he would mess up in a debate with Trump’s running mate,Ohio Sen. JD Vance. And she liked the way Walz had been so deferential to however she would define the job for him.Walz campaigns the day before election day, in West Ellis, Wisconsin, on November 4.Vincent Alban/ReutersIn the end, Harris made a decision that simultaneously reflected her newfound confidence and her long-standing insecurity, solid with trusting her own instincts, fine with going against her family and against the Obama orbit, but also with no interest in having anyone who would possibly outshine her.Then, as top aides kept Harris away from interviews and unscripted moments for weeks longer than many on the campaign thought made sense, Walz was necessarily kept in a box too, so that he didn’t come off more accessible than she was.Tuesday morning, outside a canvas launch in northeast Philadelphia, Shapiro deflected a question about whether Pennsylvania — and the race — would have looked different had he been the choice.“I think she made a great pick in Tim Walz,” he said.Democrats try to make sense of gut punchBiden, most Democrats were confident going into Tuesday, would have never even been in contention. The president watched the results come in from the White House, making a few calls to local winning candidates back in Delaware. Some who spoke with him as he made the decision to drop out in July briefly lingered on what might have been – maybe he could have won by keeping his numbers even in counties where he ended up outperforming Harris, or if he’d lost anyway, at least it wouldn’t have put the burden on a Black woman. He said nothing publicly.Former President Donald Trump emerges to speak at the Palm Beach County Convention Center in West Palm Beach, Florida, on Wednesday, November 6, 2024.Will Lanzoni/CNNRelated articleTrump’s second term will look nothing like his firstHarris ran on positivity. She ran on inclusivity. She convinced a party full of insiders who had gone into the year ready to write her off for the 2028 Democratic nomination that they should go all in on her for 2024.At the beginning of the night Tuesday, when victory seemed just hours away, the people who came to what was supposed to be Harris’ celebration were dancing. A Howard University graduate seemed about to walk into history in the heart of her old HBCU campus. At one point, the camera found the student body president in the crowd and she blushed as she saw herself projected on the big screen. Anticipation mounted and cheers went out with every state called for Harris.Seconds after North Carolina was called for Trump, the audio was switched off the big screens and music blasted through the speakers to try to salvage the energy. Most kept staring silently at the numbers, trying to make sense of what had happened.Attendees react to election results at Howard University in Washington, DC, on Tuesday, November 5.Austin Steele/CNNIn state capitals with Democratic governors, break-glass plans that they had started to believe they would never need are getting yanked off the shelves – to protect access to abortion medications, but also to work up other protections from what they believe will be not just a stringent, but vindictive, administration. Early thoughts about who will be running and how in 2028 are starting to circulate.That was not on the minds of the people who started streaming out of the Howard campus early Wednesday before campaign co-chair Cedric Richmond had even finished telling them that there was still counting to be done.“We try to do it right, we try to be good Christians,” one woman said to the man walking with her. “We’ve got to take a page out of their book.”"}, {"source": "cnn", "title": "Trump thinks presidents have near-total power: there will be little to stop him in his second term", "link": "https://www.cnn.com/2024/11/07/politics/trump-total-power-second-term-analysis/index.html", "content": "CNN—Donald Trumpbelieves presidents have almost absolute power. In his second term, there will be few political or legal restraints to check him.The president-elect’ssweeping victoryover Vice President Kamala Harris suddenly turned the theoretical notion that he will indulge his autocratic instincts into a genuine possibility.When Trump returns to the White House in January as one of the most powerful presidents in history, he’ll be able to take advantage of his own filleting of guardrails during his first presidency, which he continued through legal maneuverings out of office.Republican presidential nominee, former U.S. President Donald Trump arrives to speak during an election night event at the Palm Beach Convention Center on November 06, 2024 in West Palm Beach, Florida.Chip Somodevilla/Getty ImagesRelated articleTrump’s allies are already jockeying for high-powered spots in his administrationIt’s not guaranteed that just because Trump has massive power he will spurn constitutional checks and balances. His past behavior doesn’t have to predict the future. But the lesson of Trump’s business and political careers is that he seeks to obliterate all constraints.He has, for instance, crushed opposition in the Republican Party and driven out political heretics who oppose his “Make America Great Again” creed. This will be increasingly significant since the GOP has already flipped the Senate and still hopes to complete a monopoly on Washington power by keeping the House, which CNN has not yet projected.No other president has come into office armed with a Supreme Court ruling that grants significant immunity to presidents for official acts. The decision, a direct result of Trump’s effort to challenge his federal indictment for 2020 election meddling, is limited — but he is certain to take an expansive view of its meaning. The ruling emerged from a conservative court majority fashioned by Trump in his first term and that many legal observers now see as a rubber stamp on future power grabs.A mandatePerhaps most significantly, Trump can claim democratic legitimacy for what is already shaping up as the most intemperate presidency of the modern era, after increasing his vote share across multiple demographics. “Everybody knew this when they voted yesterday. So yes, the American people voted for basically this unchecked power that the president is going to have,” said former Republican Rep. Adam Kinzinger, who alienated himself from his party by standing up to Trump following the January 6, 2021, attack on the US Capitol.Former President Donald Trump poses for a photo with CNN and Warner Bros. Discovery in Atlanta on June 27.John Nowak/CNNRelated articleHow Donald Trump completed a historic political comebackTrump tried to destroy democracy to stay in power after the 2020 election. Four years later, he presented his platform to voters and won an Electoral College majority. He may also bolster his legitimacy by becoming the first Republican president to win the popular vote since 2004.“America has given us an unprecedented and powerful mandate,” the former and future president said at his Mar-a-Lago victory party early Wednesday.Trump has denied that he wants autocratic power, saying his claim he’d be a dictator on day one is a joke and that he is instead the savior of democracy.Yet millions of Americans chose Trump after his extreme closing argument in which he proposed the biggest deportation operation in US history, mused about using the military against “enemies from within” and vowed to prosecute political opponents and expel Haitian refugees in Ohio who are legally in the country and whom he falsely accused of eating people’s pets.Ignoring legal attempts to hold him to accountTrump’s willingness to wield unchecked executive power will not only be facilitated by his interpretation of the Supreme Court ruling on immunity. He has already subverted constraints on presidential authority. His two impeachments — over trying to coerce Ukraine with aid and the Capitol insurrection – didn’t rein in his impulses. And the Republicans’ refusal to convict him in the Senate showed the toothlessness of this crucial constitutional remedy when a political party has chosen to appease an extreme president in return for power.In Trump’s first term, some Republicans sometimes hampered his agenda. The late Arizona Sen. John McCain, for instance, thwarted an attempt to overturn key provisions of the Affordable Care Act with his thumbs down vote. But Trump ally Rep. Marjorie Taylor Greene warned Wednesday that dissent would not be tolerated from GOP members. “I will not let them and neither will the American people who have given us this amazing opportunity to save this country,” the Georgia Republican posted on X.Former President Donald Trump appears in court with his lawyers Todd Blanche, Emil Bove and Susan Necheles for his hush money trial at Manhattan Criminal Court on May 28 in New York City.Spencer Platt/Getty ImagesRelated articleWhat happens to Trump’s criminal and civil cases now that he’s been reelectedKinzinger scoffed at the idea that a GOP Congress would temper Trump. “On paper, it’s a real thing, in practice no,” the former Illinois lawmaker told CNN’s Dana Bash Wednesday. “There is no chance, 0.0% chance, that Donald Trump says something and Republicans in the House buck him anymore.”Trump, by winning back the Oval Office, has also evaded the constraints of the law. So, in addition to having the Supreme Court’s immunity ruling in his back pocket, why would he be cowed by the possibility of future legal action against him?Within hours of election night. Special counsel Jack Smith was already talking with the Justice Department about ending two federal prosecutions against Trump — over his efforts to subvert the 2020 election and his hoarding of classified documents — in line with Office of Legal Counsel curbs on prosecutions of sitting presidents. A state election meddling case in Georgia is now imperiled. And huge doubts also hang over the pending sentencing of Trump after a conviction in a hush money case in New York.Video Ad Feedback'An astonishing result': Elie Honig reacts to Jack Smith potentially ending Trump cases02:04- Source:CNN‘The danger is very real’The scope for Trump to stretch historic interpretations of his executive power is immense.“The danger is very real,” said Corey Brettschneider, professor of politics at Brown University, and author of the book “The Presidents and the People: Five leaders who Threatened Democracy and the Citizens who Fought to Defend it.” Brettschneider cited Revolutionary War hero Patrick Henry’s disquiet about the possibility that the office of the presidency was so powerful that an incumbent with authoritarian ambitions could ascend an “American throne.” While the founders modeled the presidency on the persona of George Washington, Brettschneider explained that Henry proposed this hypothetical: “What if a bad person gets in that office or even a criminal president? And his point is, you know, these supposed checks, because they assume a virtuous person, they’re pretty weak.” Now that America has a convicted felon as its president-elect — and one who has massive ambitions for his own power — that’s no longer a hypothetical.Trump has plenty of models for his second term. He has frequently praised foreign autocrats like Russian President Vladimir Putin and China’s Xi Jinping, who face no democratic accountability. He admires the rule of his friend, Hungarian Prime Minister Viktor Orbán, who has eroded institutions of accountability, including government departments, the court system and the press. “Some people don’t like him because he’s too strong. It’s good to have a strong man at the head of a country,” Trump reflected at a rally in New Hampshire in January.Trump’s conception of the presidency was encapsulated by his statement in July 2019 that the Constitution gave him untamed power. “I have an Article II, where I have to the right to do whatever I want as president,” he said.  Article II lays out the duties of the presidency — but it does not, in conventional interpretations, at least, suggest blanket executive authority.Trump’s attitude moved then-federal Judge Ketanji Brown Jackson to remark in a 2019 ruling, which ordered compliance by former White House counsel Don McGahn with a congressional subpoena, that “the primary takeaway from the past 250 years of recorded American history is that Presidents are not kings.”It will take time to rein in TrumpSo, are there any constraints?The greatest inhibition to presidential overreach is the sitting president himself, who can chose to remain within bounds of accepted executive action. But self-restraint is a concept alien to Trump. This is not just a personal trait. Such conduct is endemic to his political appeal — and he was just elected by millions of voters who endorsed his promise to eviscerate a governing system that they believe has failed them. In the past, Trump has sometimes been loath to take steps that might make him politically unpopular — yet he will take office knowing he does not have to appeal to voters ever again since he’s in his second term.The most effective clamp on Trump’s future power would be a Democratic House majority, which could challenge the new White House with the power of oversight — even if Trump has already mocked the ultimate sanction of impeachment. But with races still outstanding, Republicans are closer to the 218 seats needed for the majority than Democrats.Then there are the courts. Activist groups are sure to lodge cases against Trump’s immigration moves, as happened over his ban on travelers from certain Muslim nations in his first term. Such maneuvers can tie up a president for months — although the scores of Trump-appointed judges and the conservative Supreme Court majority may give the administration reprieves.Attempts to prosecute Trump’s political foes on spurious grounds, meanwhile, could theoretically see mass resignations of Justice Department staff. This is one reason why the new administration may roll out plans to sack entire echelons of the civil service to ensure total loyalty to the new president. And the former president is unlikely to make his first-term mistake of appointing officials who confront him – like former chief of staff John Kelly and former Defense Secretary Mark Esper.Brettschneider argues in his book published this year that an authoritarian president would not present a hopeless situation for US democracy. He examines five commanders in chief who threatened democracy and shows how they spawned protest movements, citizen activism and eventually democratic victories that created restorative presidencies.Still, such responses can’t often halt presidential acts in their commission, meaning that the fate of the country and its democracy often hinges on the president himself. The founders were “sitting there in the Constitutional Convention and looking at Washington, and they thought to themselves, ‘this is a person of virtue. That’s who they had as a model in mind,’” Brettschneider said. “When you have somebody who’s not a model of virtue, they can really wreak havoc.”Video Ad FeedbackRubio says Trump has fundamentally remade the Republican Party.02:17- Source:CNN"}, {"source": "cnn", "title": "Trump’s master plan for a radical reformation of the US government", "link": "https://www.cnn.com/2024/11/07/politics/donald-trump-government-what-matters/index.html", "content": "A version of this story appeared in CNN’s What Matters newsletter. To get it in your inbox, sign up for freehere.﻿CNN—President-elect Donald Trump has promised to completely remake the US government and wield new power as president.The ambitious promises, if enacted, would transform society. Some of hismost-repeated promises on the campaign trailinclude:Mass deportation of 11 millionundocumented immigrantsClosing the southern border and ending birthright citizenshipUnprecedentedtariffs on foreign goodsfrom all countries, but especially ChinaExpansivetax cutsto benefit corporations, tipped workers, seniors on Social Security, property owners in the Northeast and many othersTrillions in cuts in government spending withhelp from Elon MuskReforming the country’s health and food systems withhelp from vaccine skeptic Robert F. Kennedy Jr.Reversing regulations aimed at addressingclimate changeBuilding a new missile defense shield withhelp from former NFL player Herschel WalkerAnd so much moreNow Americans will find out what was hyperbole and what was real – what is achievable and what he will be able to push through by himself, with help from Congress and without interference by the courts.His pledge to endRussia’s war on Ukraine“in 24 hours,” for example, seems overwrought, to say the least.His pledge for a mass deportation effort, on the other hand, is very serious. It seems to be backed up by some clear planning but there’s a lack of public details.Is there a master plan?During the campaign, Trump tried to distance himself from Project 2025, the controversial and detailed blueprint for a newly reimagined federal government published by conservatives at the Heritage Foundation in anticipation of a second Trump term.While Trump may not want to associate with that plan, it was formulated by his allies –at least 140 people associated with Project 2025worked in Trump’s administration, according to a review by CNN’s Steve Contorno. Certainly there is some overlap between much of what the 900-page Project 2025 proposes and what Trump has said he will do in a series of very simple “Agenda47” videos on his website laying out his plans for a second term.In one Agenda47 video, for instance, Trump promises tohave an executive orderprepared to end birthright citizenship for the children of undocumented immigrants. The14th Amendmentguarantees birthright citizenship, so expect court fights if this happens.One of the policy maestros of Protect 2025, Russell Vought – who served as the director of the Office of Management and Budget during Trump’s first term – wascaptured on hidden camera by undercover journalistsover the summer talking about an aggressive agenda he was writing to get Trump’s new administration off to an active start in its first 180 days.On mass deportationsTrump’s most aggressive promise is the rounding up and deportation of millions of undocumented immigrants. Expect Trump to come into office with a series of executive orders already written to reinstate border policies unwound by the Biden administration.Such is the yo-yoing of US immigration policy given that Congress has been unable to pass meaningful reform for decades. What’s not clear is how exactly Trump will go about closing the US border and whether it will include the US military, the National Guard or local law enforcement agencies.Trump’s adviser Stephen Miller said on Fox News to expect deportations to begin the moment Trump is again president on January 20, 2025.CNNRelated REPORTINGAmerica’s red shift: See the counties where Trump boosted his share of the vote“They begin on Inauguration Day, as soon as he takes the oath of office,” he said.But it’s still not clear exactly how deportations will work. Rep. Carlos Gimenez, a Florida Republican, told CNN’s Pamela Brown on Thursday that he expects every undocumented immigrant will continue to get a hearing before he or she is deported, something that will require the hiring of a large number of additional government workers if deportations are amplified to a massive scale. The current process is lengthy.“I agree; it’s going to be a very, very big task,” Gimenez said. “And my hope is, and I expect, that we’ll just simply follow the law.”CNN’s Priscilla Alvarez reported there have already been discussions among Trump allies and some in the private sector to detain and deport migrants at a large scale – though any operation would come with a big price tag.She noted that Tom Homan, who was acting director of Immigration and Customs Enforcement during Trump’s first term, has said a deportation effort would start with anyone accused of a crime. It’s not clear what would happen to so-called Dreamers, people brought to the US as children who have lived most of their lives here. Some of them are protected by an Obama-era program, Deferred Action for Childhood Arrivals, that Trump tried unsuccessfully to end during his first term.Video Ad FeedbackEx-ICE official warns about Trump's mass deportation plan02:05- Source:CNNPlans to ‘aggressively’ fire government workers and move agencies out of DCAt the end of his first term, Trump planned to reclassify a large portion of the federal civilian workforce to make it easier to fire federal workers. Commonly referred to as “Schedule F,” Trump’s plan was to undo long-standing protections for nonpartisan civil servants.The Biden administration has put some roadblocks in place to ward against such reclassification, but Trump promises in an Agenda47 video to immediately begin working to reinstate it so that he can “remove rogue bureaucrats.” He says he will also “clean out all of the corrupt actors” in the national security and intelligence apparatus and “immediately” move federal agencies out of the nation’s capital.John McEntee, who was director of the White House Presidential Personnel Office during Trump’s first administration, worked on Project 2025, building a list of Trump loyalists suitable for administration roles. He remains close to Trump, according toCNN’s report on Trump’s transition.McEnteesaid recentlyhe wasn’t involved with the policy recommendations in Project 2025, even though he said, “I agree with probably most of it.” Instead, he’s interested in “staffing the president with good people … I think he deserves that.”What about Trump’s Cabinet?Trump likes to associate himself and his programs with boldface names. Musk will have a role in government efficiency but probably not a Cabinet position. Kennedy says he wants to give individuals more agency to reject vaccines for their children, but perhaps that does not mean he will have a Cabinet position. Does Trump’s promise at a rally in Georgia to put Walker in charge of a missile defense program mean an official government job for the failed Senate candidate?Robert F. Kennedy Jr., former President Donald Trump and Elon MuskGetty ImagesRelated articleTrump’s plan to radically remake government with RFK Jr. and Elon Musk is coming into viewThere are 26 people in President Joe Biden’s Cabinet. Some, like CIA director or US ambassador to the United Nations, can be added or subtracted depending on the administration. Only two of the 26 potential positions in a Trump Cabinet are in place. Look for Trump to continue naming top officials in the coming days.In addition to Vice President-elect JD Vance, Trump’s first key personnel news came Thursday night when he announcedSusie Wiles, his campaign manager, would become his chief of staff. She’ll be the first woman to hold the position.Trump went through four such top aides during his previous administration. The longest-serving of those, retired Marine Gen.John Kelly, had warned against Trump’s election.Trump can simply hire a chief of staff, but most Cabinet positions, like secretaries of Defense and Homeland Security, will require Senate confirmation. Trump will have aRepublican majority in the Senate, which should ease the confirmation of key positions, but each of the ultimate Cabinet appointees will have a confirmation hearing before they get a vote.Frustrated by the difficulty of getting Cabinet officials confirmed during his first administration, Trump frequently appointed people as “acting” secretaries, although those appointments can only be made on a temporary basis.Trump’s oldest son, Donald Jr., said on Fox News that Trump will prize loyalty and look for “people who don’t think that they know better than the duly elected president of the United States.”Taking power away from CongressTrump won’t have the 60 votes he’ll need to shoot sweeping legislation quickly through Congress without bipartisan support in the Senate. It’s not yet clear if Republicans will hold control of the House, but any majority will be slim.One of his big plans to challenge current governing norms that’s gotten less attention is his pledge to seize some power over government spending from Congress. In one Agenda47 video, Trump says he would try to reassert the principle of “impoundment,” by which a president can reject spending instructions from Congress and use taxpayer money in other ways.Congress reined in presidents with a law after the Nixon administration, but Trump says he will challenge it and take more power for the president."}, {"source": "cnn", "title": "What just happened? It was the economy, stupid", "link": "https://www.cnn.com/2024/11/06/economy/economy-trump-reelection/index.html", "content": "CNN—Donald Trump’s decisive election victory was about many things: a global rejection of incumbents, a rise in the Republican electorate and a battle for the future of America’s democracy. But voters consistently and repeatedly said issue No. 1 this election was the economy.That explains a lot about why Trump was reelected.By several major metrics, the US economy ison fire, theenvy of the rest of the world. But Americansstill viewed it unfavorably, and a significant number of voters blame President Joe Biden and Trump’s opponent, Vice President Kamala Harris, for failing to make enough improvements to Americans’ financial situations over the past four years. Poll after poll suggested that Americans hold largely negative views about the US economy.That’s because economic sentiment doesn’t always match up nicely with data that shows the economy is adding jobs, consumer spending is growing and gross domestic product — the broadest measure of the economy — continues to boom. When you pay through the nose for a cup of coffee or when you can’t afford to buy a home, those data are meaningless: You feelshut out of the American Dream.Why the US economy stings so muchHousing:America’s home prices have reached new record highs for 15 straight months. That’s great news if you own a home — and not so great if you don’t, especially with mortgage rates remaining stubbornly high, just below 7%. That’s why a record low 2.5% of homes switched owners this year, thelowest in 30 years, according to Redfin.Rent isn’t offering much relief: About half of American rentersshelled out more than 30% of their incomeon rent in 2023. Households that spend more than 30% of their income on rent, mortgage payments or other housing costs are considered “cost-burdened” by the US Department of Housing and Urban Development.The housing affordability crisis has helped exacerbate America’s wealth gap, leaving people who are forced to move or don’t own a home in a financial bind. But many people who are hardly poor are also struggling to get by, largely because of how much it costs to live in a home: A fifth of US households that earn more than $150,000 a year are living paycheck to paycheck, according to aBank of America survey.Prices:Inflation is back to normal. But that doesn’t mean prices are falling — they’re just not rising at the alarming level they were a couple of years ago.Prices are roughly 20% higher now than they were when Biden took office, leaving Americans with a daily reminder of how much inflation stinks every time they go to the store. Gas prices have fallen dramatically over the past couple of years, sinking from a record average high of above $5 in 2022 to below $3 a gallon in many states now. That has helped, but not solved, the inflation problems many Americans continue to face on a daily basis.Politics:A lot of how you feel about the economy depends on your politics. And the number of registered Republicans in America is growing.A recent studyfrom the Brookings Institution, released last week, found a correlation between economic sentiment and political affiliation with the party in control of the White House. When Trump took office, Republican economic sentiment surged, while Democratic sentiment cratered. The opposite happened when Biden took office.But Republicans are three times more likely to think the economy is good when a Republican is in office than Democrats when a Democrat holds the White House — and the reverse is true, too.No, really, the US economy is greatStill, Trump will be inheriting a strong economy — on paper, anyway.Jobs:The biggest indicator of economic security is whether or not you have a job, and a historically high percentage of people do. Even though the unemployment rate has been ticking higher over the past year, at 4.1%, it remains at a very healthy level, rising incrementally from the lowest unemployment rate since the first moon landing.The US economy’s job-creation machine has slowed this year — particularly in recent months. Last month, the economy added just 12,000 jobs. Still, the economy is continuing to add a monthly average of 170,000 jobs this year, which is almost exactly the number the economy added during the first three years of the Trump administration, before Covid hit (175,000 jobs per month).Companies are still clamoring so much for workers that the number of job listings is greater than the number of American job seekers, according the US Bureau of Labor Statistics.GDP:The broadest measure of the US economy is booming.Gross domestic productgrew at a seasonally adjusted annualized rate of 2.8% last quarter, the Bureau of Economic Analysis reported Wednesday. That’s a healthy pace by any measure, and it’s on par with the economic expansion during the Trump administration, when people were feeling much better about the state of the economy.It has also made America’s economy the envy of the world: Projected US economic growth for this year remains the strongest of any of the G7 economies, according to the International Monetary Fund.Paychecks:Workers’ paychecks aren’t booming like they were a couple years ago when inflation was truly off the rails. But they’re still growing at a 3.9% adjusted rate, according to the Depart﻿ment of Labor. That’s still a faster clip than inflation, which means the amount of money Americans have to spend is growing.Inflation-adjusted disposable income per capita rose for the 27th straight month, according to the BEA, the longest streak on record.Consumerism:Despite polls to the contrary, consumers are acting like the economy is great. Consumer spending, which accounts for more than two-thirds of America’s economy, is surging, rising 3.7% last quarter, the highest rate of growth since the first quarter of 2023, according to the BEA.And consumerconfidence is on the rise, too — it surged in October by the largest amount in any survey since March 2021. Still, it remains well below where it was before the pandemic, during Trump’s first term."}, {"source": "cnn", "title": "Trump’s return to power raises serious questions about the media’s credibility", "link": "https://www.cnn.com/2024/11/06/media/trump-reelection-media-credibility-trust/index.html", "content": "New YorkCNN—Donald Trump’s return to power is a hinge point for the American media – in ways big, small, and to be determined. His defeat of Kamala Harris is raising questions about the media’s credibility, influence, and audience. Some of the questions might not be answerable for years.But journalists are asking each other: What does this “red wave” election say about the information environment in the United States?In the hours after Trumpwon reelectionTuesday, some of his loyalists asserted that his victory is a complete repudiation of the news media. For a time on Wednesday morning, The Federalist’s lead headline was not about Trump, it was about the “corporate media industrial complex” being “2024’s biggest loser.”Legacy media “is officially dead,” The Daily Wire podcaster Matt Walsh wrote on X overnight. “Their ability to set the narrative has been destroyed. Trump declared war on the media in 2016. Tonight he vanquished them completely. They will never be relevant again.”That’s wishful thinking on Walsh’s part — Tuesday’s marathon election coverage was a testament to the media’s relevance — but the point is that many Trump voters share his wish. They believe the national news media is a big part of what ails America. Not only do they distrust what they read, they often don’t read it in the first place. Can anything be done to change that?A quote in a recent New Yorkmagazine columnchanneled that question. The quote, from an anonymous TV executive, was recirculated on social media Wednesday morning. “If half the country has decided that Trump is qualified to be president, that means they’re not reading any of this media, and we’ve lost this audience completely,” the executive said. “A Trump victory means mainstream media is dead in its current form. And the question is what does it look like after.”Donald Trump speaks during a campaign rally in Grand Rapids, Michigan on November 5, 2024.Kamil Krzaczynski/AFP/Getty ImagesRelated articleTrump campaign denies and revokes journalists’ election night credentials after critical coverage“Dead” is gross hyperbole, of course, but the comment reflected real concerns that many members of the media have. A severe trust deficit exists between the Trump base and big institutional media outlets. In a text message, a Trump campaign aide suggested that the press should show more humility.That raises another question: Do major networks and publications have enough columnists and commentators who reflect the Trump majority’s views?“Maybe we have a point,” the aide remarked. “Maybe ‘misinformation’ is a lazy word that was never applied to press coverage of Biden’s health or the border. Maybe ‘offensive’ things aren’t offensive to most.”The mainstream media “has held less clout every four years,” Semafor’s Dave Weigelwrote Wednesdaymorning. “On Harris-friendly cable news, ex-Republicans broadcast their horror at who Trump was and what he’d done; in the new social media and podcasts favored by Republicans, all of that was whining disconnected from what voters really cared about.”CNN political commentator Scott Jennings hit that point hard during the 3 a.m. hour of CNN’s election coverage. He said Trump’s win was “something of an indictment of the political information complex.”“We have been sitting around for the last couple weeks and the story that was portrayed was not true,” Jennings said. “We were told Puerto Rico was going to change the election. Liz Cheney, Nikki Haley voters, women lying to their husbands. Before that it was Tim Walz and the camo hats. Night after night after night we were told all these things and gimmicks were going to somehow push Harris over the line. And we were just ignoring the fundamentals. Inflation; people feeling like they are barely able to tread water at best; those were the fundamentals of the election.”Jennings added: “I think for all of us who cover elections and talk about elections and do this on a day-to-day basis, we have to figure out how to understand talk to and listen to the half of the country that rose up tonight and said, ‘We have had enough.’”Liberal commentator Ashley Allison responded: “I think we have to listen to everybody, actually.” She said, “the people who voted for Kamala Harris are struggling too. They are feeling ignored too. A Republican’s pain is no greater or less than a Democrat’s pain.”What lies ahead for the pressIf history is any guide, Trump is never, ever satisfied with news coverage. He always wants a more pliant, propagandistic media. He even complains about Fox News on a regular basis, despite the network’s overwhelming support for him. Last month, he complained to Fox patriarch Rupert Murdoch about the network airing Democratic ads.Thus, Trump’s reelection portends a new period of hostility with major media outlets that strive for impartiality as well as partisan outlets that oppose him. This raises another set of questions.Will the Trump administration turn his words against the press into actions? Will he move to revoke licenses for TV stations, as he has suggested more than a dozen times this year? Will he limit press access to the White House, barring reporters he doesn’t like?Further, will media outlets engage in self-censoring to appease Trump, and if so, how will readers and viewers who oppose Trump react?On Wednesday morning, newsroom leaders and owners are reassuring employees that they will have their backs in the uncertain months to come. “Now, more than ever, we are steadfast in our mission to uphold the principles of independent journalism,” Conde Nast chief Roger Lynch wrotein a memoto staffers. “A thriving, independent press, as protected by the First Amendment, is vital to democracy and the future we all share.”"}, {"source": "cnn", "title": "Trump’s win was real but not a landslide. Here’s where it ranks", "link": "https://www.cnn.com/2024/11/09/politics/donald-trump-election-what-matters/index.html", "content": "A version of this story appeared in CNN’s What Matters newsletter. To get it in your inbox, sign up for freehere.CNN—Donald Trump can claim a lot out of his2024 election win:► It’s a comeback for the ages for a president to go from a pariah after trying to overturn one election to president-elect after the next.► A rightward shift in election results gives him a mandate to start trying toremake the US governmentlike he promised he would.► If Republicans win control of the US House of Representatives, he’ll have control of the entire US government to help him enact change.What Trump cannot claim is a landslide victory, although that’s how he will describe it.As of Saturday,Trump is winning the popular votewith a little more than 74.5 million votes, although millions of votes have yet to be counted in California, Washington and Utah, among others. The final 2024 popular vote tally likely won’t be known until December.CNNRelated articleAmerica’s red shift: See the counties where Trump boosted his share of the voteWhen he lost convincingly in 2020, Trump got a little more than 74 million votes. So while it’s true that much of the country moved to the right in this election, it’s also true that there was some voter apathy if, at the end of the day, turnout is down from 2020.That doesn’t mean this will end up being a low turnout election. The University of Florida Election Lab estimates as of Friday thatturnout in 2024will be about 62.3% of the voting-eligible population, down from the high-water mark of the modern era of more than66.4% in 2020but still above other recent elections. Turnout in 1996 and 2000 was not much over 50% of the voting-eligible population.In terms of the Electoral College, Trump won 312 electoral votes. It’s a solid win, but in the lower half of US presidential elections.It was a better showing than either his or Joe Biden’s 306 electoral votes in 2016 and 2020, respectively. It also outperformed both of George W. Bush’s electoral victories in 2000 and 2004. But it was far short of Barack Obama’s 365 electoral votes in 2008 and 332 in 2012.Bill Clinton never reached 50% in the popular vote because both of his presidential elections featured a strong third-party candidate in Ross Perot. But Clinton did run away with the Electoral College vote, winning 370 electoral votes in 1992 and 379 in 1996.Even those strong victories are dwarfed by Ronald Reagan’s 1984 win, a true landslide. Reagan lost only Washington, DC, and Minnesota, the home state of his Democratic rival, Walter Mondale, thereby securing 525 electoral votes and more than 58% of the popular vote.BothRichard Nixon in 1972andLyndon B. Johnson in 1964exceeded 60% in the popular vote for their reelection campaigns, something that seems impossible in today’s political climate. It’s also incredible to think that two such massive landslides would occur within eight years. Nixon’s reelection rival in 1972, then-Sen. George McGovern, lost even his home state of South Dakota and won only Massachusetts and Washington, DC.Voters were much more likely to split their tickets in those years. While Johnson, a Democrat, enjoyed a strong Democraticmajority in the Houseafter his 1964 landslide, voters who gave both Nixon and Reagan all but one state also checked them with a Democratic-controlled House.The more recent trend is for voters to align their votes for House, Senate and the White House. That trend has led to a period during which the White House and Congress change hands more frequently, although Democrats will keep Senate seats in multiple states won by Trump this year.Trump’s 2024 win marks the third straight presidential election in which voters have thrown out the incumbent party. The last time that happened in three straight elections was in the late 1800s whenGrover Clevelandbecame the first president to be elected to nonconsecutive terms. Trump is the second.Trump will never be on a presidential ballot again, because the 22nd Amendment limits presidents to two terms. But voters will get an opportunity to weigh in on how he and Republicans use their power in two years, during the 2026 midterm elections.The past three presidents, including Trump in his first term, all lost control of the House after their first two years in office. If Trump does end up with a friendly Republican majority this year, he’ll have to work hard to keep voters on his side two years from now.This story has been updated with additional developments."}, {"source": "cnn", "title": "The common national experience that explains Trump’s 2024 gains", "link": "https://www.cnn.com/2024/11/12/politics/trump-wide-gains-2024-analysis/index.html", "content": "CNN—The most impressive aspect ofDonald Trump‚Äôs victory over Vice President Kamala Harris last week was the uniformity of his gains across the electoral landscape.But paradoxically, the very magnitude of his gains may offer Democrats their best hope of recovery in the next few elections. The across-the-board nature of Trump‚Äôs improvement suggests that his victory wasn‚Äôt primarily driven by the two campaigns‚Äô tactical choices, messaging decisions or advertising strategies.Trump gained ground in urban, suburban and rural counties and improved on his vote share, as of the latest counts, in 49 of the 50 states.A preliminary CNN analysisconcluded that Trump ran better than he did in 2020 in fully 9 in 10 of the nation‚Äôs counties where results are available.Those sweeping gains document how much ground Democrats lost this year ‚Äî not only in places where they were bracing for further retreat (including both in rural communities and urban centers) but also the racially diverse, well-educated suburbs that had earlier keyed the resistance to Trump. Those losses leave Democrats in a weaker electoral position, in most respects, at the start of the second Trump presidency than at the outset of his first.But the scale of Trump‚Äôs advance this year points toward a common national experience in all regions of the country ‚Äî a shared disappointment in the results generated by PresidentJoe Biden‚Äôs administration, primarily on inflation, but secondarily around other issues led by immigration and crime. The evidence that the outcome was driven largely by a negative verdict on Biden‚Äôs performance underscores the possibility that Democrats could recover sooner than now seems possible if Americans one day conclude that Trump hasn‚Äôt delivered the better results he has promised.A flag is left at an event held by Vice President Kamala Harris at Howard University in Washington, DC, on November 6, 2024.Daniel Cole/ReutersRelated articleStill-stunned Democrats begin to squint toward their futureThe consistency of the Democratic decline this year ‚Äúreflects a very broad sense of discontent across many different demographic groups, across every major population group, with the direction of the country under Biden,‚Äù said Emory University political scientist Alan Abramowitz. Trump and the GOP, he said, face the same risk of reversal if the president-elect pursues some of the policies that voters remained uneasy about even as they voted for him ‚Äî especially if he can‚Äôt ease the cost-of-living squeeze that drove much of this year‚Äôs result.Experts agree that factors beyond disappointment in the Biden administration‚Äôs outcomes also influenced the results. These ranged from a widening cultural gap between Democrats and Latinos, especially men, to continuing resistance among some voters to entrusting the presidency to a woman, to the GOP‚Äôs successful efforts to portray Harris as an extremist cultural liberal largely through attacks on views about transgender issues she expressed during her 2020 presidential campaign.But more targeted dynamics can‚Äôt explain a shift as comprehensive as the one the country experienced last week. Harris‚Äô loss, as a quasi-incumbent, followed a well-established pattern: When an outgoing president faces widespread discontent over his performance, his party has almost always failed to hold the White House in the election to succeed him. (That dynamic applied when Democrats Harry Truman in 1952 and Lyndon Johnson in 1968 stepped down rather than seek reelection, and again in 2008 with Republican George W. Bush leaving office after his two terms.)‚ÄúPeople struggle to find explanations for what is going on with Hispanic men, or with young people, but the most common explanation [to all of them] is the right one,‚Äù said UCLA political scientist Lynn Vavreck, the co-author of well-respected books on the 2016 and 2020 elections. ‚ÄúNobody thinks things are going well, and if you are the incumbent you own that.‚ÄùTwo sophisticated new geographic analyses of the results underscore just how powerful and pervasive the movement toward Trump was this year. One comes fromthe Daily Yonder websitepublished by the nonpartisan Center for Rural Studies.The center has developed a system that categorizes the nation‚Äôs roughly 3,100 counties into six categories from the most urban (major metro core counties) to the most rural (nonmetropolitan counties). In between, the center divides counties into the categories of suburbs of those major cities; medium-sized cities; the suburbs of those medium-sized cities; small communities; and the rural, nonmetropolitan counties.President Donald Trump arrives to speak during an election night event at the Palm Beach Convention Center on November 6, 2024, in West Palm Beach, Florida.Chip Somodevilla/Getty ImagesANALYSISTrump is already wielding power and causing massive disruptionAccording to the preliminary analysis of the election results the group provided to me, Trump gained in all six kinds of counties ‚Äî and by strikingly similar amounts. Trump improved his vote by 4 percentage points in each of the two most populous categories ‚Äîthe major metro core counties and their suburbs ‚Äî and by 3 percentage points in each of the other four groupings of smaller places.This was a more consistent rise than the center has recorded across the spectrum of urban-rural counties in any recent election. From 2004 to 2008, Barack Obama improved on John Kerry‚Äôs performance in all six kinds of counties, but Obama‚Äôs gains varied more ‚Äî from about 3 points in the smallest places to roughly double that in the largest. From 2008 to 2012, Obama improved slightly in the three groupings of largest places but lost ground in the three smaller categories. In 2016, Hillary Clinton ran better than Obama in the largest places, but Trump ran far better than Mitt Romney, the GOP‚Äôs 2012 nominee, in the smaller ones.Tellingly, the closest recent comparison to Trump‚Äôs uniform gains this year was Biden‚Äôsperformance four years ago. Biden improved on Clinton‚Äôs share of the vote by between 1.5 to 2 percentage points in all of the center‚Äôs categories of midsized counties, and by 0.5 points in the two poles of their scale: the very largest urban centers and the smallest rural places.Biden in 2020did not gain ground across the countryin as large a percentage of counties as Trump did in 2024. But, as the center‚Äôs data showed, Biden then, like Trump now, improved quite consistently across the map, from the most urban to the most rural places.Abramowitz says the state-level results send a similar message about how much Trump‚Äôs electoral recovery this year resembles his decline four years earlier. In 2020, five states flipped from Trump to Biden; in 2024, they all flipped back to Trump (as did Nevada, which narrowly backed Biden four years ago). In 2020, Biden won Michigan, Pennsylvania and Wisconsin,the three former ‚Äúblue wall‚Äù statesthat decided the election, by a combined 257,029 votes. As of last weekend, Trump led in those three states, all of which he won, by a combined margin of 256,940 votes.In all, Biden in 2020, according to the CNN analysis, improved over Clinton‚Äôs showing four years before in 42 states. That‚Äôs not as many as moved toward Trump this year; but both elections, Abramowitz noted, look quite different from the much more mixed results of 2016, when Trump improved on the GOP‚Äôs 2012 performance in 38 states but lost ground in 13 others.Vavreck said Trump‚Äôs first election in 2016 produced a lasting ideological and demographic ‚Äúreshuffling‚Äù that moved states with large populations of non-college White voters (such as Iowa and Ohio) toward the GOP while cementing the Democratic advantage in diverse and well-educated states that became light blue during the Obama years (Colorado and Virginia).But since then, she said, the similarly uniform shift away from Trump in 2020 ‚Äî and then back toward him in 2024 ‚Äî points toward voter assessments of performance, rather than big further ideological shifts, as the main driver of the results. Just as Trump, as the incumbent, suffered from a negative verdict on his performance in 2020, Harris, as the quasi-incumbent successor to Biden, suffered from a negative verdict on the president‚Äôs performance four years later.Former President Donald Trump holds a news conference from inside trash hauler at the airport in Green Bay, Wisconsin, on October 30, 2024.Chip Somodevilla/Getty ImagesRelated articleWe asked Americans what they‚Äôd heard about Trump and Harris throughout the campaign. Here‚Äôs what they told us‚ÄúA lot of that is kind of pure retrospective voting: Things are not going well, so kick the incumbent out,‚Äù Vavreck said. ‚ÄúIn 2020, Biden picks up everywhere. Now we look from ‚Äô20 to ‚Äô24 and the Democrats are losing [ground] everywhere.‚ÄùA second new geographic analysis of the 2024 election results also underscores the comprehensive nature of Trump‚Äôs gains. The center-left Brookings Metro think tank for several years has correlated the election results with federal data that records how much each county contributes to the nation‚Äôs total economic output.Those analyses consistently have foundthat Democrats now dominate the nation‚Äôs highest-output counties, which tend to be large metro areas that have transitioned the fastest into the 21st century information-age economy. Republicans, meanwhile, run best in places generally on the outskirts of the major metro areas that are more dependent on the powerhouse industries of the 20th century: agriculture, energy extraction and manufacturing.The group‚Äôs new analysisshows those divisions largely holding this year.‚ÄúThe first thing to say is that the country remains extremely divided economically,‚Äù said Mark Muro, a senior fellow at Brookings Metro who directs this research. ‚ÄúThat hasn‚Äôt changed.‚ÄùBut the results this year also show Trump establishing what Muro called a ‚Äútoehold‚Äù in the nation‚Äôs most productive metro areas, particularly across the Sun Belt. In 2020, Trump won just five of the 100 counties that contributed the most to the nation‚Äôs overall economic output, while Biden carried an astounding 95. This year, Trump has already won 17 of the 100 most productive counties and Harris 78 (with five still to be called).Trump‚Äôs gains in those very high-output counties, as well as his success in flipping at least another roughly 70 counties from blue to red, has dramatically increased the share of national economic output contributed by the places that support him. In 2020, Biden won only a little more than one-sixth of the nation‚Äôs counties, but the places he captured generated over 70% of the nation‚Äôs total economic output. This year, Trump has already won counties that account for 40% of the nation‚Äôs economic output (with 161 counties still to be called at the time Brookings conducted this analysis late last week).The highest-output counties Trump flipped were almost entirely in the Sun Belt: from Hillsborough (Tampa) and Tarrant (Fort Worth) to Maricopa (Phoenix).Trump‚Äôs recapture of Maricopa was especially dramatic, after Biden in 2020 became the first Democratic presidential nominee to carry the county since Truman in 1948.Muro says Trump‚Äôs gains in high-output metros across the Sun Belt, like his support fromElon Muskand other conservative Silicon Valley leaders, show Trump‚Äôs potential to establish a beachhead in new-economy bastions that almost all viewed him with suspicion during his first term. ‚ÄúThis is the sort of the leading edge of the Trump governing base that now has picked up a number of significant economic centers in addition to its literally thousands of small-town and rural places,‚Äù Muro said.The question, Muro said, is whether Trump can preserve that beachhead while pursuing policies he pledged,such as the mass deportationof undocumented immigrants, sweeping tariffs, rescinding theBiden-passed incentives for clean energyand possibly also semiconductor manufacturing, and potentially moving to restrict civil rights and liberties. ‚ÄúThe Trump agenda,‚Äù Muro said, ‚Äúdoes not seem like one conducive to maximizing the output of the country and particularly the dense blue metros.‚ÄùDonald Trump talks to reporters at the International Brotherhood of Teamsters headquarters in Washington, DC, on January 31, 2024.Chip Somodevilla/Getty ImagesRelated articleWhy Trump surged in New York, but House Democrats succeeded in the stateMuro‚Äôs question about the high-output metros applies more broadly: While disappointment with Biden provided a huge lift for Republicans last week, moving forward Trump will need to sustain support on the strength of his own agenda, leadership style and results.The exit pollsconducted by Edison Research for a consortium of media organizations including CNN,as well as the VoteCast studydone by NORC in partnership with the Associated Press and other media organizations, made clear that even as voters returned Trump to the Oval Office, many of them retained doubts about his agenda and personal style. Across the two studies, a majority of voters described Trump as ‚Äútoo extreme‚Äù and likely to steer the US toward authoritarianism, while majorities also expressed opposition to his mass deportation plan; majorities also indicated support for legal abortion and a greater government role in ensuring health care coverage for Americans.The surveys made clear that those concerns were submerged by the towering discontent with the results of the Biden presidency. In the exit polls, about three-fifths of voters said they disapproved of Biden‚Äôs performance, and two-thirds described the economy in negative terms. About 80% of the voters who disapproved of Biden voted for Trump, as did about 70% of those who expressed negative views about the economy, the exit polls found.As a result of those cross-cutting pressures, a critical share of voters who expressed concerns about Trump or his agenda in the two surveys voted for him anyway: For instance, one-fourth of women who described themselves as supporting legal abortion in the exit polls still voted for Trump. So did about one-fourth of Latinos who said in the exit polls they opposed mass deportation. About 1 in 8 voters who described Trump as too extreme, or said he would lead the US toward authoritarianism, likewise backed him anyway.Vavreck said it should be surprising that even many voters resistant to elements of Trump‚Äôs agenda prioritized more immediate concerns ‚Äî particularly their frustration over the cost of living, as well as issues such as the border and crime. Those frustrations created an almost insuperable barrier for Harris.But in a little over two months, Trump, once again, will be the incumbent. And in Vavreck‚Äôs phrase,heand his party will own the results of the coming years. If Americans feel he has made progress on the problems they elected him to solve, he will likely maintain a strong position. But if they feel he has not, or if they conclude he has created new problems with his policies, there could be a turn away from Trump and the GOP in the 2026 and 2028 elections that is just as uniform as the movement toward them last week."}, {"source": "cnn", "title": "Anatomy of three Trump elections: How Americans shifted in 2024 vs. 2020 and 2016", "link": "https://www.cnn.com/interactive/2024/politics/2020-2016-exit-polls-2024-dg/", "content": ""}, {"source": "cnn", "title": "We asked Americans what they’d heard about Trump and Harris throughout the campaign. Here’s what they told us", "link": "https://www.cnn.com/2024/11/10/politics/breakthrough-polling-project-trump-harris/index.html", "content": "CNN—Americans heard starkly different messages aboutDonald TrumpandKamala Harrisin the final days of the 2024 election,according to The Breakthrough, a CNN polling project that tracked what average Americans actually heard, read and saw about the presidential nominees throughout the general election campaign.In the final pre-election survey, fielded from November 1 through 4, the single word most associated with Trump‚Äôs winning campaign was ‚Äúgarbage.‚Äù That incorporated references to several stories: theracist joke about Puerto Ricotold by a comedian at Trump‚Äôs Madison Square Garden rally, the former president‚Äôsown commentthat the US was ‚Äúlike a garbage can for the world‚Äù and Trump‚Äôs seizing of agarbled remarkfromPresident Joe Bidento hold a news conferencefrom inside a garbage truckwhile wearing a yellow safety vest and then rallying in the same attire with supporters.The most common words used about the final days of the Harris campaign were, by contrast, remarkably generic: ‚Äúcampaign,‚Äù ‚Äúrally‚Äù and ‚Äúad.‚ÄùA woman hoods a sign expressing Latino support for Republican presidential candidate Donald Trump at his campaign rally at the Orange County Fair and Event Center, April 28, 2016, in Costa Mesa, California.\nTrump is vying for votes in the June 7 California primary election in hope of narrowing the gap to the 1,237 delegates needed to win the Republican presidential nomination.DAVID MCNEW/AFP/Getty ImagesvideoRelated videoSenior adviser to Trump campaign explains ‚Äòmassive disconnect‚Äô between voters and Democratic partyThe most commonly used phrase about Trump in the final week was ‚Äúgarbage truck,‚Äù versus ‚Äúmiddle class‚Äù for Harris ‚Äì but mentions of the former were roughly twice as common as the latter, suggesting relatively little consensus about the closing narrative of the vice president‚Äôs campaign.The data doesn‚Äôt necessarily offer a clear-cut story about Trump‚Äôs path to victory, either. It may, in fact, suggest some limits as to how much a siloed news environment can affect vote choice in an election wherepartisans often divergedin their recounting of current events and where roughly 8 in 10 voters said in exit polling that they made up their minds sometime prior to September.But the project, conducted by SSRS and Verasight on behalf of a research team from CNN, Georgetown University and the University of Michigan, provides one account of how the nation experienced the campaign. In the abbreviated race between Harris and Trump, the research found, the single presidential debate between the two nominees in September was perhaps the last campaign event to draw truly universal attention.Georgetown University, University of Michigan and s3mc.orgGeorgetown University, University of Michigan and s3mc.orgWhat also stands out in the charts over time is the lack of a sustained narrative about either candidate. That partially echoes 2016, when researchers found that ‚Äúthere was no single persistent negative theme that emerged when we asked people daily what they had read, seen or heard about Trump.‚Äù That, Gallup‚Äôs Frank Newportwrote four years ago, ‚Äúreflected his campaign‚Äôs ability to define news coverage through attention-getting tactics that defied existing norms of political decorum, and the inability of the opposing campaign ‚Ä¶ to come up with a powerful negative narrative to use against him.‚ÄùBut the parallels to 2016 are far from absolute. In 2024, while no single story stuck to Trump, the overarching word ‚Äúlie‚Äù did, reaching the top five words associated with him in all but one week of the election‚Äôs final two months. And notably, while impressions of Hillary Clinton in 2016 were consistently dominated by stories about her emails, no topic ‚Äì positive or negative ‚Äì filled a similar role for Harris in 2024.On average, over the 20 weeks The Breakthrough survey was fielded this year, roughly 76% of US adults said weekly they‚Äôd heard at least some news about Trump. In the 15 full weeks of data following Harris‚Äô entry into the race, a slightly smaller share ‚Äì about 71% on average ‚Äì said they‚Äôd heard something about her. There was less of a disparity in the final week of the campaign when roughly three-quarters of Americans reported reading, hearing or seeing at least something about each candidate ‚Äì 76% for Trump and 74% for Harris.Those numbers also suggest that the scope of the public‚Äôs attention actually narrowed as the calendar moved further into the fall. In July, the share who‚Äôd heard news about Trump topped out at 89% following the first assassination attempt against him, while the share hearing about Biden peaked at 84% in the wake of his presidential debate performance and subsequent decision to leave the race. The share with something to say about Harris never rose higher than the 77% she hit in mid-August.Georgetown University, University of Michigan and s3mc.orgThat pattern ‚Äì a peak focus during the summer and a decline during the election‚Äôs final days ‚Äì also stands out from the past two elections. In 2020, the share of voters reporting they‚Äôd heard news about Trump and Biden rose modestly but mostly steadily throughout the fall; attention in 2016 was more sporadic but peaked in mid-October.The Breakthrough project also tracked the sentiment of survey responses ‚Äì that is, not the feelings Americans expressed about the candidates personally, but whether the terms and tone they used to frame what they‚Äôd heard tended to be more positive or negative. In the first months after Harris entered the race, her sentiment score was more positive than Trump‚Äôs, the poll found. But that distinction largely faded in the last month of the campaign. Although Harris saw a small uptick in the final week before Election Day, sentiment scores for both candidates remained well under water.Sentiments expressed by political independents when talking about the news surrounding Trump were negative throughout the campaign. Their sentiment when discussing what they‚Äôd heard about Harris, which was close to neutral at the start of her candidacy, declined modestly throughout the fall, undercutting her advantage over Trump on that metric.CNN‚Äôs Jennifer Agiesta and Edward Wu contributed to this report."}, {"source": "cnn", "title": "How Donald Trump completed a historic political comeback", "link": "https://www.cnn.com/2024/11/06/politics/how-donald-trump-won/index.html", "content": "West Palm Beach, FloridaCNN—Donald Trump beganhis political comebackwhen many in his own party wanted him to go away.He announced his third White House bid days after Republicans underwhelmed in the 2022 midterm elections, a performance that prominent GOP figures laid squarely at his feet — for the candidates he supported, for lingering resentments over the January 6, 2021, attack on the US Capitol and for his unwillingness to recede from public lifein the aftermath of defeat.Surrounded at Mar-a-Lago by the close allies and aides that had yet to abandon him during his post-presidency exile, Trump assigned blame elsewhere, including the justice system that had raided his Palm Beach estate three months prior. He offered a dark assessment of the country after he left office and forecasted that before longvoters would turn against those in charge.“I have no doubt that by 2024, it will sadly be much worse, and they will see clearly what has happened and is happening to our country,” Trump said, “and the voting will be much different.”By early Wednesday morning, Trump’s prediction had materialized. Millions of Americans, including pivotal voters in Midwest and Sun Belt battlegrounds, cast ballots that clinched Trump’s historic comeback — one that promises to reshape American politics for the foreseeable future.Trump’s victory, years in the making,is as notable for its breadth as for its method. His campaign aimed from the outset to remake the political coalitions that have underpinned American elections for generations. Trump reached out to constituencies traditionally loyal to Democrats: union households, wage workers, and Black and Latino men.At the same time, he courted the disillusioned — men scattered throughout America’s forgotten places who had long given up on electoral politics altogether. And his allies exploited rifts between Democrats and their base of support. A Republican-tied super PAC, for example, aired ads on Detroit radio urging the area’s Arab voters to support Green Party candidate Jill Stein over the Democratic ticket due to the Mideast conflict.Simultaneously, the Republican Jewish Coalition spent $15 million targeting Jewish voters anxious over the administration’s support for Israel and the left’s embrace of pro-Palestinian protests on college campuses.Preliminary data suggests his team achieved even more than they anticipated. Trump’s apparent gains among younger voters surpassed the rosiest of projections. When all the votes are counted, Trump appears likely to become the first Republican since 2004 to win the popular vote as well as the Electoral College.“The most important thing and what should inform what happens with the party moving forward: He built a broad and diverse coalition,” senior adviser Brian Hughes said Wednesday morning just as Trump took the stage to delivery victory remarks. “And now the exit polling reflects it.”A stable group of campaign aides and a consistent messagePeople within and close to Trump’s political operation credit his victory to a host of factors, not the least of which was a campaign that, from the start, appeared far more sophisticated and disciplined than its two predecessors. They argued that the campaign leadership, led by Florida guru Susie Wiles and veteran Republican operative Chris LaCivita, helped instill a sense of control over the candidate that extended to the Republican Party and helped counteract Trump’s proclivity to get in his own way.The two managed to serve as the former president’s campaign heads for the entire cycle — unheard of in Trump world — and kept the fringe influences within his orbit at bay.“Susie and Chris have held it together,” one longtime Trump confidant told CNN.But the scale of Trump’s win points to forces at work beyond any single campaign maneuver or specific moment in a race marked by many unprecedented events, including multiple attempts on the Republican’s life and the abrupt exit of Democratic President Joe Biden.Rather, the outcome reflects the very scenario Trump foreshadowed two years earlier: An American public beset by inflation, frustrated by years of immigration mismanagement and ultimately prepared to pivot away from the party in power — even if it meant putting the executive branch back in the hands of an unpopular, twice-impeached ex-president whose failed attempts to remain in office ended in a bloody riot in the nation’s capital.For Vice President Kamala Harris, saddled with the baggage of an unpopular incumbent and sour views about the US economy, the race proved challenging, and her scramble to demonstrate her readiness for the role Trump once held ultimately fell short for enough Americans to tip the scales.Video Ad FeedbackLatino voters from battleground states react to Trump win01:34- Source:CNNSkeptics in and outside of the GOP proved wrongYet, skeptics within the GOP remained and cast doubt as to whether enough Americans would ever again turn to Trump to lead the country.A lineup of former allies, including Trump’s first vice president, Mike Pence; ex-political protege Florida Gov. Ron DeSantis; and former ambassador to the United Nations Nikki Haley, set out to test that case, even as the former president made clear he intended to seek the Oval Office once more. For a time, it appeared there was an opening for those candidates to pull the GOP from Trump’s vise grip.Trump enraged his close allies by dining with a known neo-Nazi in the days following the launch of his presidential campaign, and his threat shortly after to terminate the Constitution sent his political team — and his public support — spiraling. The episode marked a low point, Wiles would later tell The Atlantic, leading to an ominously dark Christmas in Palm Beach. Wiles recalled Trump asked her during that stretch, “Do you think I would win Florida?”Then came a series of state and federal indictments targeting Trump’s businesses, his failed attempts to maintain power and droves of White House documents he allegedly took with him to Mar-a-Lago. The response from Republican voters was almost instantaneous. With each new case came a wave of donations and renewed support from the politicians who had left his side.His Republican rivals, already straining to criticize Trump without alienating the GOP faithful, were stuck. All through 2023, Trump refused to attend a single Republican primary debate, leaving his opponents to fight among each other to establish themselves as an alternative.Trump’s political team seized on their change in fortune, selling T-shirts with his mug shot and consolidating support throughout the country. Meanwhile, they set out to build a political machine that would pale in comparison to the disorganized and wayward operations of his first two campaigns.The first test came in Iowa. The campaign recruited and trained around 2,000 volunteer caucus captains across the state. Each was assigned a mission: Get commitments from 10 first-time voters in the Iowa caucuses from a list of 25 prospective supporters the campaign had identified in their neighborhoods.On January 15, Trump captured support from 51% of Iowa caucusgoers, leaving a wide chasm between him and the rest of the field. From there, Trump marched to the GOP nomination, losing only the Vermont and Washington, DC, primaries.Still, Haley had exposed lingering discomfort with Trump among some moderate Republicans, especially suburban women who had turned against the former president almost immediately after his 2017 inauguration.A new tactic for the general electionTrump’s team concluded early that the economy and external forces were more likely to dictate how those voters viewed their decision in 2024 than any outreach he or they could make. Instead, his operatives set out to replace their support by building a new coalition across the battleground states most likely to decide the presidential election.He promised Libertarians a cabinet spot, and to Bitcoin enthusiasts he vowed to install a pro-crypto administration. He made repeated overtures to Michigan autoworkers. He held a rally in the Bronx geared toward Black and Latino voters. He visited deeply blue parts of the country, convinced expanding his efforts outside the traditional battleground map could put the popular vote within reach.Along the way he dangled financial incentives to key groups: no taxes on tipped wages to service workers in Nevada; no taxes on overtime wages for blue-collar workers; no taxes on Social Security for seniors. Mostly, he sought to convince each group that the flow of migrants through the US southern border threatened their jobs, safety and way of life.Former President Donald Trump poses for a photo with CNN and Warner Bros. Discovery in Atlanta on June 27.John Nowak/CNNHe also sat down for lengthy interviews with an emerging media ecosystem of male influencers and podcast hosts — comedians, athletes, pranksters and Joe Rogan — who his campaign believed touched men of all stripes, from the investor class to the industrial exurbs.The strategy was piloted in part by 27-year-old Alex Bruesewitz, who convinced Trump he could reach millions of unlikely voters on these shows. Trump ran some of the campaign’s digital ideas by his son Barron, on whom he has increasingly relied for advice on connecting with younger voters, a source told CNN.Trump started a TikTok account, despite once having threatened to shut down the Chinese social media company, and attempted to build on his outreach through viral moments, including a photo op working at McDonald’s and driving a sanitation truck on an airport tarmac in response to Biden seeming to call his supporters “garbage.”The campaign’s intense focus on low-propensity voters, a term political operatives use for people who rarely, if ever, vote, rattled the nerves of longtime Republican operatives used to fighting for more reliable voters whose politics wavered from left to right every election cycle. Trump further alarmed the GOP faithful when his campaign helped orchestrate the ouster of Republican Party chairwoman Ronna McDaniel, threw out the party’s battleground state plans and installed loyalists atop the RNC to help execute his campaign’s vision.The decision to take over the party came with Trump on the heels of securing the nomination after his allies raised concerns about how McDaniel was spending its money.“It was a marketing operation for the party,” a person involved in reviewing the party’s activity and spending told CNN. “We needed to get the entire apparatus under one roof.”Taking a riskWiles and Trump’s political director, James Blair, had honed this targeted approach in campaigns they ran together in Florida, including the former president’s successful 2020 operation there. Still, one person deeply involved in carrying out these plans acknowledged to CNN that if Trump lost, they would field considerable blame for their unconventional ways.“We’re either going to be ridden out of town on a rail for this and a lot of other things,” the person said. “Or we’ll be geniuses, and it will change things for a long period of time.”Their push relied in part on the work of outside groups, made possible by an FEC decision this year granting campaigns the ability to coordinate with outside political action committees on paid canvassing. Those groups included Turning Point Action, a group targeting younger voters run by Trump loyalist Charlie Kirk, and America PAC, a super PAC founded by tech billionaire Elon Musk, who in the final months steered his tremendous wealth and influence and his social media website X toward getting Trump reelected.By the end of October, Musk’s super PAC had spent more than $140 million on boosting Trump, according to its disclosures with federal regulators, including more than $80 million the group categorized as spending on canvassing and field operations. The money went toward door-knockers, phone bankers and other canvassers, and included daily $1 million giveaways to registered voters in battleground states that prompted the Philadelphia district attorney to sue Musk.In Arizona, Turning Point spent tens of millions on a get-out-the-vote program it called “Chase the Vote.” Full-time staff called “ballot chasers” were trained to build relationships with 400 to 600 specific individuals over months and ensure they voted in the presidential election. They were instructed to drive them to the polls, help them mail in a ballot and encourage early voting.A week before the election, a person with knowledge of Turning Point’s operation told CNN that it had banked votes from more than 125,000 of the low-propensity voters it had targeted in Arizona — a margin greater than Trump’s defeat in the state four years prior.Video Ad FeedbackTrump's win made Elon Musk $15 billion richer01:10- Source:CNNA final vibe shiftIn the final stretch of the campaign, Trump’s team grappled with uncertainty, unsure whether their months of groundwork would translate into the outcome they sought.Mounting concerns lingered over Trump’s erratic behavior in the closing weeks — a pattern marked by chronic tardiness, a subdued energy, and lengthy, meandering speeches before thinning crowds. A particularly chaotic rally at Madison Square Garden, marred by incendiary remarks, risked reminding voters of the very conduct his advisers had carefully sought to keep out of the spotlight. A particularly offensive joke about Puerto Rico by a comedian sent Trump’s political operation into a tizzy of finger-pointing because everyone knew how hard they had worked to build support in Latino communities.With the clock ticking down on Election Day, Trump and his allies appeared to develop last-minute jitters about their reliance on male voters. Kirk, Musk and others spent the day pleading online for men to match the turnout they had seen already. Trump himself sent out a robocall telling men to “get off that beautiful couch” and vote.In the end, though, the concerns were unwarranted. Trump’s campaign had made substantial gains among every demographic his campaign set out to find new votes.“They came from all quarters: Union, nonunion, African American, Hispanic American, Asian American, Arab American, Muslim American,” Trump said in his victory remarks. “We had everybody, and it was beautiful. It was a historic realignment. Uniting citizens of all backgrounds around a common core of common sense.”CNN’s David Wright contributed to this report."}, {"source": "cnn", "title": "Meet the history-makers of the 2024 elections", "link": "https://www.cnn.com/2024/11/05/politics/history-election-firsts-dg/index.html", "content": "CNN—The winners ofseveral elections up and down the ballotwill make history this year, CNN projects.WithDonald Trump winning a second term as president,his running mate, Ohio Sen. JD Vance, is poised to be sworn in as the nation‚Äôs first millennial vice president.Both partiesare also set to welcome a diverse group of newly elected lawmakers in Congress and in state executive offices.Among the projected winners in US Senate races are Democrats Lisa Blunt Rochester of Delaware andAngela Alsobrooksof Maryland, who ‚Äì in addition to becoming their states‚Äô first Black senators ‚Äì will also be the first two Black women to serve simultaneously in the chamber.And Republican Bernie Moreno of Ohio and Democrat Ruben Gallego of Arizona are projected to become the first Latino senators of their respective states.In the House, CNN projects North Dakota to make history with the election of its first woman, Republican Julie Fedorchak, to the state‚Äôs at-large district. The result will leave Mississippi as the only state not to have elected a woman to the US House.Sen. Ted Cruz speaks during a news conference with fellow Republican senators at the US Capitol on May 9, in Washington, DC.Chip Somodevilla/Getty ImagesRelated articleTexas Sen. Ted Cruz will win reelection and defeat Democrat Colin Allred, CNN projectsDemocrats are also poised to make breakthroughs for LGBTQ representation.Sarah McBride, the projected winner of Delaware‚Äôs at-large House seat, will be the first transgender person to serve in Congress. Julie Johnson will be the first out LGBTQ person to win a federal election in Texas, the nation‚Äôs second-most populous state.While the overwhelming majority of governors are elected in midterm elections, a handful of governorships were on the ballot this year. One of the projected winners ‚Äì North Carolina Democrat Josh Stein ‚Äì will be his state‚Äôs first Jewish governor. And former Sen. Kelly Ayotte will become the first Republican woman elected governor of New Hampshire.A few races remain for which CNN has not yet projected a result, and this list will be updated for any additional projections. But of the ones for which a projection has been made, here are the candidates who made history with their victories.ArizonaAZ-SEN: Democrat Ruben Gallego will be the first Latino senator from Arizona, CNN projects, withhis victory over Republican Kari Lakein the race to succeed retiring independent Sen. Kyrsten Sinema. The son of immigrants from Colombia and Mexico, Gallego is a Phoenix-area congressman and previously served in the Arizona House.AZ-03:Yassamin Ansari will be the first Iranian American Democrat elected to Congress, CNN projects, succeeding Democratic Rep. Ruben Gallego in Arizona‚Äôs 3rd Congressional District. The daughter of Iranian immigrants, Ansari is a former member of the Phoenix City Council.CaliforniaCA-45:Democrat Derek Tran will be the first Vietnamese American elected to Congress from California, CNN projects, unseating incumbent Republican Rep. Michelle Steel. The US Army veteran and son of Vietnamese immigrants will represent the predominantly Asian American district in Orange County.DelawareDE-SEN:Democrat Lisa Blunt Rochester will be the first Black and first female senator from Delaware, CNN projects, winning an open seat to succeed retiring Democratic Sen. Tom Carper, her onetime boss. Blunt Rochester, who is in her fourth term representing Delaware‚Äôs at-large US House district, was also the first woman and first Black person elected to Congress from the First State.The election of Blunt Rochester and Maryland‚Äôs Angela Alsobrooks to the Senate will mark the first time that two Black women have served simultaneously in the chamber.Sarah McBride, the Democratic nominee for Delaware's At-Large District, waves at supporters during an election night watch party in Wilmington on November 5, 2024.Pamela Smith/APDE-AL:DemocratSarah McBridewill be the first transgender member of Congress, CNN projects, winning the race for Delaware‚Äôs at-large congressional district. McBride, a state senator, will succeed Democratic Rep. Lisa Blunt Rochester, who won election to the US Senate. McBride will also be the first out LGBTQ person elected to Congress from Delaware.MarylandMD-SEN: DemocratAngela Alsobrookswill be the first Black senator from Maryland, CNN projects, defeating Republican former Gov. Larry Hogan in the race to succeed retiring Democratic Sen. Ben Cardin. Alsobrooks, the Prince George‚Äôs County executive, will also be the second female senator from Maryland after Democrat Barbara Mikulski.The projected election of Alsobrooks and Delaware‚Äôs Lisa Blunt Rochester to the Senate will mark the first time that two Black women have served simultaneously in the chamber.Maryland Democratic Senate nominee Angela Alsobrooks speaks at the Democratic National Convention in Chicago on August 20, 2024.Andrew Harnik/Getty ImagesNew HampshireNH-GOV:Former US Sen. Kelly Ayotte will be the first Republicanwoman elected governor of New Hampshire, CNN projects, winning the open race to succeed retiring GOP Gov. Chris Sununu. Ayotte, who is also a onetime state attorney general, will defeat Democrat Joyce Craig, the former mayor of Manchester.(Note: Republican Vesta Roy served as acting New Hampshire governor for eight days between 1982 and 1983 but was never elected.)New JerseyNJ-SEN: Democrat Andy Kim will be the first Korean American elected to the US Senate, CNN projects, winning the open seat that was once held by former Democratic Sen. Bob Menendez. The son of Korean immigrants, Kim will also be the Garden State‚Äôs first Asian American senator.NJ-09: Democrat Nellie Pou will be the first Latina elected to Congress from New Jersey, CNN projects, winning the race for the state‚Äôs 9th Congressional District. Pou, a state senator whose parents moved to New Jersey from Puerto Rico, will succeed the late Democratic Rep. Bill Pascrell, who died in August.North CarolinaNC-GOV:DemocratJosh Steinwill be the first Jewish person elected governor of North Carolina, CNN projects, defeating scandal-plagued Republican nominee Mark Robinson. Stein, the state attorney general, will succeed term-limited Democratic Gov. Roy Cooper.North DakotaND-AL:Republican Julie Fedorchak will be the first woman elected to the US House from North Dakota, CNN projects, winning the open seat for the state‚Äôs at-large district. Fedorchak, an elected member of the North Dakota Public Service Commission, will succeed GOP Rep. Kelly Armstrong, who is running for governor.OhioOH-SEN: RepublicanBernie Morenowill be the first Latino senator from Ohio, CNN projects, unseating Democratic incumbent Sherrod Brown. Moreno, a car dealership owner from Cleveland, was born in Colombia and moved to the US with his family as a child.OregonOR-05: Democrat Janelle Bynum will be the first Black person elected to Congress from Oregon, CNN projects, flipping the state‚Äôs 5th Congressional District. Bynum, a state representative, will defeat freshman Republican Rep. Lori Chavez-DeRemer.TexasTX-32:Democrat Julie Johnson will be the first out LGBTQ person elected to Congress from Texas, CNN projects, winning the open race for the state‚Äôs 32nd Congressional District. Johnson, a state representative, will succeed Democratic Rep. Colin Allred, who ran for Senate.VirginiaVA-10: Democrat Suhas Subramanyam will be the first Indian American elected to Congress from Virginia, CNN projects, winning the open race for the commonwealth‚Äôs 10th Congressional District. Subramanyam, a state senator whose parents immigrated to the US from India, will succeed retiring three-term Democratic Rep. Jennifer Wexton.Washington stateWA-AG:Democrat Nick Brown will be the first Black person elected attorney general of Washington state, CNN projects, winning the open race to succeed Democrat Bob Ferguson, who CNN projects will win his race to become governor. Brown is the former US attorney for the Western District of Washington.WA-06:Democratic state Sen. Emily Randall will be the first out LGBTQ person elected to Congress from Washington state, CNN projects, succeeding retiring Democratic Rep. Derek Kilmer in the state‚Äôs 6th Congressional District. Randall, who is Chicana, will also be the first out LGBTQ Latina elected to Congress.This story has been updated with additional information.Correction:This article has been updated to reflectAyotte‚Äôs historic milestone. She is the first Republican woman to be elected governor of New Hampshire."}, {"source": "cnn", "title": "The moments of the last four years that led up to Trump’s return to power", "link": "https://edition.cnn.com/interactive/2024/11/politics/trump-election-comeback-cnnphotos/", "content": ""}, {"source": "cnn", "title": "America’s red shift: See the counties where Trump boosted his share of the vote", "link": "https://www.cnn.com/interactive/2024/11/politics/vote-shift-trump-election-dg/", "content": ""}, {"source": "cnn", "title": "7 charts and maps show where Harris underperformed and lost the election", "link": "https://www.cnn.com/2024/11/27/politics/election-voters-harris-what-matters-dg/index.html", "content": "A version of this story appeared in CNN‚Äôs What Matters newsletter. To get it in your inbox, sign up for freehere.CNN—Turnout for thepresidential electionis not yet final, but it‚Äôs clear that fewer people votedin 2024 compared with 2020.Comparing the two elections, Donald Trump added about 2.8 million votes to his total in his 2024 victory. Vice President Kamala Harris, on the other hand, underperformed by about 6.8 million votes compared with Joe Biden in 2020, according to CNN election results as of November 25.Here are seven charts and maps that explain how the US popular vote, turnout in individual states and ultimately turnout in the seven key battleground states ‚Äì where electoral votes were up for grabs ‚Äì tell the story of Harris‚Äô loss.This year will end up being one of just two elections in the 21st century in which the Republican presidential candidate got more votes than the Democratic candidate. It is also one of only two times in the 21st century that the number of votes cast dropped compared with the previous presidential election. The other came in 2012, when about 2.2 million fewer votes were cast than in 2008.Another way to look at Trump‚Äôs narrow edge in the popular vote is that he got the vote of about a third of the citizen voting-age population. A slightly smaller portion backed Harris. Another third did not vote at all.While Democrats‚Äô portion of the vote has been up and down in recent elections, Trump has won more votesin each of the elections in which he was a candidate. Viewed in raw numbers, he got about 63 million votes in 2016, 74 million in 2020 and nearly77 million in 2024.The difference for Democrats was that turnout surged in 2020, the pandemic election.Harris got fewer votes than Biden in 45 of the 50 states and Washington, DC. While votes are still being added to the totals in some states, changes at this point would be marginal.Most of Harris‚Äô drop-off came in populous states like California, New York and Florida, where a dip in support for Harris did not affect the Electoral College vote tally. Trump boosted his overall count in those population centers as well, padding his count by hundreds of thousands of votes in Texas, Florida and New York and to a lesser extent in traditional Democratic strongholds like New Jersey and Massachusetts.Zooming in on the hotly contested battleground states where the election was much closer, Harris and Trump both gained votes compared with 2020 in Wisconsin, Georgia, North Carolina and Nevada. The population has also grown in all of those states in the past four years.Arizona‚Äôs population has also grown, though the total number of votes cast in the state held about even. Harris got fewer votes there compared with Biden in 2020, and Trump carried it with his largest margin of victory across the seven battlegrounds.Pennsylvania and Michigan are battleground states where the population has not grown in the past four years and where Harris got fewer votes in 2024 than Biden got in 2020.Democrats lamenting the results have pointed out that the election was decided by about 230,000 votesin Pennsylvania, Wisconsin and Michigan, battleground states won narrowly by Trump. But Harris lost votes compared with Biden across the country.Harris‚Äô losses compared with Biden were biggest in Southern California, southern Florida and in the Northeast. The few places where Harris got more votes than Biden were largelyconcentrated in those seven battleground states, in particular Georgia and North Carolina, but it wasn‚Äôt enough to overcome Trump‚Äôs gains. The only state where Harris gained votes on Biden‚Äôs 2020 performance, that was not also a battleground state, was Utah.Trump made gainsacross the seven battleground states in particular, but they weren‚Äôt limited to places with higher turnout. Trump also saw increases in support in a range of counties where fewer votes were cast overall.In Michigan, Wisconsin and Pennsylvania, even in many counties where more people voted in 2024, Harris got fewer votes than Biden in 2020, although there were pockets in the swing states where Harris got more votes than Biden.Perhaps it shouldn‚Äôt be surprising that in the states where the campaign was the most hotly contested, more people voted in 2024, whereas in states where one side or the other seemed more likely to win, turnout generallydropped."}, {"source": "cnn", "title": "Trump’s 2024 victory revealed voter shifts that could reshape America’s political landscape", "link": "https://www.cnn.com/2024/11/10/politics/trump-voter-shifts-nationwide/index.html", "content": "CNN—President-electDonald Trumpwon across the map — improving on Republican margins nearly everywhere and delivering on his promises to win over more non-White voters on his way to defeating Vice President Kamala Harris.Now that the dust has settled on the 2024 presidential election, a dive intoCNN’s exit pollsandcounty-by-county resultscompared with previous races offers an even more detailed glimpse at how Trump won.And perhaps more important for Democrats, the results paint a daunting picture of a party whose national coalition has fractured — with suburbs where they’ve won squeezed as tight as they can be, Latinos rapidly realigning with the GOP, and Trump posting the sorts of marginal gains among both urban and rural voters that are difficult to overcome.Here are five takeaways on the voters Trump won and what it means moving forward:The Latino realignmentA trend with the potential to remake the American political landscape is the huge shift in Latino voters toward Trump. His gains were visible nationwide, but were particularly glaring in Florida.Trump cruised to a nearly 12-point win in Miami-Dade County, home to a massive population of Cuban Americans and a large and growing number of Venezuelan immigrants. He was the first Republican presidential nominee to win the county in 36 years.CNN 5 ThingsOne Thing: He Never Voted Republican. Trump 2024 Changed That.President-elect Donald Trump is claiming a mandate after making inroads with multiple demographics en route to a popular vote victory. In this episode, we hear from a formerly reliable Democratic voter about why he voted for Trump this time around. \nGuest: Nevin SkalkoNov 10, 2024 • 22 min...Apple PodcastsSpotifyTuneIniHeart RadioRadio.comPandoraAmazonRSSPerhaps more ominous for Democrats outside of the Sunshine State, though, was Trump’s strong performance in the Orlando area, where the Latino population is largely Puerto Rican — and therefore the results more reflective of what’s happening outside Florida as well. Harris’ campaign had hoped the pro-Trump comedian referring to the island as “garbage” at a Madison Square Garden rally would pay off with those voters. But the results showed they had moved hard in Trump’s favor.Trump’s 1.5-point win in Osceola County flipped a location that President Joe Biden won by 14 points four years earlier. Trump’s performance similarly improved in Orange County, home of Orlando, where Biden won by 23 points in 2020 but Harris won by just 5.6 points this year.CNN’s exit poll showed the dramatic swing in Latino voters over just a four-year period.In 2020, Biden won Latino voters nationally, 65% to Trump’s 32%. For Harris, the advantage was just 52% to Trump’s 46% — a huge slippage among a demographic that makes up 12% of the overall electorate.With Latino men, the numbers were even more stark. Trump won Latino men by 12 points — a 35-point swing from 2020. If the dramatic shift continues in future elections, it could remake the American political map, with consequences ranging from presidential races to state legislative battles and more.People listen as Trump participates in a roundtable discussion at the Latino Summit held at Trump National Doral Golf Club on October 22, 2024, in Doral, Florida.Anna Moneymaker/Getty ImagesGOP’s big border gainsLatino voters’ shift was also on display on the border — particularly in the Rio Grande Valley in southeast Texas.Starr County, which is 97% Hispanic, hadn’t backed a Republican presidential nominee since 1892 — and it hadn’t really been close: Hillary Clinton won there by 60 points in 2016. But Trump broke that streak this year, winning Starr County by 16 points. It was a vivid example of the valley’s rapid political evolution.The tough-on-border-security message Trump hammered nationally hit home in the Texas borderland, where residents — many of whom have been in the United States for generations — feel the effects of border crossings acutely. Republicans’ cultural appeals and organizing efforts have also paid dividends.There is reason for Democrats to believe they can stop, or at least slow, this shift. Republican Sen. Ted Cruz made gains but did not rack up the same huge border wins that Trump did. A Democratic incumbent, Rep. Vicente Gonzalez, narrowly held on to his Rio Grande Valley seat — though it was a much closer race than he’d faced against the same opponent in 2022. So did Rep. Henry Cuellar, the most conservative Democrat in the House.The good news for Republicans: It wasn’t just Texas. In the swing state of Arizona, Yuma County — a border county in the state’s southwestern corner — went to Trump by 6 points in 2020. He won the county by 29 points this year.Migrants pass through razor wire after crossing the Rio Grande into El Paso, Texas, on February 1, 2024.John Moore/Getty ImagesTrump’s urban improvementTrump criticized Detroit while he was in Detroit. He accused Harris of ruining San Francisco, where she’d been district attorney. He held a rally in deep-blue New York City, despite the state not being in play.While the effectiveness of his campaign tactics is debatable, what’s undeniable is that the former president tapped into a simmering discontent in urban areas, where local governments are led almost exclusively by Democrats.Trump’s percentage of the vote in Wayne County, home of Detroit, ticked upward by 3.4 percentage points compared with 2020. Harris’ percentage dropped by 5.7 points. And the Democratic ticket won the state’s most populous county — one where racking up huge margins is critical to the party’s hopes statewide — by 85,000 fewer votes than it had in 2020. Trump’s gains are explained in part by his appeals to Black men, and his efforts to reach out to Arab American voters.The urban swings toward Trump were evident across the political map. He gained significant ground in New York City and the surrounding counties. But even small gains, like the 2 to 3 points he appears to have improved in Philadelphia compared to 2020, is significant: It chopped the Democratic raw vote edge there down by about 55,000 votes.Trump’s improvement was fueled in part by Black men. CNN’s exit polls showed just a 2-point shift among Black men toward Trump nationally. But the shift was much bigger in some key states, like Pennsylvania, where Biden’s 89% to 10% edge turned into a 72% to 26% win for Harris, and North Carolina, where Biden’s 91% to 8% advantage was just 78% to 21% for Harris.People vote in the presidential election on November 5, 2024, in Detroit.Rebecca Cook/ReutersHarris’ suburban flatlineHeaded into Election Day, two potentially outcome-deciding questions loomed: Would Trump’s yearslong efforts to appeal to men, particularly young and non-White men, show up at the polls? And would Harris be able to outpace him by further building on recent Democratic wins in the suburbs?The answers: Yes. And no.The only group with whom Harris improved on Biden’s margins was college-educated women. Her campaign had hoped for big gains with those voters — people who helped drive Democratic midterm wins in 2018 and 2022, and who might have backed former South Carolina Gov. Nikki Haley in the 2024 Republican presidential primary. It’s why she campaigned alongside former Wyoming Rep. Liz Cheney, who lost her House seat in a 2022 primary after vehemently opposing Trump, in the race’s closing days. But they were nowhere near enough to stop her overall slide.One window into Harris’ failure is the counties surrounding Detroit. Oakland County, sprawling suburban territory that both campaigns had visited in the race’s closing days. Harris won by 10 points and 85,000 votes — short of the 14-point, 114,000-vote win Biden had notched there in 2020. Macomb County, where Trump had won by 8 points and 40,000 votes four years ago, went to the former president by 14 points and 70,000 votes.Those marginal gains for Trump add up very quickly in a state where he defeated Harris by 78,000 votes.Trump also showed improvement in the Western battlegrounds, including Nevada — where different mail-in ballot counting rules means the vote is being tallied more slowly, but early indications are that Trump made significant gains, particularly among newly registered independent voters in and around Las Vegas. Independents made up a bigger share of Nevada’s overall electorate than they did in 2020, and they swung 8 points in Trump’s favor.Where Democratic presidential nominees can’t winThe deep challenge the national Democratic Party faces with rural voters was on vivid display in two states the party hasn’t won on the presidential level in a generation: Missouri and Kentucky.In Missouri, policies broadly backed by Democrats won popular support. Voters this year approved statewide ballot measures guaranteeing abortion rights, raising the minimum wage and mandating paid sick leave.Harris, though? Blown out by 15 points.In Kentucky — the same state that reelected a Democratic governor, Andy Beshear, last year in a campaign that focused largely on cultural battles like abortion rights and transgender rights — voters resoundingly rejected a proposed school voucher program.They also rejected Harris, handing Trump a 30-point victory.Virtually across the board, Trump picked up even more votes in the largely White, working-class, rural regions where Republicans have long dominated. Those marginal gains made the challenge for Harris of putting together a winning coalition even more daunting — and, ultimately, impossible.What Democrats will have to grapple with as the party enters a period of soul-searching is why the national party’s brand is so toxic with voters who have sided with the party on policy, and at times handed the party local victories."}, {"source": "cnn", "title": "Sen. Bob Casey concedes Pennsylvania Senate race to Republican Dave McCormick", "link": "https://www.cnn.com/2024/11/21/politics/pennsylvania-senate-race-casey-concedes/index.html", "content": "CNN—Democratic Sen. Bob Casey on Thursday conceded the high stakes Pennsylvania Senate race to Republican Dave McCormick.‚ÄúDuring my time in office, I have been guided by an inscription on the Finance Building in Harrisburg: ‚ÄòAll public service is a trust, given in faith and accepted in honor,‚Äô‚Äù he saidin a video posted on X. ‚ÄúThank you for your trust in me for all these years, Pennsylvania. It has been the honor of my lifetime.‚ÄùOn Friday, Pennsylvania‚Äôs secretary of the commonwealth announced the state was stopping its recount of the Senate race results at Casey‚Äôs request. The automatic recount had been trigged after unofficial results showed the margin between McCormick and Casey within one-half of 1%.Currently, McCormick leads by about 16,000 votes, or 0.2 percentage points. Counties must certify their final results by Monday.McCormick‚Äôs victory is a major upset for the three-term Democratic incumbent in the key battleground state, which also swung back to Donald Trump on the presidential level this year.The Senate race had tightened in the final months of the campaign, but Casey had an edge in most polling of the race for much of his campaign against McCormick, a former hedge fund executive who lost a bid for the state‚Äôs other Senate seat in 2022. Republicans and Democrats alike spent big in Pennsylvania as it emerged as a pivotal battleground up and down the ballot.McCormick frequently appeared with Trump at his rallies this year after losing out on the former president‚Äôs endorsement during the primary two years ago. And although the GOP Senate nominee often appeared to be running behind Trump in his contest with Vice President Kamala Harris in public polling of the race, he and his GOP allies leaned into the issue of immigration, which was at the center of the Republican Party‚Äôs 2024 election strategy.Republicans hammered Casey on the issue, dedicating millions of dollars in attack ads tying the senator to the Biden administration‚Äôs record on the border.McCormick, the former CEO of Bridgewater Associates, made an anti-incumbency argument, calling Casey ‚Äútoo weak‚Äù and asking voters in one of his closing messages to ‚Äúmake a change,‚Äù while recapping his bio as a West Point graduate.McCormick, whose wife Dina Powell worked as a national security adviser to Trump, was nearly onstage during a July assassination attempt against the former president in Butler, Pennsylvania. But Trump told him to stay seated for another few minutes, shortly before the gunman struck.McCormick‚Äôs victory means Pennsylvania will, for at least the next four years, be one of the few states with senators from different parties. Democratic Sen. John Fetterman beat Mehmet Oz, the famed television doctor, in 2022, for his first six-year term.CNN‚Äôs Ethan Cohen and Morgan Rimmer contributed to this report."}, {"source": "cnn", "title": "Democrat Ruben Gallego will defeat Kari Lake for Arizona Senate seat, CNN projects", "link": "https://www.cnn.com/2024/11/11/politics/ruben-gallego-arizona-senate-race-kari-lake/index.html", "content": "CNN—Democratic Rep. Ruben Gallego will win a closely watched US Senate seat in Arizona, CNN projects, defeating Republican Kari Lake to become the state‚Äôs first Latino senator.Gallego will succeed retiring independent Sen. Kyrsten Sinema, a former Democrat, as he joins the soon-to-be-GOP-controlled chamber in January. His win is a bright spot for Democrats, who lostthe presidencyandtheir Senate majoritylast week. CNN has not yet projected the race for control of the US House of Representatives.With Donald Trump winning Arizona, Gallego also becomes one of several Democrats who were able to win Senate seats this year while the president-elect was carrying their states.The Senate election in Arizona pitted Gallego, a fifth-term congressman who rebranded himself as a moderate in the general election, against Lake, the 2022 GOP nominee for governor and a close Trump ally who pushed false conspiracies about the 2020 election and her own loss two years later.Gallego on Monday thanked Republicans who voted for him, saying, ‚ÄúThey took a chance on me.‚Äù‚ÄúAnd we‚Äôre not going to agree all the time, and I‚Äôm going to always seek the input, and we‚Äôre going to find middle ground where we can,‚Äù he said at a news conference shortly after the race was called. ‚ÄúBut at the core, I‚Äôm always going to defend the Constitution of the United States and the interests of everyday Arizonans.‚ÄùAsked what he‚Äôd fight against with a Republican White House and Senate majority, Gallego said, ‚ÄúWhen it‚Äôs time to fight we will fight the administration. When there‚Äôs places that we can find common ground, we‚Äôll find common ground,‚Äù but that he‚Äôd ultimately do ‚Äúwhat is the best for Arizona.‚ÄùThe race was defined by issues such as the economy, high cost of housing, illegal immigration into the border state and abortion rights.Gallego, who would be the first Latino senator from Arizona, vowed to ‚Äúfight to fix a broken immigration system and security‚Äù and to ‚Äúlower costs on everything, gas, groceries, rent and more.‚ÄùPreelection polling showed Lake struggling to match Trump‚Äôs numbers, especially among independents.Gallego, a former member of the Congressional Progressive Caucus, outraised and outspent Lake, who did not receive help from the main Senate GOP super PAC tied to Republican leader Mitch McConnell.Born in Chicago, Gallego is of Colombian and Mexican heritage. Heserved in the US Marinesand was deployed to Iraq. He has spoken about seeing some of the worst fighting there and has been open about his struggles with post-traumatic stress disorder.Gallego was first elected to Congress in 2014 to represent a deep-blue district in the Phoenix area. He previously served two terms in the Arizona House.This story has been updated with additional reporting."}, {"source": "cnn", "title": "Democratic Sen. Jacky Rosen will win reelection in Nevada, CNN projects", "link": "https://www.cnn.com/2024/11/08/politics/jacky-rosen-nevada-senate-race/index.html", "content": "CNN—Democratic Sen. Jacky Rosen will win reelection in Nevada, CNN projects, holding off Republicans from adding to their incoming majority in the US Senate.Rosen, a former synagogue president who was first elected in 2018, is projected to narrowly defeat Army veteran Sam Brown. The Republican‚Äôs campaign had appeared to struggle to gain traction in this battleground state, but in the end, he kept the race close.With Donald Trump projected to win Nevada, Rosen becomes one of several Democrats who were able to win Senate seats this year while the president-elect was carrying their states.Democrats focused much of their attacks on Brown over abortion rights ‚Äì with Rosen attacking him on the issue even before he emerged from a June primary. While Brown had said he would not support a federal abortion ban and backs exceptions for victims of rape or incest, he once backed a 20-week ban in Texas, which would not have made exceptions for rape or incest, when running for a Texas legislative seat a decade ago.His wife, Amy Brown, spoke out during the campaign about having an abortion before she met her husband and how that experience shaped their views on the issue.Rosen, for her part, campaigned on being a staunch supporter of abortion rights. Nevada, where abortion is legal up to 24 weeks of pregnancy, was one of several states that voted this year on ballot initiatives to enshrine reproductive rights in their state constitutions.CNN projectedthat Silver State voters will approve a measure that would establish the fundamental right to an abortion up to the point of fetal viability in the state‚Äôs constitution.Brown, who moved to Nevada from Texas in 2018, first ran for Senate in 2022. He lost the Republican nomination to former Nevada Attorney General Adam Laxalt, who then narrowly lost the general election to Democratic incumbent Catherine Cortez Masto. This year, Brown leaned heavily into his endorsement from Trump, using the former president‚Äôs praise of him and criticism of Rosen in ads.In both of his Senate runs, Brown faced accusations of being a carpetbagger.In one case, Brown landed on the wrong side of one of the most politically toxic issues in the state: stalled plans to send nuclear waste to a federal repository at the state‚Äôs Yucca Mountain. Brown was forced to backtrack on his support for opening the facility after his remarks were reported."}, {"source": "cnn", "title": "Democratic Sen. Tammy Baldwin will win reelection in Wisconsin, CNN projects", "link": "https://www.cnn.com/2024/11/06/politics/tammy-baldwin-wisconsin-senate/index.html", "content": "CNN—Sen. Tammy Baldwin will win reelection in Wisconsin, CNN projects, in a victory for Senate Democrats trying to defend the so-called blue wall states despite losing them at the presidential level and havingalready lost their majority in the chamber.Baldwin is projected defeat Republican Eric Hovde in a race that attracted a late flurry of attention after initially appearing less competitive than a few other states where Democrats were on defense.Baldwin will be returning for a third term to a dramatically shifted Senate. Republicans are currently projected to control 52 seats next year, having flipped West Virginia, Ohio and Montana. CNN has not yet projected the other ‚Äúblue wall‚Äù Senate races ‚Äì in Pennsylvania and Michigan ‚Äì as of Wednesday afternoon.Republicans came home late to Hovde, but Democrats had worked to define him early, seizing on some of his controversial comments to paint him as a California banker who didn‚Äôt have Wisconsin voters‚Äô best interest at heart. (The CEO of Sunwest Bank owns a home in Laguna Beach, California, but was born and raised in the Badger State.) Democrats also leaned into the issue of abortion to pick up nontraditional Democratic voters.The sun rises behind the US Capitol building on October 26, in Washington, DC.J. David Ake/Getty ImagesRelated articleRepublicans will flip the Senate, CNN projects, shifting balance of power in WashingtonHovde, who‚Äôs also CEO of a prominent Madison-based development company bearing his name, poured millions of dollars into his campaign and had significant outside firepower from GOP groups. But Baldwin ‚Äì a well-known incumbent first elected to the Senate in 2012 after seven terms in the House ‚Äì raised substantial money that also allowed her to reserve advertising time at the more favorable candidate rate.Her campaign attacked Hovde, for example, for saying that most nursing home patientsaren‚Äôt in a condition to vote, while touting her work in the Senate, including efforts topass the PACT Act, which expands health care benefits for veterans exposed to burn pits.The two-term incumbent had experience courting ticket-splitters ‚Äì she won her previous reelection in 2018 after former President Donald Trump had carried Wisconsin two years earlier. But Hovde posed a tougher challenge than her opponent from six years ago. Baldwin made an effort to travel to rural and conservative parts of the state to try to narrow Hovde‚Äôs margins, even in places where Democrats were likely to lose. She also scored the endorsement of the Wisconsin Farm Bureau Federation, a notable get for a Democrat running statewide.For much of the race, Hovde had a defensive posture on air responding to Democratic attacks ‚Äì trying to lay out his Wisconsin roots or call out Baldwin‚Äôs spots for being‚Äúnasty.‚ÄùBut the GOP nominee ‚Äì whose campaign underwent an early fall shake-up ‚Äì also tried to nationalize the race, attempting to tie Baldwin to President Joe Biden and then Vice President Kamala Harris on inflation and the border.And in the final stretch, Hovde and his GOP alliesaccused Baldwin, the first out gay senator, ofa conflict of interestbecause her partner of six years is a financial adviser for high-end clients. The charge, which Baldwin strongly denies, lacks proof. Republicans also attacked her over transgender issues, trying to paint the senator as too liberal for the state. Baldwin took to the airwaves to say that Hovde was ‚Äúlying‚Äù and that he was ‚Äúnot for us.‚ÄùWhile those GOP lines of attack may have helped Hovde consolidate the base with which he was lagging for much of the race, it wasn‚Äôt enough to win over the general electorate."}, {"source": "cnn", "title": "Democrat Elissa Slotkin will win Michigan Senate seat, CNN projects", "link": "https://www.cnn.com/2024/11/06/politics/elissa-slotkin-michigan-senate-race/index.html", "content": "CNN—Rep. Elissa Slotkin will win thecompetitive Michigan Senate race, CNN projects, keeping the seat in Democratic hands and making her the youngest Democratic woman elected to the Senate.She will defeat former Rep. Mike Rogers, who once chaired the House Intelligence Committee and was endorsed by former President Donald Trump earlier this year. Rogers called Slotkin and conceded the race, according to two sources.‚ÄúDonald Trump and I were both elected by the people of Michigan. Tens of thousands of Michiganders voted for Donald Trump and Elissa Slotkin on the same ballot, and it is my responsibility to get things done for Michiganders no matter who is in office, just as I did in President Trump‚Äôs first term,‚Äù Slotkin told reporters Wednesday in Detroit.‚ÄúI‚Äôm a problem solver, and I will work with anyone who is actually here, to work as your senator. That will always be my first priority,‚Äù she added, reiterating her belief that ‚ÄúAmerica is at its best when we have two healthy parties that push and pull and debate on issues of policy and substance and make our laws better.‚ÄùSlotkin will be sworn intoa GOP-controlled Senatethat will be in position to boostTrump‚Äôs presidency. The GOP is also looking to defend its narrow majority in the US House of Representatives, though it remains uncalled.Slotkin will succeed Democratic Sen. Debbie Stabenow, Michigan‚Äôs first female US senator, who announced early last year she would step aside and ‚Äúpass the torch‚Äù to a new generation of leadership.First elected to the House in 2018, Slotkin made appeals to conservative voters, ending both of her debates with Rogers by noting that her dad is a lifelong Republican who feels betrayed by his party‚Äôs loyalty to Trump.‚ÄúYou will always have an open door in my office. You will always have a place at the table, because I want to hear from you,‚Äù she vowed during the campaign.Rogers, who cozied up to Trump despite his previous criticism of the former president after the January 6, 2021, insurrection, highlighted Slotkin‚Äôs voting record in support of the Biden-Harris administration‚Äôs agenda, as she touted her abilities to be an independent thinker.The Michigan Republican, whom Democrats attacked for moving to Florida after leaving the House in 2015, repeatedly linked Slotkin to efforts by the administration to incentivize a transition to electric vehicles, a hot-button issue with Michigan‚Äôs auto workers.Slotkin ran television ads across the state telling voters that she doesn‚Äôt care what kind of car they drive, as Rogers accused her of wanting to essentially ban gas-powered vehicles in the state.‚ÄúI live on a dirt road, nowhere near a charging station, so I don‚Äôt own an electric car. No one should tell us what to buy, and no one‚Äôs gonna mandate anything,‚Äù she said in one spot, explaining that her priority is making sure EVs are made in Michigan instead of in China.Slotkin also ran a multimillion-dollar ad campaign highlighting Rogers‚Äô previous voting record on abortion legislation, arguing that though access to the procedure is protected in Michigan‚Äôs constitution, Republicans would enact a national abortion ban if given the levers of power.‚ÄúIt‚Äôs not a talking point to women, it is our lives. It‚Äôs whether we bleed to death in a parking lot. It‚Äôs who and when gets to decide how we have a family. Do not trust him,‚Äù Slotkin fired back as Rogers vowed in their first debate that he would not defy the will of the Michigan people in Washington.The Democratic congresswoman said that she would support reforming the Senate‚Äôs filibuster rule if elected so that legislation to codify Roe vs. Wade could pass with a simple majority vote in the chamber.Slotkin also emphasized her position on gun safety, pointing out that she is the first US congresswoman to represent a district that suffered two school shootings, one at Oxford High School in 2021 and another at Michigan State University in 2023.‚ÄúThis idea that we can‚Äôt go after the No. 1 killer of children in America is broken,‚Äù she said on the debate stage in Detroit.In 2022, Slotkin, then the congresswoman for the 8th District, ran to represent the 7th district after Michigan‚Äôs congressional map was redrawn to capture a significant part of her Lansing-area constituency in that seat.Slotkin, who embarked on a road trip-style tour of the state with Stabenow shortly after securing the Democratic nomination for Senate, said when she first decided to launch a bid for the seat, ‚Äúit wasn‚Äôt even a question‚Äù if a woman could run, thanks to Stabenow.Slotkin, a former CIA analyst who often touted her service under presidents of both parties, asked voters just after she won the Democratic primary to ‚Äújoin us on team normal,‚Äù a message that persisted throughout her campaign as she tried to build a broad coalition."}, {"source": "cnn", "title": "Moreno will defeat Brown in Ohio, CNN projects, in key pickup for GOP", "link": "https://www.cnn.com/2024/11/05/politics/bernie-moreno-ohio-senate-race/index.html", "content": "CNN—Republican Bernie Moreno will defeat Democratic Sen. Sherrod Brown, CNN projects, a key pickup for the GOP in a state that‚Äôs been trending its way and putting the GOP one step closer to securing the Senate majority.The three-term incumbent was already the last remaining Democrat in nonjudicial statewide office in the Buckeye State, and his defeat is yet another sign of how down ballot races are increasingly moving in the same direction as the top of the ticket with fewer ticket-splitters.Moreno, a Cleveland car dealership owner, leaned heavily into his endorsement from former President Donald Trump in a state that backed him by 8 points in both 2016 and 2020. Moreno emerged as the GOP nominee earlier this year after Democrats helped prop him up in the primary, believing he‚Äôd be the weakest opponent.The Republican tried to nationalize the race, trying to tie Brown ‚Äî a progressive populist first elected to the Senate in 2006 ‚Äî to Vice President Kamala Harris on immigration and inflation. Moreno‚Äôs GOP allies also tried hitting Brown over transgender athletes in an effort to cast the senator as too liberal for the state. (Brown and the Democratic Senatorial Campaign Committee went up with a response ad on the issue that says the senator agrees with GOP Gov. Mike DeWine that ‚Äúthese decisions should be made by local sports leagues, not politicians.‚Äù)Moreno trailed in public polling of the race for most of the year, although those numbers began to tighten as GOP voters consolidated around him in the final weeks before Election Day.He was able to overcome attacks over abortion, which was a major theme of Democrats‚Äô messaging against him, especially after he made comments at a town hall suggesting that some suburban women were single-issue voters and questioning why women older than 50 would care about the topic. (Moreno‚Äôs campaign said he had been ‚Äúclearly making a tongue-in-cheek joke.‚Äù) Democrats seized on those remarks, arguing that Moreno was out of step with Ohioans, who just last year approved a ballot measure enshrining abortion rights in the state constitution with 57% of the vote.Brown‚Äôs significant fundraising strength allowed him to reserve advertising at the more favorable candidate rate and dominate the airwaves over the summer. But Moreno had  significant outside firepower from GOP groups that helped boost his candidacy in the fall.The race was the most expensive congressional contest on record, according to data from ad tracking firm AdImpact."}, {"source": "cnn", "title": "Texas Sen. Ted Cruz will win reelection and defeat Democrat Colin Allred, CNN projects", "link": "https://www.cnn.com/2024/11/05/politics/ted-cruz-texas-senate-race/index.html", "content": "CNN—Texas Sen. Ted Cruz will win reelection to a third term, CNN projects, defeating Democratic challenger Rep. Colin Allred and denying Democrats one of their best chances to mitigate potential losses elsewhere.The Longhorn State has long been a Republican stronghold, with the GOP winning every statewide election there since 1994. However, amid demographic shifts, Democrats have long seen Texas as a potential future battleground and national party groups poured millions of dollars into trying to boost Allred‚Äôs candidacy in the final months of the race.Allred, a former NFL linebacker who defeated GOP Rep. Pete Sessions to win his House seat in 2018, was seen as a viable challenger. He tried to tie Cruz to the state‚Äôs abortion ban, running ads featuring Kate Cox, whom the state Supreme Court blocked from having an abortion after her fetus was diagnosed with a deadly genetic condition.Allred also went on offense on immigration, trying to flip the script on Republicans. He attacked Cruz for voting against the bipartisan border deal and featured testimonials from border law enforcement officers in his own ads.But Cruz had also beaten back stiff competition before, narrowly defeating Rep. Beto O‚ÄôRourke in a 2018 race in which the Democrat shattered Senate race fundraising records.This year, he tried to tie Allred to the Biden-Harris administration on inflation, the border wall and transgender issues. (The latter attack prompted a response from the former football player, who said in an ad, ‚ÄúI don‚Äôt want boys playing girls‚Äô sports or any of this ridiculous stuff that Ted Cruz is saying.‚Äù)Cruz became a lightning rod early in his Senate career, when he led a government shutdown in a bid to defund then-President Barack Obama‚Äôs Affordable Care Act. He was a 2016 presidential candidate, and one of Donald Trump‚Äôs most vocal critics in that Republican primary. But he has since aligned himself with the former president, endorsing him in early 2024 ahead of a GOP primary that Trump ultimately coasted through."}, {"source": "cnn", "title": "Angela Alsobrooks will hold Maryland Senate seat for Democrats, CNN projects", "link": "https://www.cnn.com/2024/11/05/politics/angela-alsobrooks-maryland-senate/index.html", "content": "CNN—Democrat Angela Alsobrooks will win the Maryland Senate race, CNN projects, defeating Republican former Gov. Larry Hogan, whose candidacy made the race to replace retiring Sen. Ben Cardin competitive in this otherwise deep-blue state.Alsobrooks, the Prince George‚Äôs County executive, will be just the fourth Black woman elected to the Senate, after Delaware‚Äôs Lisa Blunt Rochester won earlier Tuesday, and the first Black senator to represent Maryland.Her victory is a relief for Democrats, who were facing a daunting Senate landscape before this race came on the map. With most competitive races playing out in states that former President Donald Trump either won or narrowly lost four years ago, Democrats had not been expecting to have to spend in a state President Joe Biden won by more than 30 points.Democrats‚Äô central argument against Hogan, who left office with high approval ratings after two terms, was that he would be a vote for Republicans in the Senate ‚Äî especially on the issue of abortion.Hogan tried to pitch himself as an independent voice, unbeholden to this party. In his first general election ad, he said he‚Äôd support codifying Roe v. Wade in federal legislation. And he rejected Trump‚Äôs endorsement after the former president said he‚Äôd like to see him win the state.But Democrats effectively nationalized the race. Over the course of the summer and fall, Alsobrooks grew her name recognition and made gains among voters who said they cared about Democrats holding the Senate, according to Washington Post/University of Maryland polling.Alsbrooks, amenteeof Vice President Kamala Harris, also benefited from her ascension to the top of the ticket, whichboosted enthusiasmabout electing Black women. Neither made their history-making potential a key message on the trail, but it was resonant in a state where Black voters ‚Äì and Black women in particular ‚Äì are a crucial part of the electorate. Alsobrooks‚Äô home turf of Prince George‚Äôs County is home to one of the largest middle-class Black populations in the country.Alsobrooks‚Äô history-making potential was also influential for some voters in the primary, when she scored a stunning primary defeat over Rep. David Trone, who broke the record for self-funding a Senate primary campaign. The co-owner of Total Wine & More spent more than $60 million of his own money but came up more than 10 points short. The Democratic Party quickly united around Alsobrooks, who already had the backing of most of the state‚Äôs congressional delegation.Her general election victory will now add a woman to the state‚Äôs all-male congressional delegation."}, {"source": "cnn", "title": "Republican Sen. Deb Fischer will win reelection in Nebraska’s Senate race, CNN projects", "link": "https://www.cnn.com/2024/11/06/politics/deb-fischer-nebraska-senate-race/index.html", "content": "CNN—Republican Sen. Deb Fischer will win reelection in Nebraska, defeating an unexpectedly strong challenge from independent Dan Osborn, CNN projects.Fischer was first elected to the Senate in 2012, when she became the first female senator elected to a full term in Nebraska. Prior to being elected to Congress, she served in Nebraska‚Äôs unicameral legislature.Osborn, a Navy veteran and industrial mechanic, gave a tougher-than-expected challenge to Fischer.Osborn and his allies outspent Republicans and garnered attention with buzzy ads, including one in which he burned the word ‚ÄúLIE‚Äù into a TV to knock attack ads from his opponent. In another spot, he called Fischer and her colleagues in the US Senate ‚Äúa bunch of millionaires controlled by billionaires.‚ÄùHe frequently labeled Fischer a ‚Äúcareer politician‚Äù and criticized her for backtracking on her promise to run for only two Senate terms. Fischer, who will begin her third Senate term in January, said she changed her mind after realizing how important seniority is for members of Congress.Fischer portrayed Osborn as a ‚ÄúTrojan horse‚Äù for Democrats and sought to tie him to party figures such as Vice President Kamala Harris, President Joe Biden, and Independent Vermont Sen. Bernie Sanders. Former President Donald Trump also sought to tie Osborn to the left in his endorsement of Fischer.‚ÄúDan is a ‚ÄòBernie Sanders Democrat‚Äô who does not stand for Nebraska Values, and never will,‚Äù Trump wrote on Truth Social on September.Osborn, meanwhile, painted himself as a populist and took policy positions that didn‚Äôt fit neatly into either party. He said he personally opposes abortion but thinks it should be legal and called himself a supporter of the Second Amendment. He backed lowering taxes on overtime pay, boosting benefits for servicemembers and veterans, and legalizing cannabis.He declined support from the Democratic Party and refused to say which party he would caucus with if elected or to share who he voted for in 2020 or planned to vote for in 2024.Nebraska Democrats, who said at one point they were in talks with Osborn to form a coalition, did not field a candidate or publicly back Osborn.The state also held a special Senate election to fill the other seat left vacant by Republican Ben Sasse‚Äôsresignation."}, {"source": "cnn", "title": "Republican Sen. Rick Scott will win second term in Florida, CNN projects", "link": "https://www.cnn.com/2024/11/05/politics/florida-senate-rick-scott-wins/index.html", "content": "CNN—Republican Sen. Rick Scott will win a second term in Florida, CNN projects, defeating Democrat Debbie Mucarsel-Powell in a race that demonstrated the strength of the GOP in a state once considered one of the country‚Äôs premier political battlegrounds.With a return to the Senate next year assured, Scott is positioned to wage his uphill bid to succeed Mitch McConnell as Senate Republican leader in the new Congress. The secret-ballot vote is set to take place sometime after the election.Scott unsuccessfully challenged McConnell for his leadership position in 2022, as the Florida senator was coming off an underwhelming turn in charge of his party‚Äôs Senate campaign operation that cycle. But Scott‚Äôs odds of succeeding McConnell this time could benefit from his close relationship with his state‚Äôs most famous resident: former President Donald Trump.Scott‚Äôs victory over Mucarsel-Powell caps what ultimately was the least competitive race of a political career defined in part by exceptionally hard-fought contests. Scott narrowly won two terms as governor by about 1 percentage point in 2010 and 2014 and then unseated Democratic Sen. Bill Nelson in 2018 by 10,0000 votes out of 8.2 million ballots cast ‚Äî one of the closest statewide elections in Florida history.To win those races, Scott, a former health care executive and one of the country‚Äôs wealthiest elected officials, dipped deeply into his personal fortune, including a $63 million investment in his first Senate campaign. This time, though, he spent far less of his own money as Mucarsel-Powell, a former South Florida congresswoman, struggled to fundraise.Democrats made a late play for the seat as other paths to maintaining their Senate majority grew increasingly tenuous. In September, they announced a multimillion-dollar advertising push in Florida, a token investment in a historically expensive state to compete.There was hope, though, that Mucarsel-Powell could build on the enthusiasm surrounding Vice President Kamala Harris‚Äô entrance into the race. Democrats remained optimistic, too, that ballot measures to legalize recreational marijuana and expand abortion access in the state could give their Senate nominee a boost. Mucarsel-Powell campaigned aggressively on abortion in a state where it is now illegal for women to undergo the procedure after six weeks of pregnancy, unless their life is at risk or they‚Äôre the victim of rape or incest.However, Scott benefited greatly from a favorable shift in the state‚Äôs political makeup since he first entered the Senate. Six years ago, registered Democrats still outnumbered Republicans in Florida. Now, the GOP has a one million-voter advantage in the state, a deficit that has made it structurally difficult for Democrats to compete.After running neck and neck in all of his previous races, Scott never trailed Mucarsel-Powell, though the race certainly appeared to tighten in the closing months.Scott‚Äôs victory guarantees that Republicans will continue to hold every statewide office in Florida for at least two more years. In a second term, Scott has said he would prioritize putting term limits on members of Congress, shuttering federal agencies and building a wall along the US-Mexico border."}, {"source": "cnn", "title": "Republican Tim Sheehy will defeat Sen. Jon Tester in competitive Montana race, CNN projects", "link": "https://www.cnn.com/2024/11/06/politics/tim-sheehy-jon-tester-montana-senate/index.html", "content": "CNN—Republican Tim Sheehy will defeat three-term Montana Sen. Jon Tester, CNN projects, adding toRepublicans‚Äô newly won Senate majority.Montana has long been a deep-red state in presidential elections ‚Äî and every other statewide office is currently held by a Republican. But Tester, a seven-fingered dirt farmer who had cut a moderate profile on Capitol Hill, previously had defied political gravity with his wins in 2006, 2012 and 2018.Still, his seat ‚Äì alongside Democratic-held seats in two other red states, Ohio and West Virginia ‚Äì was a prime Republican target this year. RepublicansBernie Morenoand Jim Justice won those races, respectively.This year marked the first time Tester had to share the ballot with Trump, who won the state by 16 percentage points in 2020 and nearly 20 points in 2016 ‚Äî a reality that meant the Democratic incumbent needed to out-run the top of his party‚Äôs ticket by double digits to be competitive.Former first lady Melania Trump, former President Donald Trump and Barron Trump at the Palm Beach County Convention Center in West Palm Beach, Florida, on Wednesday, November 6.Will Lanzoni/CNNRelated articleTrump will win second term, CNN projects, in historic comeback after losing four years agoDemocrats cast Sheehy, a retired Navy SEAL, as an out-of-state millionaire with questionable ranching credentials and commitment to public land ‚Äì the same playbook used against Republican Matt Rosendale in 2018.Sheehy moved to Montana in 2014 after leaving the military, but Republicans believed carpetbagging attacks would have limited appeal in a state that is home to more transplants after the coronavirus pandemic.In the closing weeks of the race, Democrats stepped up their attacks over Sheehy‚Äôs conflicting story from nearly a decade ago over how a bullet became lodged in his arm. Outside groups ran ads featuringthe park rangerwhom Sheehy told that his gun had accidentally discharged in Glacier National Park and anotherspotfeaturing a retired Navy SEAL who served with Sheehy and insisted the candidate didn‚Äôt receive the bullet wound in Afghanistan, saying, ‚ÄúThere‚Äôs no honor in lying about your service.‚ÄùRepublicans, for their part, attempted to tie Tester ‚Äî who did not attend the Democratic National Convention or endorse in the presidential race ‚Äî to President Joe Biden‚Äôs administration and Democratic congressional leadership.One big question mark hovering over the race was a ballot measure that would enshrine the right to an abortion in Montana‚Äôs constitution. Such ballot measures have prevailed even in deep-red states since the Supreme Court overturned Roe v. Wade in 2022 and become a political boon for Democrats.Montana Republicans have pushed and enacted a series of abortion restrictions in recent years but have seen those largely struck down as unconstitutional by state courts."}, {"source": "cnn", "title": "Josh Stein will win North Carolina governor’s race, CNN projects", "link": "https://www.cnn.com/2024/11/05/politics/josh-stein-north-carolina-governors-race/index.html", "content": "CNN—Democratic state Attorney General Josh Stein will win North Carolina‚Äôs gubernatorial race, CNN projects, defeating Republican Lt. Gov. Mark Robinson, whose campaign struggled ashis history of incendiary remarksbecame public.Stein, who is currently serving his second term as attorney general, will become the state‚Äôs first Jewish governor. He will replace incumbent Democratic Gov. Roy Cooper, who is term-limited.Stein‚Äôs victory is a boon to Democrats as they have looked to the governorship to serve as a check on Republicans, who control both chambers of the legislature. The result also comes as little surprise.Though Democrats predicted a competitive race in the state, Robinson‚Äôs history of inflammatory comments ultimately doomed his campaign.‚ÄúTonight, the people of North Carolina resoundingly embraced a vision that‚Äôs optimistic, forward-looking and welcoming ‚Äî a vision that is about creating opportunity for every North Carolinian,‚Äù Stein told supporters at his election night party Tuesday in Raleigh.Robinson said in his concession speech that he was proud of the race he ran and left the door open to pursuing higher office in the future.‚ÄúThe only disappointment that I have inside of me is the disappointment that you all feel, because I know so many of you wanted so bad to see nothing but victory tonight,‚Äù Robinson said. ‚ÄúBut remember, victory is pleasing God.‚ÄùState and national Republicans distanced themselves from Robinson aftera CNN KFile report found that Robinson had made dozens of disturbing postson a pornography website‚Äôs message board more than a decade ago, in which he called himself a ‚Äúblack Nazi‚Äù and a ‚Äúperv,‚Äù admitted to watching women undress in a locker room and expressed support for reinstating slavery.Robinson denied that he made the posts, which were tied to a username CNN was able to identify as Robinson by matching a litany of biographical details and a shared email address between the two. Ahead of and after the story‚Äôs release, Robinson rejected calls from Republicans to drop out of the race.In the months prior to the porn-forum report, Stein led Robinson in polls and fundraising, while blasting him in TV ads over his history of inflammatory comments, particularly denigrating women and opposing abortion access. Robinson also had a long history of making antisemitic comments and targeting LGBTQ community victims of school shootings.He also failed to gain the endorsement of key Republicans in the state, including former Gov. Pat McCrory and Sen. Thom Tillis, who endorsed one of Robinson‚Äôs opponents in the GOP gubernatorial primary.Stein, meanwhile, ran on his record as state attorney general, specifically his work closing North Carolina‚Äôs rape-kit backlog, which had become one of the largest in the country.In Stein‚Äôs stump speech, he warned that the state couldn‚Äôt afford ‚Äújob-killing culture wars,‚Äù a reference to his opponent and to 2016 legislation that required transgender people to use the bathroom corresponding with the gender on their birth certificate. The state faced widespread boycotts and protests before it was rolled back in 2017.Born in Washington, DC, Stein‚Äôs family relocated to North Carolina when he was young. His father, Adam Stein, co-founded the state‚Äôs first racially integrated law firm. Stein received a bachelor‚Äôs degree from Dartmouth College and his law degree from Harvard University.Republicans hoped that Robinson‚Äôs humbler beginnings would help him better relate to working-class voters. The lieutenant governor grew up in poverty, the ninth of 10 kids, and spoke frequently of how his mother raised the family after his father died. He pointed to his time working at factory jobs that laid him off as jobs were sent overseas.Robinson‚Äôs political career began in 2018, when he delivered a viral speech at a Greensboro city council meeting in defense of gun owners‚Äô rights in the wake of the Parkland, Florida, school shooting. Two years later, he was elected lieutenant governor.This story has been updated with the candidates‚Äô remarks Tuesday night."}, {"source": "cnn", "title": "Republican Kelly Ayotte will win New Hampshire governor’s race in political comeback, CNN projects", "link": "https://www.cnn.com/2024/11/06/politics/kelly-ayotte-new-hampshire-governors-race/index.html", "content": "CNN—Republican former Sen. Kelly Ayotte will win the New Hampshire governor‚Äôs race, CNN projects, completing a political comeback eight years after she lost her Senate seat.Ayotte defeated Democratic former Manchester Mayor Joyce Craig in the race to replace outgoing GOP Gov. Chris Sununu.The race was a test of whether local interests or the national political atmosphere would play the most important role in influencing Granite State voters. Republicans sought to localize the race, hammering Craig on Manchester‚Äôs drug and homelessness problems during her time as mayor. Democrats attempted to nationalize it, tying Ayotte to former President Donald Trump and attacking her on abortion rights.The tactics made sense: New Hampshire has a long history of ticket-splitting but has trended increasingly more Democratic in national contests. Hillary Clinton won there by just half a point in 2016, but President Joe Biden won by 7 points in 2020.It‚Äôs the second time Ayotte shared the GOP ticket with Trump. She was ousted from her Senate seat in 2016 by Maggie Hassan after a single term.Ayotte withdrew her endorsement of the former president in 2016 in the wake of the ‚ÄúAccess Hollywood‚Äù tape‚Äôs release but supported Trump this year.After that 2016 loss, she helped shepherd Trump Supreme Court nominee Neil Gorsuch through the confirmation process in 2017. She also served on a number of corporations‚Äô boards of directors after her Senate term ended.Craig was mayor of Manchester from 2018 through the beginning of this year, when she opted not to seek reelection after three two-year terms."}, {"source": "cnn", "title": "7 states vote to protect abortion rights, while efforts to expand access in Florida and South Dakota fail", "link": "https://www.cnn.com/2024/11/05/politics/abortion-state-ballot-measure-dg/index.html", "content": "CNN—More than two years after the US Supreme Court overturned Roe v. Wade and ended the federal constitutional right to an abortion, voters in 10 states cast ballots on whether to cement reproductive rights in their state constitutions.ÔªøMeasures to protect abortion access will pass in Arizona and Missouri, where citizens effectively voted to overturn their state‚Äôs abortion bans. Abortion rights supporters are hopeful this will lead to a widespread increase in access to reproductive care in those states.Similar measures will pass in Colorado, New York, Maryland, Montana and Nevada, cementing or expanding current abortion access. And measures to protect abortion failed in Florida, where the procedure is banned six weeks into pregnancy, and South Dakota, where it is banned, except to save the life of the mother.In Nebraska, an amendment cementing the state‚Äôs current 12-week abortion ban in the state constitution will pass, while a competing amendment to codify the right to an abortion will fail, CNN projects.Since Roe was overturned in 2022,seven stateshad seen a popular vote on abortion rights prior to this year. Every measure aimed at protecting access passed, while all measures to restrict it failed.NebraskaVoters in Nebraska will approve a measure to enshrine the state‚Äôs current 12-week abortion ban into the state‚Äôs constitution, with exceptions for rape, incest and medical emergencies, CNN projects.The measure was one of two abortion-related initiatives on the ballot in Nebraska. Voters are projected to reject a competing measure to enshrine the right to an abortion until viability or to protect the health of the pregnant woman in the state‚Äôs constitution.This year marked the first time in state history that two conflicting petition effortsmade the same ballot. Organizers campaigned fiercely to get their respective measures on the ballot ‚Äì with each side accusing the other of usingmisleading tactics.MissouriVoters in Missouri will approve a measure to enshrine the right to an abortion up to the point of viability in the state‚Äôs constitution, CNN projects.The measure will establish a right to make reproductive care decisions without government interference and protect those seeking or providing care from government discrimination.The projected win for reproductive rights advocates will greatly expand access to abortion in the state, where the procedure is currently banned with no exceptions for rape or incest. Doctors believe fetus viability to be around 22 to 24 weeks of pregnancy.South DakotaVoters in South Dakota will reject a measure that would have guaranteed a constitutional right to an abortion ‚Äì with regulations ‚Äì during the first and second trimesters of pregnancy, CNN projects.Reproductive rights advocates were hopeful this measure would return abortion access to pregnant survivors of rape or incest, who have no abortion options under the state‚Äôs current law.NevadaNevada voters will approve a measure that would establish the fundamental right to an abortion up to the point of fetal viability in the state‚Äôs constitution, CNN projects. To amend the constitution, however, Nevada voters will still have to approve the measure again in 2026.MontanaCNN projects that voters in Montana will approve a measure to amend the state‚Äôs constitution to protect the right to make decisions about one‚Äôs own pregnancy ‚Äì including the right to an abortion ‚Äì through fetal viability or when needed to protect the pregnant patient‚Äôs life or health.While abortion is currently legal through viability in Montana, the measure will shore up the right to the procedure in Montana by enshrining a 1999 state Supreme Court ruling. Republican Gov. Greg Gianforte signed a law in 2023 that specified that access to an abortion is no longer protected under the right of privacy in the state‚Äôs constitution, challenging that precedent.ArizonaArizona voters will approve a measure to enshrine the right to an abortion in the state constitution up to fetal viability, CNN projects.The win for reproductive rights advocates will expand access to the procedure in the state, which currently bans abortion at 15 weeks into pregnancy. Doctors believe fetus viability to be around 22 to 24 weeks.The Arizona State Supreme Court voted in April to uphold aCivil War-era total ban on abortion, sparking national outrage and prompting state lawmakers to repeal the ban before it could take effect. Abortion rights supporters said the moment served as a stark reminder of what could come if reproductive rights weren‚Äôt enshrined in the state constitution.ColoradoColorado voters will approve a measure to enshrine the right to an abortion in the state constitution, CNN projects. While abortion remains legal in the state with no gestational limit, the approval of the amendment means public funds can be used toward abortions.That will clear the way for the state to potentially cover abortions under Medicaid and some state employee health insurance plans. Abortion rights supporters say this will go a long way toward expanding abortion access, especially among low-income individuals.MarylandVoters in Maryland will approve a measure to enshrine reproductive protections, including the right to end a pregnancy, in the state‚Äôs constitution, CNN projects. The procedure is already legal in the state with no gestational limit.In 2023, Maryland enacted a shield law protecting its abortion providers from investigations by other states. While the state‚Äôs vote will have little impact on abortion access for its own residents, proponents say it‚Äôs important to solidify reproductive freedoms in a state that has become an access point for out-of-state patients.New YorkCNN projects that New York voters will approve a measure that would amend the equal protection clause of the state‚Äôs constitution to say that a person‚Äôs rights cannot be denied due to ‚Äúpregnancy, pregnancy outcomes, and reproductive healthcare and autonomy.‚ÄùThe amendment survived several legal challenges to make it onto the state ballot. It seeks to provide protections against discrimination due to a number of factors, including pregnancy outcomes, age, disability, sexual orientation and gender identity. While proponents focused on abortion rights, opponents used the measure‚Äôs broad nature to raise concerns about transgender and parental issues.FloridaA Florida measure to protect the right to an abortion up to the point of viability will fail, CNN projects. Although the measure is projected to receive a majority of votes, it will not meet the 60% voter threshold needed to pass.Both abortion rights supporters and opponents campaigned fiercely on the issue. A federal judge recently accused officials of Republican Gov. Ron DeSantis‚Äô administration of attempting toviolate First Amendment rightsin their campaign against the ballot measure.The Sunshine State once served as acritical access pointfor patients from Southern states with more restrictive abortion policies.This story and headline have been updated with additional information."}, {"source": "cnn", "title": "8 states will vote to bar noncitizen voting, CNN projects, something already illegal in federal elections", "link": "https://www.cnn.com/2024/11/03/politics/noncitizen-voting-ballot-measures-election/index.html", "content": "CNN—Voters in eight states, most of them heavily Republican, will approve ballot measures to require US citizenship to vote, CNN projects, even though it isalready illegalfor noncitizens to cast ballots in federal elections.The victorious ballot measures in Idaho, Iowa, Kentucky, Missouri, North Carolina, Oklahoma, South Carolina and Wisconsin come on the heels of House Republicanspassing a billwith a similar goal this summer and with formerPresident Donald Trumpand his alliesstoking fears of voter fraudahead of the election.CNN has fact-checkedthe Republican allegations of widespread noncitizen voting and found only a tiny number of examples of noncitizens voting in elections when they were ineligible to do so. Inone recent example, Michigan prosecutors charged a Chinese citizen with voter fraud and perjury after he allegedly cast a ballot in the 2024 election.Here are the state ballot measures on noncitizen voting projected to be approved:IdahoIdaho voters will approve a ballot measure to amend the state‚Äôs constitution to add a sentence saying that noncitizens are barred from voting in any election within the state, CNN projects.The Idaho Constitution says that ‚Äúevery male or female citizen of the United States‚Äù who meets certain age and residency requirements is eligible to vote in the state.A few municipalities across the country allow noncitizens to vote in certain local elections, includingWashington, DC, but none in Idaho.IowaCNN projects Iowa voters will approve a ballot measure that addresses noncitizen voting as part of a broader amendment to the state constitution, which will also update the voting age to reflect the federal standard.Iowa‚Äôs Constitutioncurrently lists the required age of voting as 21, even though it has been abiding by the 26th Amendment of the US Constitution, which set the voting age at 18.Theconstitutional amendmentwill alter the language to say that ‚Äúonly a citizen of the United States of the age of eighteen years‚Äù and only a resident of the state can vote ‚Äì changing both the age and using the phrase ‚Äúonly a citizen‚Äù instead of ‚Äúevery citizen.‚ÄùKentuckyKentucky voters will approve aballot measureto make an addition to the state‚Äôs constitution saying that ‚ÄúNo person who is not a citizen of the United States shall be allowed to vote in this state.‚ÄùThesection of the Kentucky Constitutionthat this measure will amend already lists citizenship as one of the requirements to vote.MissouriMissouri voters will approve an amendment to the state‚Äôs constitution to assert that ‚Äúonly citizens of the United States‚Äù can vote in elections, CNN projects.Currently, the state constitution says, ‚ÄúAll citizens of the United States‚Äù over the age of 18 and those who reside in Missouri ‚Äúare entitled to vote at all elections.‚ÄùThe amendment will also outlaw ranked-choice voting, which allows voters to rank candidates in order of preference.North CarolinaNorth Carolina voters will approve a ballot measure to change the section of the state constitution that lists the requirements to vote, CNN projects.The state constitution currently says that ‚Äúevery person born in the United States and every person who has been naturalized‚Äù can vote in North Carolina, provided they are over the age of 18 and a resident. With the projected approval of the amendment, the text will be changed to say that ‚Äúonly a citizen of the United States‚Äù who has met the other requirements may vote.The projected result is a win for North Carolina‚Äôs GOP supermajority, which advanced the measure to the ballot.OklahomaCNN projects that Oklahoma voters will approve aballot measureto change the state‚Äôs constitution to say that ‚Äúonly‚Äù instead of ‚Äúall‚Äù citizens who are residents of the state and over the age of 18 are ‚Äúqualified‚Äù to vote.The measure landed on the ballot after Oklahoma‚Äôs Republican-dominatedLegislature voted to advanceit.South CarolinaCNN projects South Carolina voters will approve an amendment to the state‚Äôs constitution to say that ‚Äúonly a citizen of the United States and of this State‚Äù who is at least 18 years of age and ‚Äúproperly registered‚Äù can vote.The state constitution currently says that ‚Äúevery citizen‚Äù can vote if the other requirements are met.The state‚Äôs GOP-led Legislature passed a bill to put this measure on the ballot.WisconsinWisconsin voters will approve an amendment to the state‚Äôs constitution that targets noncitizen voting, CNN projects.Wisconsin‚Äôs Constitution currently says that ‚Äúevery United States citizen‚Äù who is over the age of 18 and a resident can vote. The projected result will change the language to state that ‚Äúonly‚Äù citizens can vote if they meet the other requirements.The state‚Äôs GOP-led legislaturevoted to addthe measure on the November ballot.This story and headline have been updated.CNN‚Äôs Clare Foran, Haley Talbot and Daniel Dale contributed to this report."}, {"source": "cnn", "title": "Hochman elected Los Angeles County district attorney, ousting progressive Gascón", "link": "https://www.cnn.com/2024/11/06/politics/los-angeles-district-attorney-nathan-hochman/index.html", "content": "CNN—Nathan Hochman defeated George Gasc√≥n in the race for Los Angeles County district attorney, unseating an incumbent known as the godfather of progressive prosecutors.Hochman, a former federal prosecutor,  calls himself a ‚Äúhard middle‚Äù candidate who would reject both mass  incarceration and the ‚Äúpublic safety failure‚Äù of Gasc√≥n‚Äôs tenure the  past four years.He advanced out of aprimary field of 11 challengersand spent most of the campaign attacking Gasc√≥n policies that he says  led to increased crime and a lack of consequences for juvenile  offenders. During debates, he spotlighted rising violent crime in the  county since 2019, a trend also seen statewide.‚ÄúThe voters of Los  Angeles County have spoken and have said enough is enough of D.A.  Gasc√≥n‚Äôs pro-criminal extreme policies; they look forward to a safer  future,‚Äù Hochman said in a statement early Wednesday. ‚ÄúAs D.A., I look  forward to representing all of the people, whether they voted for me or  not, since their safety will be my responsibility.‚ÄùGasc√≥n conceded the race to Hochman and called him Wednesday, his campaign said.‚ÄúThe  rightward shift across America last night is heartbreaking. Democrats  have a long road ahead, but the work is more vital than ever and our  commitment will not waver,‚Äù Gasc√≥n said in a statement. ‚ÄúI‚Äôm deeply  proud of what we‚Äôve accomplished over the past four years and grateful  to the communities who have been and will always be the heart of  criminal justice reform.‚ÄùMike Schmidt, left, and Nathan Vasquez. MS20586485, MS20649322KATU/KPTVRelated articleCentrist challenger defeats progressive DA in Portland, CNN projectsHochman‚Äôs victory reflectsgrowing discontentin the state with progressive district attorneys who have pushed criminal justice reform. Previously there were two attempts to recall Gasc√≥n that failed to qualify for the ballot. San Francisco voters ousted one of the first reform-minded prosecutors elected to office in 2022. Oakland voters were asked in Tuesday‚Äôs electionwhether to recalltheir own district attorney, Pamela Price, another progressive prosecutor, but it was too early to call.Gasc√≥n  co-authored a ballot measure passed by California voters in 2014 that  reclassified certain low-level drug and property crimes as misdemeanors  instead of felonies. Also Tuesday, votersapproved a measureto partly roll back that law, making shoplifting a felony for repeat  offenders again and increasing penalties for some drug charges.Despite Gasc√≥n being a former Los Angeles police officer, Hochman had the support of local police unions.He  was also endorsed by victims‚Äô advocacy groups; former district attorney  Jackie Lacey, whom Gasc√≥n defeated in 2020; developer and former  mayoral candidate Rick Caruso; and more than 70 current and former  county elected officials. Hochman raised nearly $4 million for the  campaign.Hochman‚Äôs victory was applauded by the prosecutors‚Äô  union, which in a statement called it a ‚Äúpivotal moment in the fight to  return balance and accountability to the justice system.‚ÄùA Southern California native, Hochman emphasized his past prosecutorial experience as assistant US attorney in California‚Äôs Central District. He has also practiced as a private defense attorney.He previously  ran unsuccessfully for California attorney general as a Republican, but  was an independent in this race and describes himself as a lifelong  centrist."}, {"source": "cnn", "title": "Sarah McBride will win open Delaware seat, becoming first transgender person in Congress, CNN projects", "link": "https://www.cnn.com/2024/11/05/politics/sarah-mcbride-delaware-transgender-congress/index.html", "content": "CNN—Sarah McBride, a Delaware state senator, will win her state‚Äôs at-large US House seat, making her the first out transgender person to serve in Congress, CNN projects.The at-large seat was vacated when outgoing Rep. Lisa Blunt Rochester opted to run for the state‚Äôs open US Senate seat.Despite running in a reliably blue state, McBride emphasized her work leading a bipartisan push to pass paid family and medical leave in the state. She also touted support from unions and work to raise the state minimum wage. Though she didn‚Äôt lean on the historic nature of her run, she alluded to a broader theme of respect ‚Äì specifically, that everyone deserves a member of Congress that respects them and their families.The incoming congresswoman is a close ally of President Joe Biden and has been credited with helping shape Biden‚Äôs view of LGBTQ issues. McBride entered Biden‚Äôs orbit in 2006, when she worked for the late Beau Biden‚Äôs attorney general campaign. Beau Biden was also a strong backer of the 2013 transgender protections legislation that McBride advocated for in Delaware.Sarah McBride speaks on introduction of the Equality Act, a comprehensive LGBTQ non-discrimination bill at the US Capitol on April 01, 2019 in Washington, DC.Tasos Katopodis/Getty ImagesThe president wrote the foreword to McBride‚Äôs 2018 memoir ‚ÄúTomorrow Will Be Different.‚Äù The book lays out McBride‚Äôs experiences as a transgender rights activists and her personal story, including meeting her late husband Andrew Cray, who she met at a White House LGBTQ pride event in 2012. Cray, a transgender man and fellow activist, died of cancer in 2014 just days after the two married.McBride, a former spokesperson for the Human Rights Campaign, an LGBTQ rights group, has made history throughout her public life. In 2012, as a senior and student body president at American University, she made national news when she announced she was transgender in an op-ed in the school‚Äôs paper.At the time, McBride wrote about her concerns that her gender identity would not be compatible with her goals of running for office.‚ÄúI now know that my dreams and my identity are only mutually exclusive if I don‚Äôt try,‚Äù she wrote.Four years later, McBride became the first transgender person to address a national party convention, when she spoke at the 2016 Democratic National Convention.And in 2020, McBride became the first out transgender person elected to serve in a state Senate, when she was elected to represent a seat in northern Delaware."}, {"source": "cnn", "title": "President results map", "link": "https://www.cnn.com/election/2024/results/president", "content": ""}, {"source": "cnn", "title": "Senate results map", "link": "https://www.cnn.com/election/2024/results/senate", "content": ""}, {"source": "cnn", "title": "House results map", "link": "https://www.cnn.com/election/2024/results/house", "content": ""}, {"source": "cnn", "title": "Governor results map", "link": "https://www.cnn.com/election/2024/results/governor", "content": ""}, {"source": "cnn", "title": "Ballot measures across the country", "link": "https://www.cnn.com/election/2024/results/ballot-measures", "content": ""}, {"source": "cnn", "title": "Exit polls results", "link": "https://www.cnn.com/election/2024/exit-polls", "content": ""}, {"source": "cnn", "title": "Elecciones en CNN en Español", "link": "https://cnnespanol.cnn.com/", "content": ""}, {"source": "cnn", "title": "Build your own projection map", "link": "https://www.cnn.com/election/2024/electoral-college-map", "content": ""}, {"source": "cnn", "title": "Ver resultados completos en español", "link": "https://cnnespanol.cnn.com", "content": ""}, {"source": "cnn", "title": "Ver todos los resultados presidenciales completos", "link": "https://cnnespanol.cnn.com/eeuu/elecciones/resultados-presidente-2024", "content": ""}, {"source": "cnn", "title": "Ver todos los resultados del senado", "link": "https://cnnespanol.cnn.com/eeuu/elecciones/resultados-senado-2024", "content": ""}, {"source": "cnn", "title": "Ver todos los resultados de la cámara", "link": "https://cnnespanol.cnn.com/eeuu/elecciones/resultados-camara-representantes-2024", "content": ""}, {"source": "cnn", "title": "Trump’s Sweeping Victory, Explained", "link": "https://www.cnn.com/audio/podcasts/political-briefing/episodes/95d0e13a-a9b6-11ee-91bf-074404f61546", "content": ""}, {"source": "cnn", "title": "The Dawn of a New Era", "link": "https://www.cnn.com/audio/podcasts/cnn-politics/episodes/fb26eba0-79c8-11ef-a3b5-3f27e2d7a74a", "content": ""}, {"source": "cnn", "title": "Latino Men Wanted Trump. Why?", "link": "https://www.cnn.com/audio/podcasts/the-assignment/episodes/88c45adc-4b94-11ef-ba2a-0ba91050da18", "content": ""}, {"source": "cnn", "title": "Do Democrats Need to Rip Up Their Political Playbook?", "link": "https://www.cnn.com/audio/podcasts/one-thing/episodes/d1a82578-96ec-11ef-8815-1fe9c5e2da57", "content": ""}, {"source": "cnn", "title": "Zoom in on the Republican national map", "link": "https://www.cnn.com/election/2024/primaries-and-caucuses/results/republican-party/president", "content": ""}, {"source": "cnn", "title": "Zoom in on the Democratic national map", "link": "https://www.cnn.com/election/2024/primaries-and-caucuses/results/democratic-party/president", "content": ""}, {"source": "cnn", "title": "Exit poll results for 2024 presidential primaries and caucuses.", "link": "https://www.cnn.com/election/2024/primaries-and-caucuses/exit-polls/south-carolina/republican-primary/0", "content": ""}, {"source": "cnn", "title": "Which states determined the 2020 election", "link": "https://www.cnn.com/election/2020/results/president", "content": ""}, {"source": "cnn", "title": "Meanwhile in America newsletter", "link": "https://www.cnn.com/newsletters/meanwhile-in-america", "content": ""}, {"source": "cnn", "title": "What Matters newsletter", "link": "https://www.cnn.com/newsletters/what-matters", "content": ""}, {"source": "cnn", "title": "The Axe Files with David Axelrod", "link": "https://www.cnn.com/audio/podcasts/axe-files", "content": ""}, {"source": "cnn", "title": "CNN Political Briefing podcast", "link": "https://www.cnn.com/audio/podcasts/political-briefing", "content": ""}]