[{"source": "foxnews", "title": "House Dem moves to force vote on releasing Gaetz ethics report", "link": "https://www.foxnews.com/politics/house-dem-moves-force-vote-releasing-gaetz-ethics-report", "content": "Air Force veteran and Trump Transition team adviser Jeff Witt joined 'Fox & Friends First' to announce his candidacy for Florida's 1st congressional district and reveal what America-first issues would be most important to him if elected.\nA Democratic lawmaker is moving to force a vote on releasing the results of the House Ethics Committee's report intoformer Rep. Matt Gaetz, R-Fla.\nRep. Sean Casten, D-Ill., introduced legislation on Tuesday afternoon aimed at mandating a House-wide vote on whether to make the Gaetz report public.\nHe introduced it as a \"privileged resolution,\" a mechanism that forces House leaders to consider it within two legislative days – putting the deadline on Thursday.\nHACKER OBTAINS HOUSE ETHICS TESTIMONY ON MATT GAETZ AS TRUMP MAKES CALLS FOR AG NOMINEE\nFormer Rep. Matt Gaetz has been the subject of a multi-year investigation by the House Ethics Committee.(Leon Neal/Getty Images)\nThe House Ethics Committee's multi-year investigation into Gaetz, involving allegations of sex with a minor and illicit drug use, came to an abrupt halt last month after he resigned from Congress hours after President-elect Donald Trump tapped him to be his attorney general.\nGaetz dropped out of consideration amid quiet but steadyGOP opposition, but the committee nevertheless lost jurisdiction over the probe when Gaetz left the House of Representatives.\nHis resignation came just before the committee was expected to meet to consider releasing the report.\nGaetz has consistently denied any accusations of wrongdoing.\nAn earlier federal investigation into the allegations ended without charges against Gaetz.\nGET TO KNOW DONALD TRUMP'S CABINET: WHO HAS THE PRESIDENT-ELECT PICKED SO FAR?\nRep. Sean Casten is aiming to force a vote on the committee's report(Tom Williams/CQ-Roll Call, Inc via Getty Images)\nIt's highly unusual for the House Ethics Committee, a panel normally shrouded in secrecy, to release reports on lawmakers who have left office. It's a detail House Speaker Mike Johnson, R-La., raised when telling reporters last month that he was against releasing the report.\nBut it's not unheard of, as Casten pointed out on Tuesday.\n\"The Committee on Ethics has, on many occasions, released its reports on former members,\" Casten said in a statement. \"Resigning from Congress should not allow Members to avoid accountability for allegations as serious as those faced by Matt Gaetz. Withholding this report from the American people would impede the dignity and integrity of the legislative proceedings of the House.\"\nCasten introduced a similar resolution last month, but his office said it was allowed to expire by House GOP leaders over the Thanksgiving break.\nThe new resolution will likely not be sidelined so easily, with the House expected in session from now until Friday.\nRep. Susan Wild, the top Democrat on the Ethics Committee, hinted that the vote on releasing it fell along party lines last month.(Alex Wong/Getty Images)\nThe last day to consider the resolution will be Thursday, the same day the Ethics Committee will meet after previously failing tocome to an agreementon releasing the Gaetz report.\nCLICK HERE TO GET THE FOX NEWS APP\nRep. Susan Wild, D-Pa., the top Democrat on the panel, hinted that the vote to do so fell along party lines.\n\"I'd say that a vote was taken. As many of you know, this committee is evenly divided between Democrats and Republicans, five Dems, five Republicans, which means that in order to affirmatively move something forward, somebody has to cross party lines and vote with the other side – which happens a lot, by the way, and we often vote unanimously,\" Wild told reporters after the last meeting. \"That did not happen in today's vote.\"\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com"}, {"source": "foxnews", "title": "Israel's Netanyahu reacts after Trump warns of 'hell to pay' if Hamas doesn't free hostages", "link": "https://www.foxnews.com/world/israels-netanyahu-reacts-after-trump-warns-hell-pay-hamas-doesnt-free-hostages", "content": "Hudson Institute senior institute Rebeccah Heinrichs assesses the state of the Israeli-Hezbollah ceasefire, discusses Syrian rebels seizing parts of Aleppo and how the U.S. can aid in negotiations to end the Russia-Ukraine war.\nIsraeli Prime Minister BenjaminNetanyahusays President-elect Donald Trump is in the \"right place\" when it comes to his warning of there being \"hell to pay\" if Hamas doesn’t release their remaining hostages.\n\"President Trump put the emphasis in the right place, on Hamas, and not on the Israeli government, as is customary [elsewhere],\" Netanyahu said Tuesday at the beginning of a cabinet meeting,according to Reuters.\nTrump on Monday called on Hamas to release all hostages prior to when he takes office on Jan. 20.\nIn a Truth Social post, Trump said nothing was being done to free those being held by the Iran-backed terror group since Oct. 7, 2023, after Hamas attacked Israel and killed at least 1,200 people and kidnapped at least 250 others. Of the 101 hostages that remain in Gaza, seven are Americans.\nAMERICAN-ISRAELI IDF PLATOON COMMANDER KILLED IN BATTLE, BODY HELD IN GAZA, IDF SAYS\nFormer President Donald Trump shakes hands with Israeli Prime Minister Benjamin Netanyahu as they pose for a photo during their meeting at Trump's Mar-a-Lago estate in Palm Beach, Florida, on July 26, 2024.(Amos Ben-Gershom (GPO) / Handout/Anadolu via Getty Images)\n\"Everybody is talking about the hostages who are being held so violently, inhumanely, and against the will of the entire World, in the Middle East – But it’s all talk, and no action!\"Trump wrote.\n\"Please let this TRUTH serve to represent that if the hostages are not released prior to January 20, 2025, the date that I proudly assume Office as President of the United States, there will be ALL HELL TO PAY in the Middle East, and for those in charge who perpetrated these atrocities against Humanity,\" Trump added.\n7 US HOSTAGES ARE STILL HELD BY HAMAS TERRORISTS\nIsraeli Prime Minister Benjamin Netanyahu makes a televised statement on Nov. 26, 2024, in Jerusalem, Israel.(Israeli Government Press Office via AP)\nThe message also drew support from Israeli Finance Minister Bezalel Smotrich.\nHamas terrorists are still holding 101 hostages in the Gaza Strip.(Yousef Masoud/Majority World/Universal Images Group via Getty Images)\nCLICK HERE TO GET THE FOX NEWS APP\n\"This is the way to bring back the hostages: by increasing the pressure and the costs for Hamas and its supporters, and defeating them, rather than giving in to their absurd demands,\" Reuters quoted him as saying.\nFox News’ Louis Casiano contributed to this report.\nGreg Norman is a reporter at Fox News Digital."}, {"source": "foxnews", "title": "Dem Rep. Dean Phillips blasts Biden after Hunter pardon, says some people ‘are indeed above the law’", "link": "https://www.foxnews.com/politics/dem-rep-dean-phillips-blasts-biden-after-hunter-pardon-some-people-are-indeed-above-law", "content": "OutKick founder Clay Travis joins 'The Faulkner Focus,' criticizes President Biden as 'a complete and total liar' after issuing a pardon for his son Hunter and calls on President-elect Trump to pardon all January 6 rioters.\nA Democratic U.S. congressman on Monday said it appears that certain people are \"above the law\" afterPresident Bidenpardoned his son, Hunter Biden, despite repeatedly saying he would not give his son a pass.\nRep. Dean Phillips, D-Minn., responded to Biden’s decision to pardon Hunter on social media, blasting the president’s own words from earlier this year that \"no one is above the law.\"\n\"Let’s just say the quiet part out loud, certain Americans are indeed above the law and influence is always for sale,\" Phillips wrote on X. \"It’s time for the exhausted majority to condemn and confront legalized corruption.\"\nPresident Biden issued a sweeping pardonfor Hunter Biden on Sunday after he had repeatedly said he would not do so. The first son had been convicted in two separate federal cases earlier this year. He pleaded guilty to federal tax charges in September, and was convicted of three felony gun charges in June after lying on a mandatory gun purchase form by saying he was not illegally using or addicted to drugs.\nHUNTER BIDEN GUN CASE TERMINATED AFTER PARDON, BUT FEDERAL JUDGE STOPS SHORT OF FULL DISMISSAL\nPhillips called out the \"legalized corruption\" in politics and argued that pardoning powers have been \"abused\" by presidents of both major political parties.(Reuters/Tom Brenner, File)\nThe presidentargued in a statementthat Hunter was \"singled out only because he is my son\" and that there was an effort to \"break Hunter\" in order to \"break me.\"\nBiden had stated on record multiple times that hewould not pardon Huntershould a jury convict his son.\nPresident Joe Biden pardoned his son Hunter Biden on Sunday.(AP Photo/Jose Luis Magana)\nPhillips, who unsuccessfully ran for the Democratic nomination for president, argued that perhaps both Hunter Biden and Trump may not have been charged in their respective criminal cases under different circumstances.\n\"Two things can be true at once: Neither Hunter Biden nor Donald Trump would have been charged with certain crimes had they not been political figures,\" he wrote. \"Pardoning powers have been abused by Trump and now Biden, and must be reformed.\"\nTAPPER SAYS BIDEN LYING ABOUT PARDONING HUNTER MAKES HIS ADMIN AND ALLIES ‘EITHER CREDULOUS OR COMPLICIT’\nThe pardon has beenmet with widespread criticismfrom Republicans, some Democrats and the media.\nReporters grilled White House press secretary Karine Jean-Pierre on Monday, asking whether Biden and his surrogates lied to the American people.Jean-Pierre responded,\"One thing the president believes is to always be truthful with the American people,\" and repeatedly pointed to Biden’s own statement on the matter.\nCLICK TO GET THE FOX NEWS APP\nBiden has yet to take questions from reporters on why he broke his pledge to Americans and decided to pardon the first son.\nFox News Digital's Alexander Hall contributed to this report."}, {"source": "foxnews", "title": "Elon Musk and Vivek Ramaswamy agree on 'need to scrutinize' US funding for NGOs", "link": "https://www.foxnews.com/politics/elon-musk-vivek-ramaswamy-agree-need-scrutinize-us-funding-ngos", "content": "The 'Outnumbered' panel weighs in on the Department of Government Efficiency's effort to slash wasteful government spending under the leadership of Elon Musk and Vivek Ramaswamy.\nElon Musk andVivek Ramaswamy— the duo President-elect Donald Trump tapped for the effort known as the Department of Government Efficiency (DOGE) — have indicated that they plan to examine funding for non-governmental organizations (NGOs).\n\"We need to scrutinize U.S. government funding of 'non-government organizations,'\" Ramaswamy noted in a post on X. \"It's an oxymoron that represents a waste of taxpayer dollars, but the real problem runs deeper: Americans deserve transparency on opaque foreign aid & nonprofit groups abetting our own border crisis.\"\nMusk agreed, commenting, \"Absolutely.\"\nELON MUSK SAYS THERE'S SUBSTANTIAL IGNORANCE ABOUT AMERICA'S NATIONAL DEBT\nElon Musk and Vivek Ramaswamy will head the Department of Government Efficiency (DOGE).(Getty Images)\nHe also agreed with his brother Kimbal Musk, who suggested that NGOs are \"mouthpieces\" for governments that \"need to go.\"\n\"NGO’s are the govt’s way of creating mouthpieces that promote their agenda and push for censorship without the normal checks and balances that govt has to follow. They need to go,\" Kimbal Musk declared in a tweet.\n\"Yes,\"Elon Muskreplied.\nELON MUSK WANTS TO MEET ALEX SOROS — AND SOROS SAYS HE'S OPEN TO IT\nPresident-elect Donald Trump and Elon Musk watch the launch of the sixth test flight of the SpaceX Starship rocket on Nov. 19, 2024, in Brownsville, Texas.(Brandon Bell/Getty Images)\nMusk and Ramaswamy noted in aWall Street Journal piecelast month that they \"will serve as outside volunteers, not federal officials or employees.\"\nTrump had said in a statement that DOGE \"will provide advice and guidance from outside of Government, and will partner with the White House and Office of Management & Budget to drive large scale structural reform, and create an entrepreneurial approach to Government never seen before.\"\nELON MUSK CALLS OUT $2.3 BILLION ALLOCATED TO NGO PERSONNEL FACILITATING ‘ILLEGAL IMMIGRATION’ IN BORDER BILL\nVivek Ramaswamy encourages voters to support then-candidate Trump during a campaign rally in Laconia, N.H., on Jan. 22, 2024.(Chip Somodevilla/Getty Images)\nCLICK HERE TO GET THE FOX NEWS APP\nMusk declared in a recent post that, \"Less government means more power to the people.\"\nAlex Nitzberg is a writer for Fox News Digital."}, {"source": "foxnews", "title": "FBI has long been accused of politicization ahead of Dem concern over Kash Patel nomination", "link": "https://www.foxnews.com/politics/fbi-has-long-been-accused-politicization-ahead-dem-concern-over-kash-patel-nomination", "content": "Former FBI special agent Stuart Kaplan makes his case for Kash Patel as President-elect Donald Trump's pick for FBI director on 'Jesse Watters Primetime.'\nCritics of \"deep state\" foe Kash Patel,President-elect Trump’spick to lead the FBI, call the veteran official a \"danger\" to the U.S. who will politicize the bureau – but a review of the agency's recent history shows the upper echelon of the FBI has long had a politicization problem, and Patel says he's just the man to end it.\nTrump announced over the weekend that he is nominating Patel as FBI director, after years as a public defender and working up the echelons of the federal government, including as senior director for counterterrorism at the National Security Council under the Trump administration, and chief of staff to acting Secretary of Defense Christopher Miller toward the end of Trump's first term.\nPatel is an outspoken crusader against the \"deep state.\" In a book published last year, he explicitly called for revamping the FBI in a chapter dubbed \"Overhauling the FBI,\" and moving the FBI’s headquarters out of Washington, D.C.\nSince 2013, the FBI has seen three directors take the helm: James Comey, who served under the Obama administration before Trump fired him in May 2017; short-term acting-director Andrew McCabe under the Trump administration; and current director, Christopher Wray, whom Trump also appointed.\nWHO IS KASH PATEL? TRUMP'S PICK TO LEAD THE FBI HAS LONG HISTORY VOWING TO BUST UP 'DEEP STATE'\nAmid the political left’s outrage over the Patel pick, Fox News Digital revisited a handful of the agency’s scandals that were lambasted as politically motivated and spoiling the integrity of the agency.\nEx-FBI official Peter Strzok was fired in 2018 for sending out anti-Trump texts.(Reuters)\nIn 2017, the FBI and Special Counsel Robert Mueller came under fire when it was revealed that two FBI employees tasked with investigating and handling alleged Russian interference into the 2016 election had texted each other anti-Trump rhetoric.\nDOJ SETTLES WITH FORMER FBI OFFICIALS OVER RELEASE OF ANTI-TRUMP TEXTS\n\"[Trump’s] not ever going to become president, right? Right?!\" FBI attorney Lisa Page texted FBI agent Peter Strzok in August 2016, Fox Digital previously reported.\n\"No. No he won’t. We’ll stop it,\" Strzok responded.\nStrzok wrote in another August 2016 text, seemingly referring to Trump’s chance of winning the 2016 election: \"I want to believe the path you threw out for consideration in Andy’s office – that there’s no way he gets elected – but I’m afraid we can’t take that risk. It’s like an insurance policy in the unlikely event you die before you’re 40.\"\nStrzok and Page were both working on Mueller’s investigation into Russian interference in the 2016 election – which ultimately found no evidence that Trump or his campaign coordinated with Russia – before Mueller dismissed Strzok from the investigation amid the text scandal. Page left the team before the text messages were discovered and revealed to the public.\nLisa Page arrives on Capitol Hill, July 16, 2018, to speak before the House Judiciary and Oversight Committee.(Andrew Caballero-Reynolds/AFP via Getty Images)\nThe pair had also worked together on the investigation into former Secretary of State Hillary Clinton’s use of a private email server for official government duties.\nThe FBI ultimately fired Strzok in 2018 over the texts, as conservative lawmakers and critics lambasted ​​the \"bias\" within the FBI.\n\"In Louisiana, we call that bias, we don't call that objective,\" Sen. John Kennedy, R-La., said on Fox News at the time.\nWhile then-House Oversight and Government Reform Committee Chairman Trey Gowdy said: \"Peter Strzok's manifest bias trending toward animus casts a pall on this investigation… His bias impacted his decision-making and he assigned to himself the role of stopping the Trump campaign or ending a Trump Presidency.\"\n\"This is not the FBI I know,\" the South Carolina Republican added.\nTrump slammed the scandal as an instance of \"treason.\"\n\"A man is tweeting to his lover that if [former Democratic nominee Hillary Clinton] loses, we'll essentially do the insurance policy,\" Trump said in an interview with the Wall Street Journal in 2018. \"We'll go to phase two and we'll get this guy out of office.\"\nDISGRACED EX-FBI AGENT PETER STRZOK REACTS TO DURHAM REPORT ON TRUMP-RUSSIA COLLUSION WITH VICTORY LAP\n\"This is the FBI we're talking about – that is treason,\" he continued. \"That is a treasonous act. What he tweeted to his lover is a treasonous act.\"\nFormer FBI Deputy Director Andrew McCabe(Jahi Chikwendiu/The Washington Post via Getty Images)\nTrump dismissed FBI Director James Comey on May 9, 2017, with Deputy Director Andrew McCabe stepping up to take the helm of the agency for roughly three months before he was fired for allegedly leaking information to the press and initially lying about the leaks, Justice Department's internal watchdog found in a 2018 investigation.\nANDREW MCCABE, FBI OFFICIAL FIRED BY TRUMP ADMINISTRATION, GETS PENSION RESTORED\nMcCabe automatically assumed the responsibilities ofFBI director upon Comey’s firing,as the Trump administration searched for another FBI chief. McCabe had reportedly been in the running for the nomination, but was ultimately replaced by Wray in August of that year. Then-Attorney General Jeff Sessions fired McCabe just days before he would have been eligible for a lifetime pension after it was determined that he had leaked a self-serving story to the press regarding the bureau’s probe of Clinton’s email server, and then misled investigators on the matter.\nSessions said McCabe \"made an unauthorized disclosure to the news media and lacked candor − including under oath − on multiple occasions.\"\nThe DOJ IG report found McCabeleaked information of an August 2016 call to the Wall Street Journal for an Oct. 30, 2016, story titled \"FBI in Internal Feud Over Hillary Clinton Probe.\" The story focused on the FBI announcing the reopening of the Clinton investigation after finding thousands of her emails on a laptop belonging to former Democratic Rep. Anthony Weiner, who was married to Hillary Clinton aide Huma Abedin.\nARI FLEISCHER ON THE IRONY OF ANDREW MCCABE BLAMING THE WHITE HOUSE FOR POLITICIZING THE IG INVESTIGATION\nThe Journal reported a senior Justice Department official expressed displeasure to McCabe that FBI agents were still looking into the Clinton Foundation, and that McCabe had defended the FBI’s authority to pursue the issue.\nMcCabe filed a lawsuit over the firing, and saw his pension restored as part of a settlement deal that also vacated Sessions’ decision, and removed any mention of being fired from McCabe’s FBI record.\nThe FBI seal is displayed on a podium before a news conference at the agency's headquarters in Washington.(AP Photo/Jose Luis Magana, File)\nUnder Director Comey’s tenure as FBI chief, the agency came under fire when media outlets began reporting in 2019 that the DOJ’s watchdog made a criminal referral to U.S. prosecutor John Durham regarding FBI attorney Kevin Clinesmith, elevating the investigation from an inquiry to a criminal probe. Durham was the U.S. attorney for Connecticut and later tapped by then-Attorney General Bill Barr to lead a criminal investigation into the origins of the FBI investigating alleged Russian interference in the 2016 election.\nClinesmith had worked on the FBI's Crossfire Hurricane investigation, which investigated alleged claims Russia interfered in the 2016 election,when Trump won the Oval Officein his campaign against Clinton.\nEX-FBI LAWYER KEVIN CLINESMITH GIVEN PROBATION AFTER GUILTY PLEA IN JOHN DURHAM PROBE\nThe DOJ inspector general accused Clinesmith, though not by name, of altering an email about former Trump campaign adviser Carter Page to say that he was \"not a source\" for another government agency, downplaying Page’s relationship with the CIA. Page had worked as an \"operational contact\" for the CIA for about five years until 2013.\nThe Justice Department relied on Clinesmith’s altered email assertion as it submitted a third and final renewal application in 2017 to eavesdrop on Page under the Foreign Intelligence Surveillance Act (FISA).\nThe Justice Department’s charging documentstated that Clinesmith \"did willfully and knowingly make and use a false writing and document, knowing the same to contain a materially false, fictitious, and fraudulent statement and entry in a matter before the jurisdiction of the executive branch and judicial branch of the Government of the United States.\"\nClinesmith ultimately pleaded guilty to \"one count of making a false statement within both the jurisdiction of the executive branch and judicial branch of the U.S. government, an offense that carries a maximum term of imprisonment of five years and a fine of up to $250,000.\"\nHe was sentenced in 2021 to 12 months probation and 400 hours of community service.\nEX-FBI LAWYER KEVIN CLINESMITH PLEADS GUILTY IN FIRST CRIMINAL CASE ARISING FROM DURHAM PROBE\nPage said the 2020 Clinesmith indictment was the \"first step on the road to justice\" for the FBI and DOJ, slamming Clinesmith's actions as \"false conspiracies and made-up lies paid for by Democrats.\"\n\"Friday was just a first step on the road to justice, because it was the first time that I started to see some semblance of justice from the DOJ and FBI with the fact they were acting in accordance with Crime Victims' Rights Act, a law that was totally avoided and not respected throughout last four years,\" Page told \"Mornings with Maria\"at the time.\nTrump’s first national security adviser Michael Flynn, who also served as Obama administration Defense Intelligence Agency chief, was embroiled in FBI legal woes at the start of Trump’s first administration amid the FBI’s Crossfire Hurricane investigation, which ultimately sparked the Mueller investigation and was followed by the Durham report.\nIn December 2017, when Comey helmed the FBI, Flynn struck a plea deal with Mueller, pleading guilty to giving false statements to the FBI, which included comment regarding his communications with a Russian ambassador. Flynn also admitted to filing paperwork under the Foreign Agents Registration Act that contained misrepresentations regarding business with Turkey.\nGEN. MICHAEL FLYNN DECRIES DEEP STATE: 'WE HAVE TWO SEPARATE GOVERNMENTS'\nThe plea deal included Flynn’s cooperation with Mueller’s special counsel investigation into Trump's alleged connections to Russia during the 2016 election.\nIn 2019, however, Flynn claimed innocence and accused the FBI of misconduct. Internal FBI documents made public in 2020 showed top FBI leadership discussing the motivation behind interviewing Flynn when he served as national security adviser and whether their \"goal\" was \"to get him to lie, so we can prosecute him or get him fired.\"\nThe documents were handwritten notes between the FBI's former head of counterintelligence Bill Priestap following a meeting with Comey and McCabe, Fox News Digital previously reported. The notes suggested that agents also planned to get Flynn \"to admit to breaking the Logan Act\" when he spoke to then-Russian Ambassador Sergey Kislyak during the presidential transition period.\nStrzok was notably one of the FBI agents who interviewed Flynn.\nMICHAEL FLYNN SAYS HE FACED 'POLITICAL PERSECUTION OF THE HIGHEST ORDER'\nTrump ultimately pardoned Flynn in 2020 and his case was dismissed. Flynn has since said he faced a \"political persecution of the highest order.\"\n\"So, you know, we went and made the decision that this was the direction that we wanted to go and good enough for President Donald Trump for coming through, and we’re certainly grateful to him,\" Flynn said in 2020 on Fox News. \"But at the same time, we also know that this was a political persecution of the highest order and not something that any American should ever have to go through.\"\nKash Patel was lead investigator on the Russia-gate investigation for the House Permanent Select Committee on Intelligence.(Kash Patel headshot)\nTrump announced over the weekend that he is nominating Patel as FBI director, touting him as someone who will \"end the growing crime epidemic in America, dismantle the migrant criminal gangs, and stop the evil scourge of human and drug trafficking across the Border.\"\nPatel has been a staunch Trump ally, including joining the 45th president during his trial in Manhattan in the spring, and echoing that the United States’ security and law enforcement agencies, including the FBI, need to be overhauled. Patel published a book last year called \"Government Gangsters,\" where he railed against the \"deep state,\" the weaponization of the federal government and the Russia investigation into Trump.\n\"Things are bad. There’s no denying it,\" Patel wrote in his book. \"The FBI has gravely abused its power, threatening not only the rule of law, but the very foundations of self-government at the root of our democracy. But this isn’t the end of the story. Change is possible at the FBI and desperately needed,\" he wrote.\n\"The fact is we need a federal agency that investigates federal crimes, and that agency will always be at risk of having its powers abused,\" he continued, advocating the firing of \"corrupt actors,\" \"aggressive\" congressional oversight over the agency, complete overhauls to special counsels, and moving the FBI out of Washington, D.C.\nPresident-elect Trump speaks at a House Republicans Conference meeting at the Hyatt Regency on Capitol Hill on Nov. 13, 2024.(Allison Robbert-Pool/Getty Images)\nDemocrats and liberal members of the media have slammed Trump’s choice of Patel, calling him as a \"danger\" to the U.S. and \"unqualified\" for the role.\n\"It’s a terrible development for the men and women of the FBI and also for the nation that depends on a highly functioning, professional, independent Federal Bureau of Investigation. The fact that Kash Patel is profoundly unqualified for this job is not even, like, a matter for debate,\" McCabe said on CNN following the announcement. \"The installation, or the nomination, I guess we should say at this point, of Kash Patel as FBI director can only possibly be a plan to disrupt, to dismantle, to distract the FBI, and to possibly use it as a tool for the president’s political agenda.\"​\nBefore Patel could assume the role as FBI chief, Wray would need to step down or be fired, as he is in the midst of a 10-year appointment that does not end until 2027. The Senate would also have to confirm Patel.\nCLICK HERE TO GET THE FOX NEWS APP\n\"It is the honor of a lifetime to be nominated byPresident Trump to serve as Director of the FBI,\" Patel said in a statement following the announcement. \"Together, we will restore integrity, accountability, and equal justice to our justice system and return the FBI to its rightful mission: protecting the American people.\"\nFox News Digital's Brooke Singman, Ronn Blitzer and Joseph Wulfsohn contributed to this report."}, {"source": "foxnews", "title": "Elon Musk and Vivek Ramaswamy agree on 'need to scrutinize' US funding for NGOs", "link": "https://www.foxnews.com/politics/elon-musk-vivek-ramaswamy-agree-need-scrutinize-us-funding-ngos", "content": "The 'Outnumbered' panel weighs in on the Department of Government Efficiency's effort to slash wasteful government spending under the leadership of Elon Musk and Vivek Ramaswamy.\nElon Musk andVivek Ramaswamy— the duo President-elect Donald Trump tapped for the effort known as the Department of Government Efficiency (DOGE) — have indicated that they plan to examine funding for non-governmental organizations (NGOs).\n\"We need to scrutinize U.S. government funding of 'non-government organizations,'\" Ramaswamy noted in a post on X. \"It's an oxymoron that represents a waste of taxpayer dollars, but the real problem runs deeper: Americans deserve transparency on opaque foreign aid & nonprofit groups abetting our own border crisis.\"\nMusk agreed, commenting, \"Absolutely.\"\nELON MUSK SAYS THERE'S SUBSTANTIAL IGNORANCE ABOUT AMERICA'S NATIONAL DEBT\nElon Musk and Vivek Ramaswamy will head the Department of Government Efficiency (DOGE).(Getty Images)\nHe also agreed with his brother Kimbal Musk, who suggested that NGOs are \"mouthpieces\" for governments that \"need to go.\"\n\"NGO’s are the govt’s way of creating mouthpieces that promote their agenda and push for censorship without the normal checks and balances that govt has to follow. They need to go,\" Kimbal Musk declared in a tweet.\n\"Yes,\"Elon Muskreplied.\nELON MUSK WANTS TO MEET ALEX SOROS — AND SOROS SAYS HE'S OPEN TO IT\nPresident-elect Donald Trump and Elon Musk watch the launch of the sixth test flight of the SpaceX Starship rocket on Nov. 19, 2024, in Brownsville, Texas.(Brandon Bell/Getty Images)\nMusk and Ramaswamy noted in aWall Street Journal piecelast month that they \"will serve as outside volunteers, not federal officials or employees.\"\nTrump had said in a statement that DOGE \"will provide advice and guidance from outside of Government, and will partner with the White House and Office of Management & Budget to drive large scale structural reform, and create an entrepreneurial approach to Government never seen before.\"\nELON MUSK CALLS OUT $2.3 BILLION ALLOCATED TO NGO PERSONNEL FACILITATING ‘ILLEGAL IMMIGRATION’ IN BORDER BILL\nVivek Ramaswamy encourages voters to support then-candidate Trump during a campaign rally in Laconia, N.H., on Jan. 22, 2024.(Chip Somodevilla/Getty Images)\nCLICK HERE TO GET THE FOX NEWS APP\nMusk declared in a recent post that, \"Less government means more power to the people.\"\nAlex Nitzberg is a writer for Fox News Digital."}, {"source": "foxnews", "title": "Mar-a-Lago trumps White House as president-elect overshadows Biden on world stage", "link": "https://www.foxnews.com/politics/mar-a-lago-trumps-white-house-president-elect-overshadows-biden-world-stage", "content": "Fox News' Brooke Singman reports the latest on the president-elect.\nPresident Bidenenjoyed a warm welcome from a crowd of thousands as he arrived in Angola this week, as the president made good on his long awaited first visit to sub-Saharan Africa.\nBiden, likely on his last overseas trip beforePresident-elect Donald Trumptakes over in the White House next month, is already being overshadowed on the world stage by his predecessor and successor.\n\"The Oval Office has been replaced by Mar-a-Lago,\" Matthew Bartlett, a Republican strategist who served at the State Department during Trump's first term, told Fox News.\nAdditionally, Matt Mowers, a veteran GOP national public affairs strategist and former diplomat at the State Department during Trump's first administration, made the case that \"Joe Biden’s essentially been a lame duck\" for months and that \"world leaders have been shifting their gaze to the next administration.\"\nWHAT TRUMP TOLD CANADA'S LEADER BEHIND CLOSED DOORS\nPresident Biden walks from Air Force One as he arrives at Quatro de Fevereiro International Airport in Luanda, Angola on Monday, Dec. 2, 2024 on his long-promised visit to Africa.(AP Photo/Ben Curtis)\nWayne Lesperance, a veteran political scientist and president of New England College, highlighted that \"while President-elect is still weeks away from taking the oath of office, loyalties and the attention of world leaders has shifted to the incoming President and from Washington to Mar-a-lago with breathtaking speed.\"\nWhile members of the Biden White House would likely disagree with such sentiments - especially after the current administration played a large role in hammering out the cease-fire that halted fighting in Lebanon between Israel and Hezbollah - it is undeniable that world leaders have already started to engage directly with the incoming president and administration.\nTRUMP GETS READY TO MAKE A SPLASH ON THE WORLD STAGE\nTrump will meet withFrench President Emmanuel Macronafter the French president invited him to attend Saturday's star-studded VIP event for the official reopening of the newly restored Notre Dame Cathedral, five years after a devastating fire wrecked the Paris landmark.\nThe president-elect's appearance will serve as Trump's unofficial return to the global stage, and it is another reminder that he is quickly becoming the center of the world's attention.\nFrench President Emmanuel Macron, left, shakes hands with then-President Trump at an arrival ceremony during a state visit in Washington, D.C., on Tuesday, April 24, 2018. Trump will attend the re-opening celebration of the Notre Dame Cathedral this weekend, five years after a fire heavily damaged the structure.(Getty Images)\nThe trip to Paris comes a week afterCanadian Prime Minister Justin Trudeauhastily made an unannounced stop in Mar-a-Lago to dine with Trump after the president-elect threatened a trade war with Canada and Mexico.\nTrump argued that Canada had failed to prevent large amounts of drugs and undocumented people from crossing the northern border into the U.S. and also pointed to America's massive trade deficit with Canada.\nAccording to reporting fromFox News' Bret Baier,Trump suggested to Trudeau that Canada could become the 51st state.\nCanadian Prime Minister Justin Trudeau, left, met with President-elect Donald Trump at Mar-a-Lago in Florida on Friday, Nov. 29, 2024 to discuss topics like the economy, illegal immigration and a proposed 25% tariff.(Justin Trudeau X)\nTrump also weighed in this week in the volatile Middle East, warning in a social media post that there would be \"ALL HELL TO PAY\" if Hamas does not release all the hostages held in Gaza before he is inaugurated on Jan. 20.\nHours later, Trump pledged to block the purchase of U.S. Steel - a top American manufacturer - by the Japanese company Nippon Steel.\n\"I am totally against the once great and powerful U.S. Steel being bought by a foreign company, in this case Nippon Steel of Japan,\" Trump said on social media. \"As President, I will block this deal from happening.\"\nTrump, who reiterated comments he made earlier this year on the presidential campaign trail, is on the same page as Biden, who has vowed that U.S. Steel will remain American-owned.\nBiden's trip to Africa is putting a spotlight on his administration's commitment to the continent, which has increasingly been courted by massive investments from China. Biden is also highlighting America's wide-ranging effort to combat HIV/AIDS in Africa, a continent Trump never visited during his first term in the White House.\nPresident Biden, left, stands for national anthems with Angolan President Joao Lourenco at the presidential palace in Luanda, Angola on Tuesday, Dec. 3, 2024.(AP Photo/Ben Curtis)\nHowever, the president's trip will be overshadowed by Trump's upcoming stop in France, as the president-elect is increasingly courted by world leaders.\nWhile the spotlight traditionally shifts from the outgoing to the incoming president, Mowers argued that \"it is more pronounced this time because the difference in the Biden and Trump approach to foreign policy is so different.\"\nMowers emphasized that Trump is already aiming \"to shape world events\" by \"being bold, not timid, in the statements he’s putting out, and the world is already reacting to that kind of American strength.\"\nBartlett noted that \"the world is demanding leadership.\" Mowers added that \"world leaders that want to get something done… have to engage with Trump.\"\nCLICK HERE TO GET THE FOX NEWS APP\nLesperance, pointing to Biden's swing through Africa, noted that lame duck presidents' final weeks are \"usually filled with celebratory moments and efforts to cement one’s legacy. Often the focus is on their role on the world stage on behalf of America and its allies.'\nHowever, he argued that \"Biden’s pronouncements on Ukraine, Gaza and the importance of climate change go largely ignored by world leaders. Instead, they focus on Trump’s picks for his foreign policy team and pronouncements about changes in U.S. foreign policy position. It’s pretty evident that while Biden attempts a victory tour, the world has turned the page.\""}, {"source": "foxnews", "title": "House Dem moves to force vote on releasing Gaetz ethics report", "link": "https://www.foxnews.com/politics/house-dem-moves-force-vote-releasing-gaetz-ethics-report", "content": "Air Force veteran and Trump Transition team adviser Jeff Witt joined 'Fox & Friends First' to announce his candidacy for Florida's 1st congressional district and reveal what America-first issues would be most important to him if elected.\nA Democratic lawmaker is moving to force a vote on releasing the results of the House Ethics Committee's report intoformer Rep. Matt Gaetz, R-Fla.\nRep. Sean Casten, D-Ill., introduced legislation on Tuesday afternoon aimed at mandating a House-wide vote on whether to make the Gaetz report public.\nHe introduced it as a \"privileged resolution,\" a mechanism that forces House leaders to consider it within two legislative days – putting the deadline on Thursday.\nHACKER OBTAINS HOUSE ETHICS TESTIMONY ON MATT GAETZ AS TRUMP MAKES CALLS FOR AG NOMINEE\nFormer Rep. Matt Gaetz has been the subject of a multi-year investigation by the House Ethics Committee.(Leon Neal/Getty Images)\nThe House Ethics Committee's multi-year investigation into Gaetz, involving allegations of sex with a minor and illicit drug use, came to an abrupt halt last month after he resigned from Congress hours after President-elect Donald Trump tapped him to be his attorney general.\nGaetz dropped out of consideration amid quiet but steadyGOP opposition, but the committee nevertheless lost jurisdiction over the probe when Gaetz left the House of Representatives.\nHis resignation came just before the committee was expected to meet to consider releasing the report.\nGaetz has consistently denied any accusations of wrongdoing.\nAn earlier federal investigation into the allegations ended without charges against Gaetz.\nGET TO KNOW DONALD TRUMP'S CABINET: WHO HAS THE PRESIDENT-ELECT PICKED SO FAR?\nRep. Sean Casten is aiming to force a vote on the committee's report(Tom Williams/CQ-Roll Call, Inc via Getty Images)\nIt's highly unusual for the House Ethics Committee, a panel normally shrouded in secrecy, to release reports on lawmakers who have left office. It's a detail House Speaker Mike Johnson, R-La., raised when telling reporters last month that he was against releasing the report.\nBut it's not unheard of, as Casten pointed out on Tuesday.\n\"The Committee on Ethics has, on many occasions, released its reports on former members,\" Casten said in a statement. \"Resigning from Congress should not allow Members to avoid accountability for allegations as serious as those faced by Matt Gaetz. Withholding this report from the American people would impede the dignity and integrity of the legislative proceedings of the House.\"\nCasten introduced a similar resolution last month, but his office said it was allowed to expire by House GOP leaders over the Thanksgiving break.\nThe new resolution will likely not be sidelined so easily, with the House expected in session from now until Friday.\nRep. Susan Wild, the top Democrat on the Ethics Committee, hinted that the vote on releasing it fell along party lines last month.(Alex Wong/Getty Images)\nThe last day to consider the resolution will be Thursday, the same day the Ethics Committee will meet after previously failing tocome to an agreementon releasing the Gaetz report.\nCLICK HERE TO GET THE FOX NEWS APP\nRep. Susan Wild, D-Pa., the top Democrat on the panel, hinted that the vote to do so fell along party lines.\n\"I'd say that a vote was taken. As many of you know, this committee is evenly divided between Democrats and Republicans, five Dems, five Republicans, which means that in order to affirmatively move something forward, somebody has to cross party lines and vote with the other side – which happens a lot, by the way, and we often vote unanimously,\" Wild told reporters after the last meeting. \"That did not happen in today's vote.\"\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com"}, {"source": "foxnews", "title": "Dem Rep. Dean Phillips blasts Biden after Hunter pardon, says some people ‘are indeed above the law’", "link": "https://www.foxnews.com/politics/dem-rep-dean-phillips-blasts-biden-after-hunter-pardon-some-people-are-indeed-above-law", "content": "OutKick founder Clay Travis joins 'The Faulkner Focus,' criticizes President Biden as 'a complete and total liar' after issuing a pardon for his son Hunter and calls on President-elect Trump to pardon all January 6 rioters.\nA Democratic U.S. congressman on Monday said it appears that certain people are \"above the law\" afterPresident Bidenpardoned his son, Hunter Biden, despite repeatedly saying he would not give his son a pass.\nRep. Dean Phillips, D-Minn., responded to Biden’s decision to pardon Hunter on social media, blasting the president’s own words from earlier this year that \"no one is above the law.\"\n\"Let’s just say the quiet part out loud, certain Americans are indeed above the law and influence is always for sale,\" Phillips wrote on X. \"It’s time for the exhausted majority to condemn and confront legalized corruption.\"\nPresident Biden issued a sweeping pardonfor Hunter Biden on Sunday after he had repeatedly said he would not do so. The first son had been convicted in two separate federal cases earlier this year. He pleaded guilty to federal tax charges in September, and was convicted of three felony gun charges in June after lying on a mandatory gun purchase form by saying he was not illegally using or addicted to drugs.\nHUNTER BIDEN GUN CASE TERMINATED AFTER PARDON, BUT FEDERAL JUDGE STOPS SHORT OF FULL DISMISSAL\nPhillips called out the \"legalized corruption\" in politics and argued that pardoning powers have been \"abused\" by presidents of both major political parties.(Reuters/Tom Brenner, File)\nThe presidentargued in a statementthat Hunter was \"singled out only because he is my son\" and that there was an effort to \"break Hunter\" in order to \"break me.\"\nBiden had stated on record multiple times that hewould not pardon Huntershould a jury convict his son.\nPresident Joe Biden pardoned his son Hunter Biden on Sunday.(AP Photo/Jose Luis Magana)\nPhillips, who unsuccessfully ran for the Democratic nomination for president, argued that perhaps both Hunter Biden and Trump may not have been charged in their respective criminal cases under different circumstances.\n\"Two things can be true at once: Neither Hunter Biden nor Donald Trump would have been charged with certain crimes had they not been political figures,\" he wrote. \"Pardoning powers have been abused by Trump and now Biden, and must be reformed.\"\nTAPPER SAYS BIDEN LYING ABOUT PARDONING HUNTER MAKES HIS ADMIN AND ALLIES ‘EITHER CREDULOUS OR COMPLICIT’\nThe pardon has beenmet with widespread criticismfrom Republicans, some Democrats and the media.\nReporters grilled White House press secretary Karine Jean-Pierre on Monday, asking whether Biden and his surrogates lied to the American people.Jean-Pierre responded,\"One thing the president believes is to always be truthful with the American people,\" and repeatedly pointed to Biden’s own statement on the matter.\nCLICK TO GET THE FOX NEWS APP\nBiden has yet to take questions from reporters on why he broke his pledge to Americans and decided to pardon the first son.\nFox News Digital's Alexander Hall contributed to this report."}, {"source": "foxnews", "title": "Recently ousted Dem senator said he's 'getting the f--- out of here' when asked about presidential pardon", "link": "https://www.foxnews.com/politics/recently-ousted-dem-senator-asked-presidential-pardon", "content": "Democratic Rep. Seth Moulton said Tuesday that while he understands President Biden's instinct to pardon Hunter as a father, there was more at \"stake\" with the Department of Justice.\nSen. Jon Tester is getting testy with reporters during his remaining weeks in Congress after being booted from his long-held Montana Senate seat.\nPresident Biden pardoned his son,Hunter Biden, on Sunday, absolving him of any charges for crimes he \"committed or may have committed\" between January 2014 and December 2024.\nOn Monday, Tester was asked about Biden's controversial move to pardon his son, to which the senator offered a rather blunt response.\n\"I’m one month from getting the f--- out of here,\" he said with a smile,according to CNNand other outlets. \"Ask somebody who counts.\"\nNAVY SEAL TIM SHEEHY OUSTS 3-TERM SEN. JON TESTER IN MONTANA SENATE RACE\nSen. Jon Tester arrives for the Senate Appropriations Subcommittee on Defense hearing in the Dirksen Building on June 18, 2024.(Tom Williams)\nThe comment comes nearly one month after the three-term Montana Democrat was ousted by Republican Navy SEAL Sen.-elect Tim Sheehy in one of the most closely watched races of the 2024 cycle.\nMONTANA'S ROAD TO RED: HOW THE STATE SHIFTED TO ALL GOP LEADERSHIP FOR THE FIRST TIME IN OVER 100 YEARS\nWhile Tester did not answer the question, Democrats on Capitol Hill have beenspeaking outagainst Biden's decision to relieve his son from facing any potential federal charges over the course of the past decade.\nRepublican Sen.-elect Tim Sheehy bested Tester in the November election.(Tim Sheehy For Montana)\n\"President Biden’s decision to pardon his son was wrong. A president's family and allies shouldn't get special treatment. This was an improper use of power, it erodes trust in our government, and it emboldens others to bend justice to suit their interests,\" Sen. Gary Peters, D-Mich, wrote in a post on X.\nCLICK HERE TO GET THE FOX NEWS APP\nSen. Michael Bennet, D-Colo., also said that Biden's decision \"further erodes Americans’ faith that the justice system is fair and equal for all.\"\nEfforts to reach Tester's office for comment at press time were unsuccessful.\nAubrie Spady is a Writer for Fox News Digital."}, {"source": "foxnews", "title": "Dem lawmaker joins Republican-led DOGE Caucus with push to remove Secret Service from DHS", "link": "https://www.foxnews.com/politics/dem-lawmaker-joins-republican-led-doge-caucus-push-remove-secret-service-from-dhs", "content": "Geltrude & Company founder Dan Geltrude and Strategic Wealth Partners investment strategist Luke Lloyd discuss DOGE's push to tackle government spending, how President-elect Trump can impact the economy and the market's performance.\nRep. Jared Moskowitz, D-Fla., announced on Tuesday that he would be joining the House of Representatives'DOGE Caucus, becoming the first Democrat in the now-bipartisan group.\nHe advocated for removing the U.S. Secret Service (USSS) from the purview of the Department of Homeland Security (DHS), something floated by several Republican lawmakersmonths ago.\n\"Today I will join the Congressional DOGE Caucus, because I believe that streamlining government processes and reducing ineffective government spending should not be a partisan issue,\" Moskowitz said in a statement.\nELON MUSK SAYS THERE'S SUBSTANTIAL IGNORANCE ABOUT AMERICA'S NATIONAL DEBT\nRep. Jared Moskowitz announced he wants to work with Republicans to cut the federal bureaucracy, and suggested decoupling the Secret Service from DHS.(Getty Images)\nThe DOGE Caucus, standing for Delivering Outstanding Government Efficiency, was launched by Reps. Pete Sessions, R-Texas, and Aaron Bean, R-Fla., soon after President-elect Donald Trump announced a DOGE advisory panel to be led by Elon Musk and Vivek Ramaswamy.\n\"I’ve been clear that there are ways we can reorganize our government to make it work better for the American people. Specifically, the Department of Homeland Security, while very necessary, has gotten too big,\" Moskowitz said.\nHe suggested USSS, along with the Federal Emergency Management Agency (FEMA), should become \"independent federal agencies with a direct report to the White House.\"\n\"It’s not practical to have 22 agencies under this one department. I look forward to working in a bipartisan manner with my colleagues to remove FEMA and Secret Service from DHS,\" Moskowitz said.\nMIKE JOHNSON WINS REPUBLICAN SUPPORT TO BE HOUSE SPEAKER AGAIN AFTER TRUMP ENDORSEMENT\nRep. Aaron Bean co-founded the DOGE Caucus.(Tom Williams/CQ-Roll Call, Inc via Getty Images)\nIt is a particularly notable position for the Florida Democrat to take, considering his deep familiarity with both agencies.\nBefore coming to Congress, Moskowitz served as Florida's director of Emergency Management under Republican Gov. Ron DeSantis. He has also previously pushed todecouple FEMA from DHSalongside Rep. Garret Graves, R-La.\nAs a lawmaker, he is also a member of the bipartisan House task force investigating the assassination attempts against Trump.\nUS NATIONAL DEBT HITS A NEW RECORD: $36 TRILLION\nVivek Ramaswamy and Elon Musk were tapped by President-elect Trump to lead an advisory panel on government efficiency.(Getty Images/AP Images)\nCLICK HERE TO GET THE FOX NEWS APP\nThe DOGE Caucus is one of several overtures by House Republicans to get in step with Musk and Ramaswamy's new mission.\nHouse Oversight Committee Chairman James Comer, R-Ky., recently announced the next Congress would see a special subcommittee on government efficiency led by Rep. Marjorie Taylor Greene, R-Ga.\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com"}, {"source": "foxnews", "title": "Trump bucks Biden's 'don't' doctrine on world stage, hits adversaries with 'all hell to pay' deadline", "link": "https://www.foxnews.com/politics/trump-bucks-bidens-dont-doctrine-world-stage-hits-adversaries-all-hell-pay-deadline", "content": "‘Gutfeld!’ panelists weigh in on President Biden's visit to Israel and the 'stark' differences in U.S. foreign policy in the Middle East under Biden and former President Trump.\nIn the waning days of the Biden administration,President-elect Trumpis bucking his predecessor's \"don't\" doctrine as a deterrent to foreign adversaries, instead issuing tough warnings before even taking office.\n\"If the hostages are not released prior to January 20, 2025, the date that I proudly assume Office as President of the United States, there will be ALL HELL TO PAY in the Middle East, and for those in charge who perpetrated these atrocities against Humanity,\" Trump warned Hamas on his Truth Social account Monday.\n\"Everybody is talking aboutthe hostageswho are being heldso violently, inhumanely, and against the will of the entire World, in the Middle East – But it’s all talk, and no action!\" Trump added.\nWar broke out in the Middle East on Oct. 7, 2023, when Hamas launched a surprise attack on Israel. Terrorists killed more than 1,100 people and kidnapped more than 200, with Hamas still holding 101 hostages, including seven Americans, in Gaza morethan a year after the war began.\nBIDEN SAYING 'DON'T' AND OTHER THREATS SEEMINGLY FAIL TO DETER IRAN AS MORE US MIDEAST BASES HIT\nPresident-elect Trump and President Biden(Getty Images)\nThe White House and Israeli government have worked for months to secure a hostage release deal, but have been unsuccessful.\nTrump's tough language against Hamas, which included warning those responsible for holding the hostages that they \"will be hit harder than anybody has been hit in the long and storied History of the United States of America,\" stands in stark contrast to President Biden's \"don't\" doctrine regarding the war in Israel.\nAfter the war began last year,Biden delivered remarks from Israelwhere he warned adversaries of Israel and the U.S. \"don't\" attack Israel.\nREPUBLICANS SLAM BIDEN’S ‘DON’T’ DETERRENCE: ‘EVERY TIME HE SAYS DON’T, THEY DO’\n\"And my message to any state or any other hostile actor thinking about attacking Israel remains the same as it was a week ago: Don’t. Don’t. Don’t,\" he said.\nWar continued despite the warning, including from Iranian proxies against Israel.\nIsraeli military vehicles are seen traveling in the city of Kiryat Shmona, near the country's border with Lebanon, on Wednesday, Nov. 27.(AP/Ohad Zwigenberg)\nThis year, Biden doubled down on his warning of \"don't\" aimed at Iran. When asked by reporters about Iran's expectation to attack Israel in April, he said his message to Tehran is: \"Don't.\"\n\"We are devoted to the defense of Israel. We will support Israel. We will help defend Israel and Iran will not succeed,\" he added.\nAgain in August, Biden warned Iran against attacking Israel with the one-word threat.\nTRUMP PROMISES 'HELL TO PAY' IN MIDDLE EAST IF HOSTAGES ARE NOT RELEASED BEFORE HE TAKES OFFICE\nBiden's common response todeter foreign adversariesfrom attacking Israel is viewed as a failed policy, with conservative security experts and others slamming the message as weak.\n\"The Administration keeps saying 'don't' to Iran – but then does nothing to impose costs. This weakness means the risk from Iran continues to grow,\" former Secretary of State Mike Pompeo tweeted in August.\nPresident Biden speaks to reporters outside of St. Edmond's Roman Catholic Church in Rehoboth Beach, Del., Saturday, Aug. 31, 2024.(AP Photo/Manuel Balce Ceneta)\n\"Well, he said, ‘Don’t’ multiple times, and ‘Don’t’ isn’t a national security policy,\" Pompeo added later in a comment to Fox News. \"It’s not even a deterrent.\n\"So much for President Biden telling bad guys ‘Don’t’ actually being an effective deterrent. Every time he says 'Don’t,' they do,\" Sen. Lindsey Graham, R-S.C., wrote in a post in April, after Iran launched more than 300 missiles and drones at Israel.\n‘WAR FOLLOWED US’: A SYRIAN FAMILY FLED BEIRUT AFTER ISRAELI BOMBARDMENT TO FACE REPRESSION, BOMBING AT HOME\n\"Biden's approach with Iran and the Middle East is backwards,\" Rep. Nancy Mace, R-S.C., wrote on X. \"Now as we risk entering WWIII, the US must stand by Israel's commitment to democracy. The president must stand firm, andstop coddling Iran immediately.\"\n\"I guess Biden's speechwriters have him down to one word now. At least he can remember it. Worse when referring to the hospital carnage he calls Hamas the other team,\" Fox News' Greg Gutfeld quipped after the war in Israel broke out last year, mocking Biden's use of the word \"don't.\"\nFormer President Trump gestures while walking onstage for a campaign rally on Oct. 12, 2024, in Coachella, Calif. (Mario Tama/Getty Images)\nTrump had campaigned on ending the wars in both Ukraine and Israel, both of which began under the Biden administration, and claimed that neither war would have been launched if he had been president.\n\"The Ukraine situation is so horrible, the Israeli situation is so horrible. We are going to get them solved very fast,\" Trump said on the campaign trail in January.\nIsraeli officials celebrated Trump's tough stance against terrorists in the Middle East and his demand for hostages to be released by next month.\n\"Thank you and bless you Mr. President-elect,\"President Isaac Herzog of Israelsaid in a post on social media. \"We all pray for the moment we see our sisters and brothers back home!\"\nCLICK HERE TO GET THE FOX NEWS APP\nThe nation's finance minister, Bezalel Smotrich, added, \"How refreshing it is to hear clear and morally sound statements that do not create a false equivalence or call for addressing ‘both sides.’ This is the way to bring back the hostages: by increasing the pressure and the costs for Hamas and its supporters, and defeating them, rather than giving in to their absurd demands.\"\nTrump will beinaugurated as the nation's 47th presidenton Jan. 20, with his team celebrating that he's already following through on his campaign promises.\n\"President Trump is working towards international peace. In anticipation of the incoming Trump administration, Iran has called off its reprisal attack on Israel and negotiations to end the war in Gaza and Russia's war in Ukraine have accelerated. One former NATO Supreme Allied Commander says America's enemies are 'concerned, they're nervous – [and] they ought to be,'\" the Trump War Room said in an email this week titled \"Promises Kept – And President Trump Hasn't Even Been Inaugurated Yet.\""}, {"source": "foxnews", "title": "Hunter Biden pardon raises new questions over 5th Amendment ‘loophole’", "link": "https://www.foxnews.com/politics/hunter-biden-pardon-raises-new-questions-over-5th-amendment-loophole", "content": "Democratic Rep. Seth Moulton said Tuesday that while he understands President Biden's instinct to pardon Hunter as a father, there was more at \"stake\" with the Department of Justice.\nPresident Joe Biden’s sweeping pardon of his son, Hunter Biden, touched off a flurry of fresh legal speculation Tuesday over how, or if, the younger Biden can move to assert his Fifth Amendment privileges that protect against self-incrimination — and how the broad immunity granted to Hunter could be twisted against him.\nWhile Hunter Biden isindeed shielded against prosecutionfor any federal offenses he \"committed or may have committed\" between Jan. 1, 2014, through Dec. 1, 2024, those around him are not — which means that Hunter Biden could theoretically be called on to testify in any potential cases brought against family members or others in his inner circle.\nBIDEN'S SWEEPING HUNTER PARDON AT ODDS WITH LONGTIME RHETORIC ON EXECUTIVE POWER: 'NO ONE IS ABOVE THE LAW'\nHunter Biden, son of U.S. President Joe Biden, departs a House Oversight Committee meeting on Capitol Hill.(Kent Nishimura/Getty Images)\nIn these cases, Hunter Biden’s pardon could actually limit his ability to assertFifth Amendment privileges, since he is no longer at risk of facing criminal charges.\nHowever, the pardon applies only to federal crimes, not state crimes, and it remains unclear how, or if, Republicans could move to act on this possible loophole in the weeks and months ahead.\nStill, the question of Fifth Amendment protections does have outsize importance as Republicans prepare to regain the majority in both chambers of Congress in January, ramping up the possibility of potential GOP-led investigations into the outgoing president.\nIn an interviewMonday night on Newsmax, House Oversight Committee Chairman James Comer said he plans to discuss the issue of Hunter Biden's Fifth Amendment privileges with Trump’s nominee for attorney general, Pam Bondi.\n\"I look forward to talking to attorney general Bondi about this,\" the Kentucky Republican said.\nDNC UNION LAUNCHES GOFUNDME TO HELP FORMER STAFFERS HIT BY MASSIVE LAYOFFS AFTER ELECTION LOSSES\nThen Vice President-elect, Joe Biden, stands with his son, Hunter Biden, during a re-enactment of the Senate oath ceremony in the Old Senate Chamber on Capitol Hill.(AP Photo/Charles Dharapak, File)\n\"We still have information that we've requested that we never received,\" Comer said, adding that in his view, the White House \"is still to this day obstructing rightful evidence that we should have obtained.\"\nAny investigations into Biden’s family after he leaves office would likely be criticized by Democrats as both futile and a waste of taxpayer money, given the nature of earlier investigations, Hunter’s own pardon and Biden’s own lame-duck status.\nComer’s office did not respond to a question from Fox News Digital on whether the House Oversight Committee is planning to investigate Biden’s action in the next congressional session, or their views on Hunter’s ability to plead the Fifth.\nBut the questions about this potential loophole come just days after President Joe Biden announced the sweeping clemency grant for his only surviving son.\nCLICK HERE TO GET THE FOX NEWS APP\nEarlier Tuesday, the federal judge overseeing Hunter Biden’s gun case in Delaware announced the termination of further court proceedings, including a planned sentencing date in December. Earlier this year, a Delaware jury found Hunter guilty on all three federal felony firearm charges brought against him.\nIn terminating the proceedings, U.S. District Judge Maryellen Noreika stopped short of dismissing the case outright, as requested by Hunter Biden's legal team.\nIn September, Hunter Biden pleaded guilty to separate federal charges of tax evasion in California, which the pardon also covers.\nThe judge in that case, Judge Mark Scarsi, has not yet announced whether he will terminate the proceedings against Hunter or dismiss the case in full.\nBreanne Deppisch is a politics reporter for Fox News Digital covering the 2024 election and other national news."}, {"source": "foxnews", "title": "House Dem moves to force vote on releasing Gaetz ethics report", "link": "https://www.foxnews.com/politics/house-dem-moves-force-vote-releasing-gaetz-ethics-report", "content": "Air Force veteran and Trump Transition team adviser Jeff Witt joined 'Fox & Friends First' to announce his candidacy for Florida's 1st congressional district and reveal what America-first issues would be most important to him if elected.\nA Democratic lawmaker is moving to force a vote on releasing the results of the House Ethics Committee's report intoformer Rep. Matt Gaetz, R-Fla.\nRep. Sean Casten, D-Ill., introduced legislation on Tuesday afternoon aimed at mandating a House-wide vote on whether to make the Gaetz report public.\nHe introduced it as a \"privileged resolution,\" a mechanism that forces House leaders to consider it within two legislative days – putting the deadline on Thursday.\nHACKER OBTAINS HOUSE ETHICS TESTIMONY ON MATT GAETZ AS TRUMP MAKES CALLS FOR AG NOMINEE\nFormer Rep. Matt Gaetz has been the subject of a multi-year investigation by the House Ethics Committee.(Leon Neal/Getty Images)\nThe House Ethics Committee's multi-year investigation into Gaetz, involving allegations of sex with a minor and illicit drug use, came to an abrupt halt last month after he resigned from Congress hours after President-elect Donald Trump tapped him to be his attorney general.\nGaetz dropped out of consideration amid quiet but steadyGOP opposition, but the committee nevertheless lost jurisdiction over the probe when Gaetz left the House of Representatives.\nHis resignation came just before the committee was expected to meet to consider releasing the report.\nGaetz has consistently denied any accusations of wrongdoing.\nAn earlier federal investigation into the allegations ended without charges against Gaetz.\nGET TO KNOW DONALD TRUMP'S CABINET: WHO HAS THE PRESIDENT-ELECT PICKED SO FAR?\nRep. Sean Casten is aiming to force a vote on the committee's report(Tom Williams/CQ-Roll Call, Inc via Getty Images)\nIt's highly unusual for the House Ethics Committee, a panel normally shrouded in secrecy, to release reports on lawmakers who have left office. It's a detail House Speaker Mike Johnson, R-La., raised when telling reporters last month that he was against releasing the report.\nBut it's not unheard of, as Casten pointed out on Tuesday.\n\"The Committee on Ethics has, on many occasions, released its reports on former members,\" Casten said in a statement. \"Resigning from Congress should not allow Members to avoid accountability for allegations as serious as those faced by Matt Gaetz. Withholding this report from the American people would impede the dignity and integrity of the legislative proceedings of the House.\"\nCasten introduced a similar resolution last month, but his office said it was allowed to expire by House GOP leaders over the Thanksgiving break.\nThe new resolution will likely not be sidelined so easily, with the House expected in session from now until Friday.\nRep. Susan Wild, the top Democrat on the Ethics Committee, hinted that the vote on releasing it fell along party lines last month.(Alex Wong/Getty Images)\nThe last day to consider the resolution will be Thursday, the same day the Ethics Committee will meet after previously failing tocome to an agreementon releasing the Gaetz report.\nCLICK HERE TO GET THE FOX NEWS APP\nRep. Susan Wild, D-Pa., the top Democrat on the panel, hinted that the vote to do so fell along party lines.\n\"I'd say that a vote was taken. As many of you know, this committee is evenly divided between Democrats and Republicans, five Dems, five Republicans, which means that in order to affirmatively move something forward, somebody has to cross party lines and vote with the other side – which happens a lot, by the way, and we often vote unanimously,\" Wild told reporters after the last meeting. \"That did not happen in today's vote.\"\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com"}, {"source": "foxnews", "title": "FBI has long been accused of politicization ahead of Dem concern over Kash Patel nomination", "link": "https://www.foxnews.com/politics/fbi-has-long-been-accused-politicization-ahead-dem-concern-over-kash-patel-nomination", "content": "Former FBI special agent Stuart Kaplan makes his case for Kash Patel as President-elect Donald Trump's pick for FBI director on 'Jesse Watters Primetime.'\nCritics of \"deep state\" foe Kash Patel,President-elect Trump’spick to lead the FBI, call the veteran official a \"danger\" to the U.S. who will politicize the bureau – but a review of the agency's recent history shows the upper echelon of the FBI has long had a politicization problem, and Patel says he's just the man to end it.\nTrump announced over the weekend that he is nominating Patel as FBI director, after years as a public defender and working up the echelons of the federal government, including as senior director for counterterrorism at the National Security Council under the Trump administration, and chief of staff to acting Secretary of Defense Christopher Miller toward the end of Trump's first term.\nPatel is an outspoken crusader against the \"deep state.\" In a book published last year, he explicitly called for revamping the FBI in a chapter dubbed \"Overhauling the FBI,\" and moving the FBI’s headquarters out of Washington, D.C.\nSince 2013, the FBI has seen three directors take the helm: James Comey, who served under the Obama administration before Trump fired him in May 2017; short-term acting-director Andrew McCabe under the Trump administration; and current director, Christopher Wray, whom Trump also appointed.\nWHO IS KASH PATEL? TRUMP'S PICK TO LEAD THE FBI HAS LONG HISTORY VOWING TO BUST UP 'DEEP STATE'\nAmid the political left’s outrage over the Patel pick, Fox News Digital revisited a handful of the agency’s scandals that were lambasted as politically motivated and spoiling the integrity of the agency.\nEx-FBI official Peter Strzok was fired in 2018 for sending out anti-Trump texts.(Reuters)\nIn 2017, the FBI and Special Counsel Robert Mueller came under fire when it was revealed that two FBI employees tasked with investigating and handling alleged Russian interference into the 2016 election had texted each other anti-Trump rhetoric.\nDOJ SETTLES WITH FORMER FBI OFFICIALS OVER RELEASE OF ANTI-TRUMP TEXTS\n\"[Trump’s] not ever going to become president, right? Right?!\" FBI attorney Lisa Page texted FBI agent Peter Strzok in August 2016, Fox Digital previously reported.\n\"No. No he won’t. We’ll stop it,\" Strzok responded.\nStrzok wrote in another August 2016 text, seemingly referring to Trump’s chance of winning the 2016 election: \"I want to believe the path you threw out for consideration in Andy’s office – that there’s no way he gets elected – but I’m afraid we can’t take that risk. It’s like an insurance policy in the unlikely event you die before you’re 40.\"\nStrzok and Page were both working on Mueller’s investigation into Russian interference in the 2016 election – which ultimately found no evidence that Trump or his campaign coordinated with Russia – before Mueller dismissed Strzok from the investigation amid the text scandal. Page left the team before the text messages were discovered and revealed to the public.\nLisa Page arrives on Capitol Hill, July 16, 2018, to speak before the House Judiciary and Oversight Committee.(Andrew Caballero-Reynolds/AFP via Getty Images)\nThe pair had also worked together on the investigation into former Secretary of State Hillary Clinton’s use of a private email server for official government duties.\nThe FBI ultimately fired Strzok in 2018 over the texts, as conservative lawmakers and critics lambasted ​​the \"bias\" within the FBI.\n\"In Louisiana, we call that bias, we don't call that objective,\" Sen. John Kennedy, R-La., said on Fox News at the time.\nWhile then-House Oversight and Government Reform Committee Chairman Trey Gowdy said: \"Peter Strzok's manifest bias trending toward animus casts a pall on this investigation… His bias impacted his decision-making and he assigned to himself the role of stopping the Trump campaign or ending a Trump Presidency.\"\n\"This is not the FBI I know,\" the South Carolina Republican added.\nTrump slammed the scandal as an instance of \"treason.\"\n\"A man is tweeting to his lover that if [former Democratic nominee Hillary Clinton] loses, we'll essentially do the insurance policy,\" Trump said in an interview with the Wall Street Journal in 2018. \"We'll go to phase two and we'll get this guy out of office.\"\nDISGRACED EX-FBI AGENT PETER STRZOK REACTS TO DURHAM REPORT ON TRUMP-RUSSIA COLLUSION WITH VICTORY LAP\n\"This is the FBI we're talking about – that is treason,\" he continued. \"That is a treasonous act. What he tweeted to his lover is a treasonous act.\"\nFormer FBI Deputy Director Andrew McCabe(Jahi Chikwendiu/The Washington Post via Getty Images)\nTrump dismissed FBI Director James Comey on May 9, 2017, with Deputy Director Andrew McCabe stepping up to take the helm of the agency for roughly three months before he was fired for allegedly leaking information to the press and initially lying about the leaks, Justice Department's internal watchdog found in a 2018 investigation.\nANDREW MCCABE, FBI OFFICIAL FIRED BY TRUMP ADMINISTRATION, GETS PENSION RESTORED\nMcCabe automatically assumed the responsibilities ofFBI director upon Comey’s firing,as the Trump administration searched for another FBI chief. McCabe had reportedly been in the running for the nomination, but was ultimately replaced by Wray in August of that year. Then-Attorney General Jeff Sessions fired McCabe just days before he would have been eligible for a lifetime pension after it was determined that he had leaked a self-serving story to the press regarding the bureau’s probe of Clinton’s email server, and then misled investigators on the matter.\nSessions said McCabe \"made an unauthorized disclosure to the news media and lacked candor − including under oath − on multiple occasions.\"\nThe DOJ IG report found McCabeleaked information of an August 2016 call to the Wall Street Journal for an Oct. 30, 2016, story titled \"FBI in Internal Feud Over Hillary Clinton Probe.\" The story focused on the FBI announcing the reopening of the Clinton investigation after finding thousands of her emails on a laptop belonging to former Democratic Rep. Anthony Weiner, who was married to Hillary Clinton aide Huma Abedin.\nARI FLEISCHER ON THE IRONY OF ANDREW MCCABE BLAMING THE WHITE HOUSE FOR POLITICIZING THE IG INVESTIGATION\nThe Journal reported a senior Justice Department official expressed displeasure to McCabe that FBI agents were still looking into the Clinton Foundation, and that McCabe had defended the FBI’s authority to pursue the issue.\nMcCabe filed a lawsuit over the firing, and saw his pension restored as part of a settlement deal that also vacated Sessions’ decision, and removed any mention of being fired from McCabe’s FBI record.\nThe FBI seal is displayed on a podium before a news conference at the agency's headquarters in Washington.(AP Photo/Jose Luis Magana, File)\nUnder Director Comey’s tenure as FBI chief, the agency came under fire when media outlets began reporting in 2019 that the DOJ’s watchdog made a criminal referral to U.S. prosecutor John Durham regarding FBI attorney Kevin Clinesmith, elevating the investigation from an inquiry to a criminal probe. Durham was the U.S. attorney for Connecticut and later tapped by then-Attorney General Bill Barr to lead a criminal investigation into the origins of the FBI investigating alleged Russian interference in the 2016 election.\nClinesmith had worked on the FBI's Crossfire Hurricane investigation, which investigated alleged claims Russia interfered in the 2016 election,when Trump won the Oval Officein his campaign against Clinton.\nEX-FBI LAWYER KEVIN CLINESMITH GIVEN PROBATION AFTER GUILTY PLEA IN JOHN DURHAM PROBE\nThe DOJ inspector general accused Clinesmith, though not by name, of altering an email about former Trump campaign adviser Carter Page to say that he was \"not a source\" for another government agency, downplaying Page’s relationship with the CIA. Page had worked as an \"operational contact\" for the CIA for about five years until 2013.\nThe Justice Department relied on Clinesmith’s altered email assertion as it submitted a third and final renewal application in 2017 to eavesdrop on Page under the Foreign Intelligence Surveillance Act (FISA).\nThe Justice Department’s charging documentstated that Clinesmith \"did willfully and knowingly make and use a false writing and document, knowing the same to contain a materially false, fictitious, and fraudulent statement and entry in a matter before the jurisdiction of the executive branch and judicial branch of the Government of the United States.\"\nClinesmith ultimately pleaded guilty to \"one count of making a false statement within both the jurisdiction of the executive branch and judicial branch of the U.S. government, an offense that carries a maximum term of imprisonment of five years and a fine of up to $250,000.\"\nHe was sentenced in 2021 to 12 months probation and 400 hours of community service.\nEX-FBI LAWYER KEVIN CLINESMITH PLEADS GUILTY IN FIRST CRIMINAL CASE ARISING FROM DURHAM PROBE\nPage said the 2020 Clinesmith indictment was the \"first step on the road to justice\" for the FBI and DOJ, slamming Clinesmith's actions as \"false conspiracies and made-up lies paid for by Democrats.\"\n\"Friday was just a first step on the road to justice, because it was the first time that I started to see some semblance of justice from the DOJ and FBI with the fact they were acting in accordance with Crime Victims' Rights Act, a law that was totally avoided and not respected throughout last four years,\" Page told \"Mornings with Maria\"at the time.\nTrump’s first national security adviser Michael Flynn, who also served as Obama administration Defense Intelligence Agency chief, was embroiled in FBI legal woes at the start of Trump’s first administration amid the FBI’s Crossfire Hurricane investigation, which ultimately sparked the Mueller investigation and was followed by the Durham report.\nIn December 2017, when Comey helmed the FBI, Flynn struck a plea deal with Mueller, pleading guilty to giving false statements to the FBI, which included comment regarding his communications with a Russian ambassador. Flynn also admitted to filing paperwork under the Foreign Agents Registration Act that contained misrepresentations regarding business with Turkey.\nGEN. MICHAEL FLYNN DECRIES DEEP STATE: 'WE HAVE TWO SEPARATE GOVERNMENTS'\nThe plea deal included Flynn’s cooperation with Mueller’s special counsel investigation into Trump's alleged connections to Russia during the 2016 election.\nIn 2019, however, Flynn claimed innocence and accused the FBI of misconduct. Internal FBI documents made public in 2020 showed top FBI leadership discussing the motivation behind interviewing Flynn when he served as national security adviser and whether their \"goal\" was \"to get him to lie, so we can prosecute him or get him fired.\"\nThe documents were handwritten notes between the FBI's former head of counterintelligence Bill Priestap following a meeting with Comey and McCabe, Fox News Digital previously reported. The notes suggested that agents also planned to get Flynn \"to admit to breaking the Logan Act\" when he spoke to then-Russian Ambassador Sergey Kislyak during the presidential transition period.\nStrzok was notably one of the FBI agents who interviewed Flynn.\nMICHAEL FLYNN SAYS HE FACED 'POLITICAL PERSECUTION OF THE HIGHEST ORDER'\nTrump ultimately pardoned Flynn in 2020 and his case was dismissed. Flynn has since said he faced a \"political persecution of the highest order.\"\n\"So, you know, we went and made the decision that this was the direction that we wanted to go and good enough for President Donald Trump for coming through, and we’re certainly grateful to him,\" Flynn said in 2020 on Fox News. \"But at the same time, we also know that this was a political persecution of the highest order and not something that any American should ever have to go through.\"\nKash Patel was lead investigator on the Russia-gate investigation for the House Permanent Select Committee on Intelligence.(Kash Patel headshot)\nTrump announced over the weekend that he is nominating Patel as FBI director, touting him as someone who will \"end the growing crime epidemic in America, dismantle the migrant criminal gangs, and stop the evil scourge of human and drug trafficking across the Border.\"\nPatel has been a staunch Trump ally, including joining the 45th president during his trial in Manhattan in the spring, and echoing that the United States’ security and law enforcement agencies, including the FBI, need to be overhauled. Patel published a book last year called \"Government Gangsters,\" where he railed against the \"deep state,\" the weaponization of the federal government and the Russia investigation into Trump.\n\"Things are bad. There’s no denying it,\" Patel wrote in his book. \"The FBI has gravely abused its power, threatening not only the rule of law, but the very foundations of self-government at the root of our democracy. But this isn’t the end of the story. Change is possible at the FBI and desperately needed,\" he wrote.\n\"The fact is we need a federal agency that investigates federal crimes, and that agency will always be at risk of having its powers abused,\" he continued, advocating the firing of \"corrupt actors,\" \"aggressive\" congressional oversight over the agency, complete overhauls to special counsels, and moving the FBI out of Washington, D.C.\nPresident-elect Trump speaks at a House Republicans Conference meeting at the Hyatt Regency on Capitol Hill on Nov. 13, 2024.(Allison Robbert-Pool/Getty Images)\nDemocrats and liberal members of the media have slammed Trump’s choice of Patel, calling him as a \"danger\" to the U.S. and \"unqualified\" for the role.\n\"It’s a terrible development for the men and women of the FBI and also for the nation that depends on a highly functioning, professional, independent Federal Bureau of Investigation. The fact that Kash Patel is profoundly unqualified for this job is not even, like, a matter for debate,\" McCabe said on CNN following the announcement. \"The installation, or the nomination, I guess we should say at this point, of Kash Patel as FBI director can only possibly be a plan to disrupt, to dismantle, to distract the FBI, and to possibly use it as a tool for the president’s political agenda.\"​\nBefore Patel could assume the role as FBI chief, Wray would need to step down or be fired, as he is in the midst of a 10-year appointment that does not end until 2027. The Senate would also have to confirm Patel.\nCLICK HERE TO GET THE FOX NEWS APP\n\"It is the honor of a lifetime to be nominated byPresident Trump to serve as Director of the FBI,\" Patel said in a statement following the announcement. \"Together, we will restore integrity, accountability, and equal justice to our justice system and return the FBI to its rightful mission: protecting the American people.\"\nFox News Digital's Brooke Singman, Ronn Blitzer and Joseph Wulfsohn contributed to this report."}, {"source": "foxnews", "title": "Israel's Netanyahu reacts after Trump warns of 'hell to pay' if Hamas doesn't free hostages", "link": "https://www.foxnews.com/world/israels-netanyahu-reacts-after-trump-warns-hell-pay-hamas-doesnt-free-hostages", "content": "Hudson Institute senior institute Rebeccah Heinrichs assesses the state of the Israeli-Hezbollah ceasefire, discusses Syrian rebels seizing parts of Aleppo and how the U.S. can aid in negotiations to end the Russia-Ukraine war.\nIsraeli Prime Minister BenjaminNetanyahusays President-elect Donald Trump is in the \"right place\" when it comes to his warning of there being \"hell to pay\" if Hamas doesn’t release their remaining hostages.\n\"President Trump put the emphasis in the right place, on Hamas, and not on the Israeli government, as is customary [elsewhere],\" Netanyahu said Tuesday at the beginning of a cabinet meeting,according to Reuters.\nTrump on Monday called on Hamas to release all hostages prior to when he takes office on Jan. 20.\nIn a Truth Social post, Trump said nothing was being done to free those being held by the Iran-backed terror group since Oct. 7, 2023, after Hamas attacked Israel and killed at least 1,200 people and kidnapped at least 250 others. Of the 101 hostages that remain in Gaza, seven are Americans.\nAMERICAN-ISRAELI IDF PLATOON COMMANDER KILLED IN BATTLE, BODY HELD IN GAZA, IDF SAYS\nFormer President Donald Trump shakes hands with Israeli Prime Minister Benjamin Netanyahu as they pose for a photo during their meeting at Trump's Mar-a-Lago estate in Palm Beach, Florida, on July 26, 2024.(Amos Ben-Gershom (GPO) / Handout/Anadolu via Getty Images)\n\"Everybody is talking about the hostages who are being held so violently, inhumanely, and against the will of the entire World, in the Middle East – But it’s all talk, and no action!\"Trump wrote.\n\"Please let this TRUTH serve to represent that if the hostages are not released prior to January 20, 2025, the date that I proudly assume Office as President of the United States, there will be ALL HELL TO PAY in the Middle East, and for those in charge who perpetrated these atrocities against Humanity,\" Trump added.\n7 US HOSTAGES ARE STILL HELD BY HAMAS TERRORISTS\nIsraeli Prime Minister Benjamin Netanyahu makes a televised statement on Nov. 26, 2024, in Jerusalem, Israel.(Israeli Government Press Office via AP)\nThe message also drew support from Israeli Finance Minister Bezalel Smotrich.\nHamas terrorists are still holding 101 hostages in the Gaza Strip.(Yousef Masoud/Majority World/Universal Images Group via Getty Images)\nCLICK HERE TO GET THE FOX NEWS APP\n\"This is the way to bring back the hostages: by increasing the pressure and the costs for Hamas and its supporters, and defeating them, rather than giving in to their absurd demands,\" Reuters quoted him as saying.\nFox News’ Louis Casiano contributed to this report.\nGreg Norman is a reporter at Fox News Digital."}, {"source": "foxnews", "title": "Dem Rep. Dean Phillips blasts Biden after Hunter pardon, says some people ‘are indeed above the law’", "link": "https://www.foxnews.com/politics/dem-rep-dean-phillips-blasts-biden-after-hunter-pardon-some-people-are-indeed-above-law", "content": "OutKick founder Clay Travis joins 'The Faulkner Focus,' criticizes President Biden as 'a complete and total liar' after issuing a pardon for his son Hunter and calls on President-elect Trump to pardon all January 6 rioters.\nA Democratic U.S. congressman on Monday said it appears that certain people are \"above the law\" afterPresident Bidenpardoned his son, Hunter Biden, despite repeatedly saying he would not give his son a pass.\nRep. Dean Phillips, D-Minn., responded to Biden’s decision to pardon Hunter on social media, blasting the president’s own words from earlier this year that \"no one is above the law.\"\n\"Let’s just say the quiet part out loud, certain Americans are indeed above the law and influence is always for sale,\" Phillips wrote on X. \"It’s time for the exhausted majority to condemn and confront legalized corruption.\"\nPresident Biden issued a sweeping pardonfor Hunter Biden on Sunday after he had repeatedly said he would not do so. The first son had been convicted in two separate federal cases earlier this year. He pleaded guilty to federal tax charges in September, and was convicted of three felony gun charges in June after lying on a mandatory gun purchase form by saying he was not illegally using or addicted to drugs.\nHUNTER BIDEN GUN CASE TERMINATED AFTER PARDON, BUT FEDERAL JUDGE STOPS SHORT OF FULL DISMISSAL\nPhillips called out the \"legalized corruption\" in politics and argued that pardoning powers have been \"abused\" by presidents of both major political parties.(Reuters/Tom Brenner, File)\nThe presidentargued in a statementthat Hunter was \"singled out only because he is my son\" and that there was an effort to \"break Hunter\" in order to \"break me.\"\nBiden had stated on record multiple times that hewould not pardon Huntershould a jury convict his son.\nPresident Joe Biden pardoned his son Hunter Biden on Sunday.(AP Photo/Jose Luis Magana)\nPhillips, who unsuccessfully ran for the Democratic nomination for president, argued that perhaps both Hunter Biden and Trump may not have been charged in their respective criminal cases under different circumstances.\n\"Two things can be true at once: Neither Hunter Biden nor Donald Trump would have been charged with certain crimes had they not been political figures,\" he wrote. \"Pardoning powers have been abused by Trump and now Biden, and must be reformed.\"\nTAPPER SAYS BIDEN LYING ABOUT PARDONING HUNTER MAKES HIS ADMIN AND ALLIES ‘EITHER CREDULOUS OR COMPLICIT’\nThe pardon has beenmet with widespread criticismfrom Republicans, some Democrats and the media.\nReporters grilled White House press secretary Karine Jean-Pierre on Monday, asking whether Biden and his surrogates lied to the American people.Jean-Pierre responded,\"One thing the president believes is to always be truthful with the American people,\" and repeatedly pointed to Biden’s own statement on the matter.\nCLICK TO GET THE FOX NEWS APP\nBiden has yet to take questions from reporters on why he broke his pledge to Americans and decided to pardon the first son.\nFox News Digital's Alexander Hall contributed to this report."}, {"source": "foxnews", "title": "Mar-a-Lago trumps White House as president-elect overshadows Biden on world stage", "link": "https://www.foxnews.com/politics/mar-a-lago-trumps-white-house-president-elect-overshadows-biden-world-stage", "content": "Fox News' Brooke Singman reports the latest on the president-elect.\nPresident Bidenenjoyed a warm welcome from a crowd of thousands as he arrived in Angola this week, as the president made good on his long awaited first visit to sub-Saharan Africa.\nBiden, likely on his last overseas trip beforePresident-elect Donald Trumptakes over in the White House next month, is already being overshadowed on the world stage by his predecessor and successor.\n\"The Oval Office has been replaced by Mar-a-Lago,\" Matthew Bartlett, a Republican strategist who served at the State Department during Trump's first term, told Fox News.\nAdditionally, Matt Mowers, a veteran GOP national public affairs strategist and former diplomat at the State Department during Trump's first administration, made the case that \"Joe Biden’s essentially been a lame duck\" for months and that \"world leaders have been shifting their gaze to the next administration.\"\nWHAT TRUMP TOLD CANADA'S LEADER BEHIND CLOSED DOORS\nPresident Biden walks from Air Force One as he arrives at Quatro de Fevereiro International Airport in Luanda, Angola on Monday, Dec. 2, 2024 on his long-promised visit to Africa.(AP Photo/Ben Curtis)\nWayne Lesperance, a veteran political scientist and president of New England College, highlighted that \"while President-elect is still weeks away from taking the oath of office, loyalties and the attention of world leaders has shifted to the incoming President and from Washington to Mar-a-lago with breathtaking speed.\"\nWhile members of the Biden White House would likely disagree with such sentiments - especially after the current administration played a large role in hammering out the cease-fire that halted fighting in Lebanon between Israel and Hezbollah - it is undeniable that world leaders have already started to engage directly with the incoming president and administration.\nTRUMP GETS READY TO MAKE A SPLASH ON THE WORLD STAGE\nTrump will meet withFrench President Emmanuel Macronafter the French president invited him to attend Saturday's star-studded VIP event for the official reopening of the newly restored Notre Dame Cathedral, five years after a devastating fire wrecked the Paris landmark.\nThe president-elect's appearance will serve as Trump's unofficial return to the global stage, and it is another reminder that he is quickly becoming the center of the world's attention.\nFrench President Emmanuel Macron, left, shakes hands with then-President Trump at an arrival ceremony during a state visit in Washington, D.C., on Tuesday, April 24, 2018. Trump will attend the re-opening celebration of the Notre Dame Cathedral this weekend, five years after a fire heavily damaged the structure.(Getty Images)\nThe trip to Paris comes a week afterCanadian Prime Minister Justin Trudeauhastily made an unannounced stop in Mar-a-Lago to dine with Trump after the president-elect threatened a trade war with Canada and Mexico.\nTrump argued that Canada had failed to prevent large amounts of drugs and undocumented people from crossing the northern border into the U.S. and also pointed to America's massive trade deficit with Canada.\nAccording to reporting fromFox News' Bret Baier,Trump suggested to Trudeau that Canada could become the 51st state.\nCanadian Prime Minister Justin Trudeau, left, met with President-elect Donald Trump at Mar-a-Lago in Florida on Friday, Nov. 29, 2024 to discuss topics like the economy, illegal immigration and a proposed 25% tariff.(Justin Trudeau X)\nTrump also weighed in this week in the volatile Middle East, warning in a social media post that there would be \"ALL HELL TO PAY\" if Hamas does not release all the hostages held in Gaza before he is inaugurated on Jan. 20.\nHours later, Trump pledged to block the purchase of U.S. Steel - a top American manufacturer - by the Japanese company Nippon Steel.\n\"I am totally against the once great and powerful U.S. Steel being bought by a foreign company, in this case Nippon Steel of Japan,\" Trump said on social media. \"As President, I will block this deal from happening.\"\nTrump, who reiterated comments he made earlier this year on the presidential campaign trail, is on the same page as Biden, who has vowed that U.S. Steel will remain American-owned.\nBiden's trip to Africa is putting a spotlight on his administration's commitment to the continent, which has increasingly been courted by massive investments from China. Biden is also highlighting America's wide-ranging effort to combat HIV/AIDS in Africa, a continent Trump never visited during his first term in the White House.\nPresident Biden, left, stands for national anthems with Angolan President Joao Lourenco at the presidential palace in Luanda, Angola on Tuesday, Dec. 3, 2024.(AP Photo/Ben Curtis)\nHowever, the president's trip will be overshadowed by Trump's upcoming stop in France, as the president-elect is increasingly courted by world leaders.\nWhile the spotlight traditionally shifts from the outgoing to the incoming president, Mowers argued that \"it is more pronounced this time because the difference in the Biden and Trump approach to foreign policy is so different.\"\nMowers emphasized that Trump is already aiming \"to shape world events\" by \"being bold, not timid, in the statements he’s putting out, and the world is already reacting to that kind of American strength.\"\nBartlett noted that \"the world is demanding leadership.\" Mowers added that \"world leaders that want to get something done… have to engage with Trump.\"\nCLICK HERE TO GET THE FOX NEWS APP\nLesperance, pointing to Biden's swing through Africa, noted that lame duck presidents' final weeks are \"usually filled with celebratory moments and efforts to cement one’s legacy. Often the focus is on their role on the world stage on behalf of America and its allies.'\nHowever, he argued that \"Biden’s pronouncements on Ukraine, Gaza and the importance of climate change go largely ignored by world leaders. Instead, they focus on Trump’s picks for his foreign policy team and pronouncements about changes in U.S. foreign policy position. It’s pretty evident that while Biden attempts a victory tour, the world has turned the page.\""}, {"source": "foxnews", "title": "Dem lawmaker joins Republican-led DOGE Caucus with push to remove Secret Service from DHS", "link": "https://www.foxnews.com/politics/dem-lawmaker-joins-republican-led-doge-caucus-push-remove-secret-service-from-dhs", "content": "Geltrude & Company founder Dan Geltrude and Strategic Wealth Partners investment strategist Luke Lloyd discuss DOGE's push to tackle government spending, how President-elect Trump can impact the economy and the market's performance.\nRep. Jared Moskowitz, D-Fla., announced on Tuesday that he would be joining the House of Representatives'DOGE Caucus, becoming the first Democrat in the now-bipartisan group.\nHe advocated for removing the U.S. Secret Service (USSS) from the purview of the Department of Homeland Security (DHS), something floated by several Republican lawmakersmonths ago.\n\"Today I will join the Congressional DOGE Caucus, because I believe that streamlining government processes and reducing ineffective government spending should not be a partisan issue,\" Moskowitz said in a statement.\nELON MUSK SAYS THERE'S SUBSTANTIAL IGNORANCE ABOUT AMERICA'S NATIONAL DEBT\nRep. Jared Moskowitz announced he wants to work with Republicans to cut the federal bureaucracy, and suggested decoupling the Secret Service from DHS.(Getty Images)\nThe DOGE Caucus, standing for Delivering Outstanding Government Efficiency, was launched by Reps. Pete Sessions, R-Texas, and Aaron Bean, R-Fla., soon after President-elect Donald Trump announced a DOGE advisory panel to be led by Elon Musk and Vivek Ramaswamy.\n\"I’ve been clear that there are ways we can reorganize our government to make it work better for the American people. Specifically, the Department of Homeland Security, while very necessary, has gotten too big,\" Moskowitz said.\nHe suggested USSS, along with the Federal Emergency Management Agency (FEMA), should become \"independent federal agencies with a direct report to the White House.\"\n\"It’s not practical to have 22 agencies under this one department. I look forward to working in a bipartisan manner with my colleagues to remove FEMA and Secret Service from DHS,\" Moskowitz said.\nMIKE JOHNSON WINS REPUBLICAN SUPPORT TO BE HOUSE SPEAKER AGAIN AFTER TRUMP ENDORSEMENT\nRep. Aaron Bean co-founded the DOGE Caucus.(Tom Williams/CQ-Roll Call, Inc via Getty Images)\nIt is a particularly notable position for the Florida Democrat to take, considering his deep familiarity with both agencies.\nBefore coming to Congress, Moskowitz served as Florida's director of Emergency Management under Republican Gov. Ron DeSantis. He has also previously pushed todecouple FEMA from DHSalongside Rep. Garret Graves, R-La.\nAs a lawmaker, he is also a member of the bipartisan House task force investigating the assassination attempts against Trump.\nUS NATIONAL DEBT HITS A NEW RECORD: $36 TRILLION\nVivek Ramaswamy and Elon Musk were tapped by President-elect Trump to lead an advisory panel on government efficiency.(Getty Images/AP Images)\nCLICK HERE TO GET THE FOX NEWS APP\nThe DOGE Caucus is one of several overtures by House Republicans to get in step with Musk and Ramaswamy's new mission.\nHouse Oversight Committee Chairman James Comer, R-Ky., recently announced the next Congress would see a special subcommittee on government efficiency led by Rep. Marjorie Taylor Greene, R-Ga.\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com"}, {"source": "foxnews", "title": "ANDREW McCARTHY: The real reason Hunter Biden's pardon goes all the way back to 2014", "link": "https://www.foxnews.com/opinion/andrew-mccarthy-real-reason-hunter-bidens-pardon-goes-all-way-back-2014", "content": "Fox News' Trey Gowdy and Andrew McCarthy unpack the debates surrounding President Biden's pardon of son Hunter and Trump picking Kash Patel to head the FBI on 'Special Report.'\nAn intriguing aspect ofPresident Biden’s pardon of his son Hunter– which was utterly predictable, andpredicted, notwithstanding the president’s repeated, indignant insistence that it would never happen – is the sweep of the clemency order.\nBiden didn’t limit his son’s insurance against future prosecution to the two cases – criminal gun and tax prosecutions – on which he’s been found guilty (by a jury in the former and a judge who took his guilty plea in the latter). The pardon covers all potential federal crimes in which he may have culpability from Jan. 1, 2014, through Sunday night (Dec. 1, 2024).\nWhy 2014?\nWell, the most damning evidence of the Biden family influence-peddling business occurred in the last years of Joe Biden’s term as vice president – specifically, 2014 through 2016. That, of course, is when the Burisma hijinks began. Indeed, Hunter’s board seat on the corrupt energy company’s board was so manifestly tied to his father’s political influence that, as soon as Biden left office in 2017, Burisma slashed Hunter’s compensation in half.\nJONATHAN TURLEY: JOE BIDEN'S PARDON OF SON HUNTER CEMENTS HIS LEGACY AS LIAR IN CHIEF\nNot only that. The two lucrative schemes tied to the Chinese Communist Party – the Bohai Harvest RST investment enterprise and CEFC through which the Bidens netted several million dollars – also began in that 2014-16 time frame. So did the scheme in which Hunter collected a cool million from Romanian businessman Gabriel Popoviciu.\nThe Joe Biden vice-presidency phase also included the big Café Milano dinner in Washington, at which the then-VP rubbed elbows with a number of Hunter’s foreign business partners (the ones Joe Biden, when not making no-pardon vows, told us again and again he had nothing to do with because he never discussed business with Hunter). The guest list for that dinner includedEleana Baturina, the billionaire widow of Putin crony Yuri Luzhkov (the former mayor of Moscow) who also had a multi-million dollar transaction with Hunter.\nAs I’ve detailed, the Romanian scheme mirrors the Burisma scheme: As the VP anchoring Obama administration foreign policy, Joe Biden publicly harangued governments in Bucharest and Kyiv to intensify their anti-corruption efforts; that paved the way for his enterprising son to earn millions from those governments’ corruption targets (such as Popoviciu and Burisma’s Mykola \"Nicolay\" Zlochevsky) by using the specter of the then-VP’s political influence in seeking favorable treatment from those governments. And who can forget then-Vice President Biden’s threat to the fledgling Ukrainian regime that a billion dollars in desperately needed U.S. funding would be withheld unless Kyiv fired the prosecutor who just happened to be investigating Zlochevsky and Burisma.\nNaturally, among the questions raised by all this is why Hunter and those in cahoots with him were not prosecuted for failing to register as foreign agents – the FARA law about which theBiden Justice Department touts its enforcement efforts.\nCLICK HERE FOR MORE FOX NEWS OPINION\nMoreover, if we had a one-tiered justice system in which everyone was treated equally, we couldn’t help but notice that the facts of the Biden foreign business arrangements are remarkable similar to those arising from the Ukrainian business activities of Paul Manafort, President Trump’s one-time 2016 campaign chairman.\nSpecial counsel Robert Muellerand his staff, which included several activist Democrats, threw the book at Manafort – not only tax and FARA charges but bank fraud, money laundering, etc. By the time he was convicted, Manafort was 69; and the charges against him had nothing to do with the focus of Mueller’s probe, the bogus claim of Trump \"collusion\" with Russia; the prosecutors were squeezing him in hopes that they’d give him something –anything– on the then-president.\nPresident Biden and Hunter Biden head toward Marine One on the South Lawn of the White House, July 26, 2024.(AP Photo/Susan Walsh, File)\nBecause of that and many other examples of our two-tiered system, there have been some aggressive statements from the Trump camp that his election means the tables have turned. I suspect that this is hot rhetoric that will blow over, at least with respect tothe Biden family. The period from 2014 to 2016 was a long time ago. Even if theTrump Justice Departmentwere interested in pursuing new charges – again, I doubt that – the relevant statutes of limitations (five years for most federal crimes, six for some relevant tax crimes) have already expired.\nStill, President Biden is taking no chances. After all, an aggressive, creative prosecutor (perhaps in the mold of Jack Smith, but this time a zealous Republican) could cobble together a theory that Hunter and his cohorts – perhaps including the president and his brother Jim – were in a conspiracy that continued after 2016, perhaps even into 2020 and beyond. The proof for that might not be strong, it might even be non-existent. But in light of the evidence – including the evidence developed by the House Oversight Committee, which found thatthe Bidens reeled in over $27 millionfrom foreign persons and entities from 2014 to 2019 – there would certainly be a sufficient basis for a criminal investigation.\nCLICK HERE TO GET THE FOX NEWS APP\nAnd as people in the Trump orbit who’ve been hounded by Democratic prosecutors and committees can tell you, investigations are ruinous. They cost a fortune in legal fees, they dry up business opportunities, and they impose tremendous anxiety on suspects and their families.\nThe breathtaking expanse of Hunter’s pardon – nearly 11 years for someone the president repeatedly told us had done nothing wrong – is clearly an effort to foreclose any further investigation ofthe president’s sonover the 2014-16 period from which the Biden Justice Department quite intentionally averted its eyes.\nCLICK HERE TO READ MORE FROM ANDREW McCARTHY\nAndrew C. McCarthy serves as a FOX News contributor and is a senior fellow at the National Review Institute and a contributing editor of National Review. Follow him on Twitter@andrewcmccarthy"}, {"source": "foxnews", "title": "Rod Blagojevich rips Biden, Democrats for lying about pardoning Hunter: Made 'chumps of the American people'", "link": "https://www.foxnews.com/media/rod-blagojevich-rips-biden-democrats-lying-about-pardoning-hunter-made-chumps-american-people", "content": "Former Illinois Gov. Rod Blagojevich joins 'America's Newsroom' to discuss Chicago residents' frustration at local Democratic officials for prioritizing spending on migrants and President Biden's pardon for his son Hunter.\nFormer Illinois Gov. Rod Blagojevich, a Democrat whose 14-year corruption sentence was commuted by former President Trump, called out President Biden for lying to the American people about his intentions of pardoning his son, Hunter.\nBlagojevich, who was released in 2020 after serving eight years behind bars in Colorado, wasconvicted in his second trialin 2011 on 18 counts, including trying to sell former President Obama’s old Senate seat. His first trial ended with the jury unable to reach a verdict, except for a single conviction, for lying to the FBI.\nTRUMP ASKS ABOUT ‘J-6’ HOSTAGES IN RESPONSE TO BIDEN'S PARDON OF HUNTER: ‘SUCH AN ABUSE’\n\"My case is different from Hunter Biden,\" Blagojevich told Bill Hemmerduring \"America's Newsroom\"on Tuesday. \"He really committed crimes. I didn't. I was in prison for politics. I wouldn't give in to weaponized prosecutors.\"\n\"Joe Biden's a father. I'm a father. I have to think that under the same circumstances, I probably would have done the same thing for my child,\" he continued. \"Having said that, I wouldn't have lied to the American people. Joe Biden knew all along that he was going to do this for his son. How could he not?\"\nPresident Biden walks with Hunter Biden toward Marine One on the South Lawn of the White House, July 26, 2024.(AP Photo/Susan Walsh, File)\nPresident Bidenissued a sweeping pardonfor Hunter on Sunday after he had repeatedly said he would not do so.\nThe first son had been convicted in two separate federal cases earlier this year. He pleaded guilty to federal tax charges in September, and was convicted of three felony gun charges in June after lying on a mandatory gun purchase form by saying he was not illegally using or addicted to drugs.\nThe presidentargued in a statementthat Hunter was \"singled out only because he is my son\" and that there was an effort \"trying to break Hunter\" in order to \"break me.\"\nCritics have been quick to call out the White House for reversing course on previous vows against pardoning the first son.\nHUNTER BIDEN SAYS HIS MISTAKES WERE ‘EXPLOITED’ FOR POLITICAL SPORT, SAYS HE WON'T TAKE PARDON FOR GRANTED\n\"Right from the beginning, he lied to the American people, making chumps of the American people,\" Blagojevich said. \"And here [is] just another lie coming from Democratic political leaders who have cynical purposes for political reasons instead of being straight with the American people. So I think it was wrong the way he handled it. It's hard for me to condemn a guy who is looking after his son.\"\nDespite critics' claims the White House lied about Biden's intentions, White House press secretary Karine Jean-Pierre argued the American people werenever fed lieswhile speaking with reporters on the way to Angola.\n\"One thing the president believes is to always be truthful with the American people,\" Jeane-Pierre said Monday, repeatedly saying that Biden \"wrestled with [the decision].\"\nShe was peppered with questions about the pardon and why Biden decided to go forward with it last weekend, mostly repeating many points in the president's statement from Sunday night, such as Hunter was \"singled out politically.\" She also teased that there could be more pardons on the horizon before Biden leaves office.\n\"There's a process in place, obviously,\" she told reporters. \"And so, I'm not going to get ahead of the president on this, but you could expect more announcements, more pardons, clemency at the end of this term.\"\nFox News' Alexander Hall, Stephen Sorace and Brie Stimson contributed to this report.\nCLICK TO GET THE FOX NEWS APP\nBailee Hill is an associate editor with Fox News Digital. Story ideas can be sent to bailee.hill@fox.com"}, {"source": "foxnews", "title": "Israel warns it will go after Lebanon directly if cease-fire with Hezbollah collapses", "link": "https://www.foxnews.com/world/israel-warns-go-after-lebanon-directly-cease-fire-hezbollah-collapses", "content": "Hudson Institute senior institute Rebeccah Heinrichs assesses the state of the Israeli-Hezbollah cease-fire, discusses Syrian rebels seizing parts of Aleppo and how the U.S. can aid in negotiations to end the Russia-Ukraine war.\nIsraelissued a direct warningto Lebanon on Tuesday and said it will no longer distinguish between Hezbollah and the country should the tenuous cease-fire with the terrorist group collapse.\n\"There will no longer be an exemption for the state of Lebanon,\" Israeli Defense Minister Israel Katz said,according to the Times of Israel, adding that Jerusalem will \"show maximum response and zero tolerance.\"\n\"[Beirut must] authorize the Lebanese army to enforce their part, to keep Hezbollah away beyond the Litani [River] and to dismantle all the infrastructure,\" Katz continued in reference to one of the 13-point agreements in the Wednesday cease-fire that said only the Lebanese army will operate in the area south of the landmark river.\nIsraeli Defense Minister Israel Katz looks on amid the ongoing conflict in Gaza between Israel and Hamas, in Jerusalem on Nov. 7, 2024.(REUTERS/Ronen Zvulun)\nIDF SOLDIERS ACCUSE UN PEACEKEEPERS OF ENABLING HEZBOLLAH TERRORISTS AMID INCREASING CEASE-FIRE VIOLATIONS\n\"If they don’t do it and this whole agreement collapses, then the reality will be very clear. First of all, if we return to war we will act strongly, we will go deeper and the most important thing they need to know, that there will be no longer be an exemption for the state of Lebanon,\" he added.\n\"Until now we have distinguished between the state of Lebanon and Hezbollah, and between Beirut as a whole and Dahiyeh – which we have struck very hard – this will no longer be,\" Katz warned in reference to the Beirut suburb and previous Hezbollah stronghold.\nThe defense minister’s comments come after Israel fired a wave of strikes Monday evening that, according to The Associated Press,killed 11 peopleafter Hezbollah launched two mortars at the Mount Dov area in the northern Golan Heights–a contested area that is still internationally recognized as part of Syria, though which Israel has occupied since 1967.\nThe Trump administration recognized Israel's sovereignty over the Golan Heights in 2019. The Biden administration continued with that policy, reaffirming it again in the summer following a deadly Hezbollah rocket attack on the town ofMajdal Shamsthat killed 12 children.\nMembers of Imam al-Mahdi scouts clean rubble and debris from damaged buildings in Beirut's southern suburbs after the cease-fire between Israel and Hezbollah, in Lebanon on Dec. 2, 2024.(REUTERS/Mohamed Azakir)\nAMERICAN-ISRAELI IDF PLATOON COMMANDER KILLED IN BATTLE, BODY HELD IN GAZA, IDF SAYS\nThe terrorist group said it levied the first strike since the cease-fire was signed less than a week ago inresponse to Israel’s \"repeated violations\"involving Lebanese airspace, reported the Times of Israel.\nThe U.S. and France – which helped broker the truce – on Sunday and Monday alsoreportedly warned Israel it was violatingthe new agreement, including by conducting surveillance drone flights over Beirut.\nHowever, despite the tit-for-tat exchange that has drawn into question the strength of the new cease-fire agreement, White House National Security Council communications adviser John Kirby told reporters on Monday the \"sporadic\" air strikes were to be \"expected.\"\n\"You're talking about a war that's been raging now for actually many years,\" he said.  \"If you think about it, certainly since Oct. 7, we went from hundreds of rocket attacks to basically zero by Hezbollah and dozens of airstrikes by Israel to one or two per day.\"\nMourners raise their hands and chant slogans during the funeral procession of Hezbollah fighters who were killed in Friday's Israeli strike, in the southern suburb of Beirut on Saturday, Sept. 21, 2024.(AP)\nCLICK HERE TO GET THE FOX NEWS APP\n\"There's been a dramatic reduction in the violence,\" Kirby added.\nKirby said that in anticipation of similar strikes like those exchanged on Monday, there are \"mechanisms\" in place that are working to stop the attacks.\n\"That mechanism is in full force, and is working,\" he added without going into additional detail.\nCaitlin McFall is a Reporter at Fox News Digital covering Politics, U.S. and World news."}, {"source": "foxnews", "title": "NBC’s Chuck Todd says President Biden ‘needs therapy’ following son Hunter’s pardon", "link": "https://www.foxnews.com/media/nbcs-chuck-todd-president-biden-needs-therapy-son-hunters-pardon", "content": "Voters from Michigan, Georgia and Texas fetter over President Biden's pardoning of Hunter Biden's crimes as one of his last presidential acts with Fox News Digital.\nNBC News chief political analyst Chuck Todd offered a profoundly personal critique of President Biden following the commander-in-chief's controversial yet unsurprising decision topardon his son, Hunter.\nDuring his weekly sit-down with commentator Chris Cillizza on Cillizza'sSubstack page, Todd admitted he \"knew 100%\" that Biden would pardon his son—who was facing sentencing for two criminal cases.\n\"Joe Biden's got—needs therapy and I say this with respect. He has not processed Beau's death. He has an issue—he cannot, he has this issue with Hunter. He second-guesses everything he's done with raising Hunter versus raising Beau. He, I think blames himself for Hunter's inability to conduct himself as an adult for a period of time,\" Todd said.\nBeau passed away in 2015 following a battle with brain cancer.\nHUNTER BIDEN PARDON: MEDIA TAKES LATEST BLOW TO CREDIBILITY WITH BOTCHED COVERAGE OF BROKEN PROMISE\nChuck Todd suggested that Joe Biden is \"emotionally incapable\" of being president after pardoning his son, Hunter.(Michael Reynolds/EPA/Bloomberg | William B. Plowman/NBC via Getty Images)\nTodd, who noted he has had somewhat of a personal relationship with Biden's sons in the past, claimed that Hunter has \"sort of failed at being a human being\" in the last decade.\n\"There was no doubt that Joe Biden was not going to leave office without doing everything he could to protect his son. Pure and simple,\" Todd added, calling it a \"dad reaction.\"\nHe then went on to suggest that the possibility ofPresident-elect Donald Trumppardoning Hunter was a \"humiliation\" that Biden was never going to put himself through.\nHUNTER BIDEN ‘LAPTOP FROM HELL’ SCANDAL TURNS 4: HOW MEDIA, INTELLIGENCE COMMUNITY MISLED AMERICANS\nPresident Biden and Hunter Biden head toward Marine One on the South Lawn of the White House, July 26, 2024.(AP Photo/Susan Walsh)\nTodd concluded his response by claiming President Biden was \"emotionally incapable\" of being president and \"probably never should have run.\"\nIn a statement on Sunday night, Hunter Biden said that he would \"never take the clemency\" his father gave him for granted and that he plans to devote his life to helping those with addiction.\nThe younger Biden, 54, has had a busy year in court, kicking off his first trial in Delaware in June, when he faced three felony firearm offenses, before he pleaded guilty in a separate felony tax case in September.\nBiden pardoning his son is a departure fromhis previous remarksto the media over the summer, declaring he would not do so.\nFox News Digitalreached out to the Biden White House for comment, but did not immediately hear back.\nFox News' Emma Colton and Andrea Margolis contributed to this report.\nCLICK HERE TO GET THE FOX NEWS APP\nNikolas Lanum is an associate editor for Fox News Digital."}, {"source": "foxnews", "title": "GOP lawmaker gifts 'chip of the Berlin Wall' to colleagues in bid for top committee spot", "link": "https://www.foxnews.com/politics/joe-wilson-gifts-chip-berlin-wall-gop-lawmakers-bid-top-committee-spot", "content": "Hudson Institute senior institute Rebeccah Heinrichs assesses the state of the Israeli-Hezbollah ceasefire, discusses Syrian rebels seizing parts of Aleppo and how the U.S. can aid in negotiations to end the Russia-Ukraine war.\nFIRST ON FOX:A senior GOP lawmaker is getting creative with his campaign to chair the HouseForeign AffairsCommittee next year.\nRep. Joe Wilson, R-S.C., is giving fellow lawmakers chips from the Berlin Wall, according to a photo provided by a source to Fox News Digital.\nAn inscription accompanying the chip suggests Wilson got the pieces himself nearly 35 years ago, an indirect affirmation of his decades of foreign affairs work. \"This symbolizes the collapse of totalitarian communism and the success of democratic capitalism,\" the elaborate display reads.\nJOHNSON BLASTS DEM ACCUSATIONS HE VOWED TO END OBAMACARE AS 'DISHONEST'\nRep. Joe Wilson is one of four Republicans running for the House Foreign Affairs Committee gavel.(Getty Images/Fox News Digital)\nIt said the chip was \"secured by State Senator Joe Wilson on June 12, 1990, at the Brandenburg Gate in Berlin, Germany.\"\n\"Sen. Wilson was returning from service as a member of the U.S. Observation Delegation of the June 10, 1990, parliamentary elections in the Republic of Bulgaria, that country's first free elections after 59 years of Nazi and Communist dictatorship,\" it said.\nWilson told Fox News Digital the chips \"serve as important symbols of Peace through Strength.\" His office also provided a photo of Wilson, then a state lawmaker, chipping portions of the Berlin Wall himself.\n\"This is a critical time and as Chair I am best positioned to work with President Trump to present a unified, conservative vision for the House Foreign Affairs Committee and American foreign policy,\" he said of his candidacy.\nWhen reached for comment, Wilson's office sent Fox News Digital a photo of the congressman chipping pieces of the Berlin Wall himself(Office of Congressman Joe Wilson)\nThe race for the House Foreign Affairs Committee gavel is one of the most critical happening ahead of the 119th Congress.\nThe role will be of particular importance in U.S. relations with the rest of the globe next year, when Republicans are set to control all the mainlevers of powerin Washington, D.C.\nREPUBLICANS PROJECTED TO KEEP CONTROL OF HOUSE AS TRUMP PREPARES TO IMPLEMENT AGENDA\nWilson is runningagainst fellow committee members Reps. Ann Wagner, R-Mo., and Darrell Issa, R-Calif. The subcommittee chair for Oversight & Accountability, Rep. Brian Mast, R-Fla., is also in the race.\nWilson is chair of the panel's subcommittee on the Middle East, North Africa and Central Asia.\nA photo provided to Fox News Digital shows a chip from the Berlin Wall attached to an elaborate display.(Fox News Digital)\nCurrent Chairman Michael McCaul, R-Texas, is stepping aside in order to adhere to House Republicans' internal conference rules that mandate a lawmaker serve no more than three terms in the top spot on a committee.\nMIKE JOHNSON WINS REPUBLICAN SUPPORT TO BE HOUSE SPEAKER AGAIN AFTER TRUMP ENDORSEMENT\n\"It has been an honor to serve as your Chairman and leader for the last six years,\" McCaul wrote to colleagues in a message obtained by Fox News Digital. \"[O]ut of respect for the will of the Conference, I intend to abide by these rules and support new leadership.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"Serving as Chairman has truly been the most rewarding highlight of my career in Congress! I would like to thank all of you for your hard work and patriotism in confronting the major challenges we face across the Globe.\"\nFox News Digital reached out to Wilson's office for comment.\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com"}, {"source": "foxnews", "title": "General involved in Afghanistan withdrawal has promotion confirmed by Senate", "link": "https://www.foxnews.com/politics/general-involved-afghanistan-withdrawal-has-promotion-confirmed-senate", "content": "Former President Donald Trump blasts former chairman of the Joint Chiefs of Staff Mark Willey for how he handled the US military's withdrawal from Afghanistan.\nLt. Gen. Christopher Donahue – who was seen in the viral, night vision photo showing the final American soldier out ofKabul, Afghanistan– was quietly confirmed by the Senate on Monday to lead U.S. Army forces in Europe and Africa.\nDonahue, who headed the 82nd Airborne Division during the 2021 withdrawal from Afghanistan, was tapped by President Biden for the promotion to four-star general, but the confirmation was left out of a series of a hundred other military promotions green-lighted by the Senate before Thanksgiving recess. The delay was caused by one senator holding Donahue's confirmation, according to Politico.\nSeveral outlets reported that Sen. Markwayne Mullin, R-Okla., was responsible for the procedural hold.\nMAJ. GEN. CHRIS DONAHUE: WHO IS THE LAST AMERICAN SOLDIER TO HAVE LEFT AFGHANISTAN?\nMaj. Gen. Chris Donahue, commander of the 82nd Airborne Division, steps on board a C-17 transport plane as the last U.S. service member to leave Hamid Karzai International Airport in Kabul, Afghanistan, on Aug. 30, 2021.(XVIII Airborne Corps/Handout via Reuters)\nMullin has been a vocal critic of the Biden-Harris administration's handling of the botched withdrawal mired by the killing of13 U.S. service members and roughly 170 Afghan civilians during a suicide bombing at Hamid Karzai International Airport's Abbey Gate. Donahue was responsible for the 82nd Airborne as it was tasked with securing the airfield at the Kabul airport during evacuations before the country fell to the Taliban.\nThe senator called out Donahue, as well as other officials, in an Aug. 24, 2024, statement on the three-year anniversary of the suicide bombing attack.\n\"Three years later, not one person has been held accountable for the disaster–not Gen. Milley, Gen. McKenzie, Gen. Donahue, U.S. Ambassador to Tajikistan John Pommersheim, oranyone at the State Department,\" Mullin said at the time. \"To this day, no one has testified before Congress as to who gave this directive. No one has been held accountable for the 13 brave American heroes who died at Abbey Gate, or the countless Americans who lost their lives trying to escape Kabul.\"\nPresident-elect Trump's former defense secretary turned Trump critic,Mark Esper, had defended Donahue's nomination, and urged last month for the hold to be lifted.\nMaj. Gen. Christopher Donahue and Polish Gen. Wojciech Marchwica speak to journalists  at the Rzeszow-Jasionka airport in southeastern Poland, on Feb. 6, 2022.(Janek Skarzynski/AFP via Getty Images)\n\"Responsibility for the disastrous withdrawal from Afghanistan in 2021 rests with the White House, not the Defense Dept, and certainly not with the uniformed leaders who faithfully executed Pres Biden’s misbegotten decisions,\" Esper wrote on X.\nARMY UNIT POSTS PHOTO OF LAST US SOLDIER TO LEAVE AFGHANISTAN\nTrump had promised on the campaign trail to fire senior officers involved in the withdrawal, though not Donahue specifically.\nOne U.S. official told NBC News last month that the Trump transition team was compiling a list of senior current and former U.S. military officers to be potentially court-martialed over the pullout.\nA sign displaying photos and names of the 13 service members killed in a terrorist attack at Abbey Gate outside Kabul's Hamid Karzai International Airport is seen during a news conference at the U.S. Capitol on Sept. 9, 2024.(Kent Nishimura/Getty Images)\nThe Senate ultimately confirmed Donahue's promotion to be the commander of US Army Europe-Africa by unanimous consent on Monday, as the hold was dropped. Mullin had not publicly commented about the hold.\nDonahue has headed the 18th Airborne Corps at Fort Liberty, North Carolina, since 2022.\nCLICK HERE TO GET THE FOX NEWS APP\nHe has also been leader of the Special Operations Joint Task Force Afghanistan and served as the Joint Chiefs of Staff’s deputy director for special operations andcounterterrorism.\nDanielle Wallace is a breaking news and politics reporter at Fox News Digital. Story tips can be sent to danielle.wallace@fox.com and on X:@danimwallace."}, {"source": "foxnews", "title": "McConnell criticizes federal judges for reversing retirement decisions as 'open partisanship'", "link": "https://www.foxnews.com/politics/mcconnell-criticizes-federal-judges-reversing-retirement-decisions-open-partisanship", "content": "Senate Minority Leader Mitch McConnell, R-Ky., criticized two district court judges who reversed their announced retirements after former President Trump won re-election last month.\nTheSenate GOP leaderon Monday slammed decisions by two federal judges to reverse their announced retirements after Republican former President Trump won re-election in November.\nMinority Leader Mitch McConnell, R-Ky., criticized the pair of \"partisan Democrat district judges\" after they announced plans to \"unretire\" after \"the American people voted to fire Democrats last month.\"\n\"Looking to history, only two judges have ever unretired after a presidential election. One Democrat in 2004 and one Republican in 2009. But now, in just a matter of weeks, Democrats have already met that all-time record. It's hard to conclude that this is anything other than open partisanship,\" McConnell said in remarks delivered on the Senate floor.\nIn mid-November, U.S. District Judge Algenon Marbley of Ohio informed President Biden of his intention to stay on the bench after Biden had failed to nominate a replacement for him.\nDEMOCRATS ADVANCE 5 MORE BIDEN JUDICIAL NOMINEES\nSenate Minority Leader Mitch McConnell takes a question from a reporter following the weekly Senate Republican policy luncheon at the U.S. Capitol on Nov. 19, 2024.(Andrew Harnik/Getty Images)\nMarbley, who was appointed byPresident Clinton, said that because a successor had not been confirmed, \"I have therefore decided to remain on active status and carry out the full duties and obligations of the office.\"\nMeanwhile, U.S. District Judge Max Cogburn of North Carolina, who was appointed by President Obama, has also withdrawn plans to retire, Reuters reported.\nBoth Marbley and Cogburn had announced plans to take senior status before the election, which would have allowed them to take reduced caseloads until the president appoints a successor.\nMcConnell said their decisions to rescind their retirements after Trump won points to \"a political finger on the scale.\" He urged the incoming Trump administration to \"explore all available recusal options with these judges.\"\nFEDERAL JUDGE IN OHIO RESCINDS RETIREMENT AFTER TRUMP VICTORY, WITH BIDEN YET TO NOMINATE A SUCCESSOR\nU.S. District Judge Algenon L. Marbley, the first Black chief district judge in the Southern District of Ohio's history.(Courtney Hergesheimer/Columbus Dispatch/USA Today Network)\nHe also warned two sitting circuit court judges, who have announced retirements and have vacancies currently pending before the senate, against making similar decisions to \"unretire.\"\n\"Never before has a circuit judge unretired after a presidential election. It's literally unprecedented. And to create such a precedent would fly in the face of a rare bipartisan compromise on the disposition of these vacancies,\" McConnell said.\nHe was referring to a bipartisan agreement on judicial nominations last month that secured Trump's ability to appoint four crucial appellate court judges after he assumes office in January.\nJUSTICE SONIA SOTOMAYOR FACES PRESSURE TO RETIRE AHEAD OF TRUMP TAKING OFFICE: REPORT\nDemocratic Majority Leader Chuck Schumer struck a deal with McConnell to confirm several Biden judicial nominees, leaving four circuit court vacancies for Trump to fill next year.(AP/Getty)\nRepublicans agreed to halt procedural delay tactics and permit Senate Majority Leader Chuck Schumer, D-N.Y., to vote on cloture on nine of Biden's district court judges before Thanksgiving and vote to confirm them when they return after the holiday. In exchange, Democrats would pull four circuit court nominees who lack the votes to get confirmed, allowing Trump to fill those vacancies next year.\nHowever, a Democratic source familiar told Fox News Digital that only two of the circuit court vacancies are certain, and the other two may ultimately decide against taking senior judge status.\nCLICK HERE TO GET THE FOX NEWS APP\nMcConnell threatenedthat \"significant ethics complaints\" would follow swiftly if any retiring judge reversed their decision to take senior status because Trump won.\n\"As I repeatedly warned the judiciary in other matters, if you play political games, expect political prizes. So let's hope these judges do the right thing and enjoy their well-earned retirement and leave the politics to the political branches.\"\nFox News Digital's Julia Johnson and Kelly Phares contributed to this report.\nChris Pandolfo is a breaking news reporter for Fox News Digital. Send tips to chris.pandolfo@fox.com and follow him on Twitter @ChrisCPandolfo."}, {"source": "foxnews", "title": "Fox News Politics: Pardon us, Karine", "link": "https://www.foxnews.com/politics/fox-news-politics-pardon-us-karine", "content": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump transition, exclusive interviews and more Fox News politics content.\nHere's what's happening…\n-Five things to watch for onimmigration and border securityin 2025\n-Trump asks about 'J-6 Hostages' in response to Biden's pardon of Hunter:‘Such an abuse’\n-Republicans hammer Biden's'No one is above the law'claim following Hunter pardon: ‘Aged like fine milk’\nWhite House press secretary Karine Jean-Pierre faced the press for the first time Monday after President Bidenpardoned his son Hunter– an outcome that both Biden and Jean-Pierre previously insisted multiple times would not happen.\nOne reporterasked Jeane-Pierreif those previous statements denying a pardon \"could be seen as lies\" to the American people.\n\"One thing the president believes is to always be truthful with the American people,\" Jeane-Pierre said, repeatedly saying that Biden \"wrestled with [the decision].\"…Read more\nWhite House Press Secretary Karine Jean-Pierre speaks during a news conference in the Brady Press Briefing Room at the White House on April 9, 2024 in Washington, DC. Jean-Pierre and National Security Advisor Jake Sullivan discussed the Connecticut Huskies winning the NCAA Men's Basketball Tournament National Championship, Japan's Prime Minister Kishida's upcoming State visit to the White House, the ongoing hostage situation in Gaza and other topics. (Photo by Andrew Harnik/Getty Imag(Andrew Harnik/Getty Images)\n'OVER-PROMISED':Biden travels to Africa where policies were ‘over-promised and under-delivered,' amid massive China expansion…Read more\n'LIAR':Lawmakers harshly criticize Biden’s decision to pardon Hunter…Read more\n'THERE WAS NONE':Special counsel denies 'vindictive or selective' prosecution in Hunter Biden case…Read more\nBEG YOUR PARDON?:2 times Biden said he would not pardon son Hunter Biden…Read more\nPresident Joe Biden accompanied by his son Hunter Biden and his grandson Beau leave a book store as they walk in downtown Nantucket Mass., Friday, Nov. 29, 2024. (AP Photo/Jose Luis Magana)((AP Photo/Jose Luis Magana)\n'FAMILY AHEAD OF THE COUNTRY':Dem Colorado governor criticizes Biden for Hunter pardon…Read more\nEARLY CHRISTMAS GIFT:President Biden's pardon of son Hunter a political gift for Trump…Read more\n'I BET YOU...':Trump previously predicted Biden would pardon his son Hunter…Read more\n'A DISASTER':Biden blocks new mining in region that produces about 40% of nation's coal: 'It's a disaster'…Read more\nDEFENSE DOUBLE DOWN: Biden still believes 'no one is above the law,' White House says in wake of Hunter pardon…Read more\nJILL BIDEN SPEAKS:'Of course I support the pardon of my son,' Jill Biden tells reporter…Read more\nPresident Joe Biden and first lady Jill Biden arrive on the South Lawn of the White House in Washington, Monday, May 30, 2022, after returning from Wilmington, Del. (AP Photo/Andrew Harnik)\nPARTING GIFT:Biden administration to announce $725M weapons package to Ukraine months before Trump is sworn in…Read more\n'CONSEQUENCES':Trump victory boosts conservatives in Latin America, wake-up call to dictators: 'there will be consequences'…Read more\nCONSERVATIVE PUSHBACK:Thomas Massie, conservative commentators vocally oppose Trump's DEA nominee…Read more\n'HELP US IN THIS FIGHT':Harris campaign still asking for donations weeks after massive loss to Trump…Read more\n‘IRREPARABLY DAMAGED’: Mike Johnson unleashes on Biden's handling of justice after Hunter pardon…Read more\n'IT'S A SETBACK':Democrats criticize Biden over Hunter pardon…Read more\nHOUSE STAFFER ARRESTED:US Capitol Police arrest House Democrat staff member after finding ammunition in bag…Read more\nUnnamed U.S. senator contacted Capitol Police after allegedly receiving threatening voicemails. A U.S. Capitol Police badge is seen in Washington, D.C., on Jan. 5, 2022.(REUTERS/Elizabeth Frantz)\nDOWN TO THE WIRE:Single House race stands between Republicans and 1-seat majority…Read more\n'TRUMP-PROOFING' CALIFORNIA:Newsom proposes $25M from state legislature to take on Trump administration in courts…Read more\nREFUND THE POLICE:Experts see a tougher-on-crime shift in blue, purple states…Read more\nCRISIS:New York City is home to nearly 60k ‘criminal’ migrants: Report…Read more\nNEW YORK, NY - APRIL 11:  U.S. Immigration and Customs Enforcement (ICE), officers look to arrest an undocumented immigrant during an operation in the Bushwick neighborhood of Brooklyn on April 11, 2018 in New York City. New York is considered a \"sanctuary city\" for undocumented immigrants, and ICE receives little or no cooperation from local law enforcement.  ICE said that officers arrested 225 people for violation of immigration laws during the 6-day operation, the largest in New York City in recent years. (Photo by John Moore/Getty Images)((Photo by John Moore/Getty Images))\n'NOT BASED ON SCIENCE':COVID was 'most likely' leaked from Wuhan lab and social distancing had no basis in science: select committee…Read more\nGet the latest updates on the Trump presidential transition, incoming Congress, exclusive interviews and more onFoxNews.com.\nThis article was written by Fox News staff."}, {"source": "foxnews", "title": "Fox News Politics: Giving Thanks", "link": "https://www.foxnews.com/politics/fox-news-politics-giving-thanks", "content": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump transition, exclusive interviews and more Fox News politics content.\nHere's what's happening…\n-Top 5 biggestpolitical turkeysripped by conservatives in 2024\n-ConnecticutHouse Democrats report being targeted by bomb threats on Thanksgiving\n-Biden thankful for smooth transition of power, urges Trump to'rethink' tariffson Canada and Mexico\nSeveral liberal figures called on conservatives and President-elect Donald Trump supporters to give thanks to illegal immigrants on Thanksgiving, suggesting they acknowledge a large portion of migrants were the ones who harvested and packed their entrées enjoyed on Thursday.\n\"Everyone at the dinner table today, especially MAGA, please give thanks to the undocumented immigrants that picked and packed the food you’re enjoying,\" said former Obama Housing & Urban Development SecretaryJulian Castro.\n\"They deserve our grace. Happy Thanksgiving,\" the former San Antoniomayor added.\nCastro’s post was lambasted by respondents, who rhetorically asked which crops were being picked by the migrants flooding New York City and Chicago, while others suggested the characterizations were \"racist\" assumptions about farmworkers…Read more\n(iStock)\nTRANS IN MILITARY?:Trump team dismisses reports he will discharge trans in military: 'No decisions on this issue have been made'…Read more\nCOMMON UNDERSTANDING:Trump says Mexico will stop flow of migrants after speaking with Mexican president following tariff threats…Read more\nClaudia Sheinbaum Pardo, President of Mexico, speaks during  the National Agreement for the Human Right to Water and Sustainability, held at  the Ecological Park of Xochimilco. on November 25, 2024 in Mexico City, Mexico.(Carlos Santiago/ Pixelnews/Future Publishing via Getty Images)\n'RADICAL LEFT LUNATICS':Trump delivers Thanksgiving message to 'Radical Left Lunatics'…Read more\nMEDIA SHAKEUP:Inside how podcasters helped make Trump close the deal with young male voters…Read more\nSTILL HOT:Political betting markets still have plenty of action despite end of election season…Read more\nPresident-elect Donald Trump celebrating beating Vice President Kamala Harris in the 2024 presidential race early Wednesday morning.(Chip Somodevilla/Getty Images)\nIOWA RACE:Iowa Rep. Mariannette Miller-Meeks beats Dem challenger in state's 1st Congressional District…Read more\nGAME PLAN:New Republican Governors chair, pointing to campaign battles ahead, touts 'our policies are better'…Read more\nCALIFORNIA RACE:Democrat Derek Tran unseats Rep. Michelle Steel in California's 45th Congressional District…Read more\nGIANT CUTS:Top auto giants reporting job, factory cuts amid heightened push into EV market…Read more\nBUS RIDE BACK HOME:Texas could bus migrants to directly to ICE for deportation instead of sanctuary cities under proposed plan…Read more\n'HUGE WIN':Federal court of appeals just ruled that Texas has the right to build the razor wire border wall…Read more\nU.S. Border Patrol agents cut an opening through razor wire after immigrant families crossed the Rio Grande from Mexico on September 27, 2023 in Eagle Pass, Texas.(John Moore/Getty Images)\nEVACUATION DAY?:What is Evacuation Day? The forgotten holiday that predates Thanksgiving…Read more\nCANADIAN 'EMPIRE'?:New York lawmaker suggests NYS, New England secede to Canada over Trump…Read more\nGet the latest updates on the Trump presidential transition, incoming Congress, exclusive interviews and more onFoxNews.com.\nThis article was written by Fox News staff."}, {"source": "foxnews", "title": "Fox News Politics: First Order of Business", "link": "https://www.foxnews.com/politics/fox-news-politics-11-26-draft", "content": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump transition, exclusive interviews and more Fox News politics content.\nHere's what's happening…\n-Special Counsel Jack Smith's federal Trump cases cost taxpayers more than$50 million, financials show\n-3 House racesstill uncalled 3 weeks from Election Day\n-Federal judge blocks Bidenlabor protections for foreign farmworkers\nIncoming border czarTom Homanjoined Gov. Greg Abbott on Tuesday at a key border area in Texas, and will serve meals to troops stationed there over Thanksgiving – praising the governor's \"unprecedented success\" in securing the border, ahead of what is expected to be significant cooperation between the Trump administration and Abbott’s team next year.\nHoman and Abbott served meals to Texas National Guard soldiers and Texas Department of Public Safety troopers in Eagle Pass, Texas. Homan praised Abbott for his job.\n\"Governor Abbott has done an amazing job. Illegal immigration in Texas is down 86%, 86% think about that. This is a model we can take across the country. We're going to help Governor Abbott finish the job he started,\" he said.\nHoman was appointed \"border czar\" by President-elect Trump this month after Trump’s election win. A former acting Immigration and Customs Enforcement (ICE) director, Homan will be one of the most high-profile figures in terms of the mass deportation operation the incoming administration has planned….Read more\nThis split shows Thomas Homan and Texas troopers dealing with migrants at the southern border.(Photo by Christian Torres/Anadolu via Getty Images and Chip Somodevilla/Getty Images))\n'DEPORTER IN CHIEF':Deportations higher under Obama than Trump…Read more\n'SUIT'ING UP:Dem attorneys general prepare for legal battle with Trump, after filing hundreds of challenges last term: He 'threatens civil rights'…Read more\nRED WHITE & BLUE CARPET:Glenn Youngkin 'personally invites' new Trump admin to settle in Virginia over Maryland and DC…Read more\nFormer President Donald Trump and Virginia Gov. Glenn Youngkin meet for the first time in June 2024.(Trump Campaign)\n'USELESS':Tom Cotton slams ‘partisans and obstructionists’ in DOD reportedly plotting to block Trump plans…Read more\n'A LOT OF WASTE':'A lot of waste': Blackburn and Ramaswamy talk DOGE cuts…Read more\nHOWARD KURTZ: Why Trump dropped Matt Gaetz…Read more\n'BETRAYAL OF PARTY VALUES':DNC union launches GoFundMe to help former staffers hit by massive layoffs after election losses…Read more\nU.S. Vice President Kamala Harris greet U.S. President Joe Biden as First Lady Jill Biden and Second Gentleman Doug Emhoff look on at the end of the first day of the Democratic National Convention at the United Center on August 19, 2024 in Chicago, Illinois.  Delegates, politicians, and Democratic party supporters are in Chicago for the convention, concluding with current Vice President Kamala Harris accepting her party's presidential nomination. The DNC takes place from August 19-22.(Andrew Harnik/Getty Images)\nCHRISTMAS COUNTDOWN:Congress has just weeks to avoid a partial government shutdown after Thanksgiving…Read more\nFILIBUSTER: Kyrsten Sinema responds to Democrats admitting filibuster will help them stop Trump agenda: 'Schadenfreude'…Read more\nLAST MINUTE:Blinken set to testify on Afghanistan withdrawal in House amid looming contempt vote…Read more\n'GENDER COMMUNISM INDOCTRINATION':NYC elementary school blasted for teaching 'gender identity' course to kindergarteners…Read more\nREADY FOR LIFTOFF:Federal judge sides with SpaceX after environmental group tried to stop rocket launches…Read more\nA SpaceX Falcon 9 rocket carrying the Starlink 4-20 mission, launches from Space Launch Complex 40 at NASA's Kennedy Space Center in Cape Canaveral, Florida, on September 4, 2022. (Photo by CHANDAN KHANNA / AFP) (Photo by CHANDAN KHANNA/AFP via Getty Images)(Photo by CHANDAN KHANNA / AFP) (Photo by CHANDAN KHANNA/AFP via Getty Images))\nWHAT'S NEXT:What's next for this popular Republican governor after he leaves office?…Read more\nGet the latest updates on the Trump presidential transition, incoming Congress, exclusive interviews and more onFoxNews.com.\nThis article was written by Fox News staff."}, {"source": "foxnews", "title": "Biden, Trump both rip DOJ after president pardons Hunter", "link": "https://www.foxnews.com/politics/biden-trump-both-rip-doj-after-president-pardons-hunter", "content": "Political strategist Lucy Caldwell and senior editor for Reason Magazine Robby Soave react to President-elect Donald Trump’s selection for Attorney General, Pam Bondi.\nThere is no other way to put it:Joe Bidenlied. Over and over.\nAfter repeatedly promising, pledging, vowing not to pardon his son Hunter, the President of the United States did exactly that.\nThe move amounted to a devastating vote of no confidence in his own Justice Department, matchingDonald Trump’sown denunciations of that very department.\nPRESIDENT BIDEN PARDONS SON HUNTER, SPARING HIM POSSIBLE PRISON SENTENCE\nTrump, who also pardoned several political allies during his first term, was quick to react on Truth Social:\n\"Does the pardon given by Joe to Hunter include the J-6 hostages, who have now been imprisoned for years? Such an abuse and miscarriage of Justice!\"\nAnd prominent Republicans are calling Biden a liar, with ample justification.\nBoth President Biden and President-elect Trump railed against the Justice Department following the former's pardon of his son, Hunter – albeit for markedly different reasons.(Reuters/Getty/AP Images)\nI think most people assumed that a father wouldn’t let his son go to jail. And if the president had explained it in those terms, he might have garnered some public sympathy. But he did not.\nYou know how the president often talks about \"my word as a Biden\"? I mistakenly assumed that he wouldn’t promise again and again not to pardon his son or commute his sentence if he had thought there was any possibility he would get Hunter off the legal hook.\nBut what is anyone going to do? He leaves office next month, his political career is over and the story will quickly fade.\nMEDIA ADMITS THE DEMOCRATIC PARTY IS TOO 'WOKE' AFTER KAMALA HARRIS' 2024 LOSS\nBiden sounded very much like Trump as he accused the DOJ, which he had long defended, of treating his son unfairly – swinging the political door wide open for the president-elect to retaliate against Justice, in part by naming longtime confidant Kash Patel to runthe FBI.\nBiden said his son had been \"selectively, and unfairly, prosecuted,\" and he blamed  political pressure on the special counsel named in the case.\n\"No reasonable person who looks at the facts of Hunter’s cases can reach any other conclusion than Hunter was singled out only because he is my son — and that is wrong. There has been an effort to break Hunter — who has been 5-1/2 years sober, even in the face of unrelenting attacks and selective prosecution. In trying to break Hunter, they’ve tried to break me — and there’s no reason to believe it will stop here. Enough is enough.\"\nMany were mistaken in their assumption that the President wouldn't pardon his son – however, with just under two months left of his term, and, presumably, his political career, Biden really has nothing to lose in doing so.(BRENDAN SMIALOWSKI/AFP via Getty Images)\nBut that bolsters the Trump argument that he too was singled out for selective prosecution by the DOJ – and will be in a position to do something about it.\nHunter put out his own statement after the Sunday pardon: \"I have admitted and taken responsibility for my mistakes during the darkest days of my addiction — mistakes that have been exploited to publicly humiliate and shame me and my family for political sport.\"\nThe feeble attempts by some in the media and in Democratic politics to defend Biden are just sad, because they only tell half the story.\nLet’s say Hunter Biden was in fact singled out for prosecution, that the case would have been routinely disposed of if his last name was Jones. (Hunter had already been convicted in one case and pleaded guilty in another to tax and gun-related charges.)\nBut as Hunter admitted in one email, it was his last name, when his father was vice president, that enabled him to land all those buckraking contracts from around the world. It’s why the Ukrainian energy giant Burisma hired him, why he was able to get moneyfrom China.\nTRUMP HIT FOR HIRING LOYALISTS LIKE PAM BONDI: DOESN’T EVERY PRESIDENT DO THAT?\nHunter had no expertise in any of these areas. What he had was a connection to a powerful father.\nThe pardon is so sweeping that it covers everything Hunter may have done from Jan. 1, 2004 through Sunday – which could be a way of his father protecting himself as well.\nKarine Jean-Pierre also told reporters on several occasions that Biden would not pardon Hunter.\nWhite House Press Secretary Karine Jean-Pierre repeatedly assured reporters that President Biden wouldn't pardon Hunter.(AP Photo/Evan Vucci)\nHunter Bidenon Sunday night released a statement noting his recovery from addiction and his sobriety:\n\"I have admitted and taken responsibility for my mistakes during the darkest days of my addiction — mistakes that have been exploited to publicly humiliate and shame me and my family for political sport.\"\nMark Halperin argues that Biden put his son in jeopardy by running for president, knowing the full range of Hunter’s addiction problems – and lied about Hunter not getting money from China and not helping his business clients (even if he just made small talk at a couple of group meetings).\nTRUMP NOMINATES KASH PATEL TO SERVE AS FBI DIRECTOR: 'ADVOCATE FOR TRUTH'\nMeanwhile, Trump’s choice of Kash Patel for the FBI (who would replace his own appointee, Chris Wray, who replaced the fired Jim Comey) has sparked a media backlash.\nOne thing no one can argue is that Patel lacks experience. He has been chief of staff atthe Pentagonand a deputy assistant to the president. In fact, he was a national security prosecutor in the Obama Justice Department, before Trump got into politics.\nBut on Steve Bannon’s podcast last year, Patel said: \"Yes, we're going to come after the people in the media who lied about American citizens who helped Joe Biden rig presidential elections. We're going to come after you, whether it's criminally or civilly.\"\nThe president-elect is facing a media firestorm of his own after he named Kash Patel the new FBI director over the weekend.(Photo by Anna Moneymaker/Getty Images)\nPatel has also said that on day one he’d shut down the FBI headquarters in Washington – ironically named for J. Edgar Hoover – and turn it into a museum on the \"deep state.\" Its 7,000 employees would be dispersed around the country.\nOne thing Biden never did was put any family members on the government payroll, as Trump did in naming Ivanka and her husband, Jared Kushner, to top White House positions in the first term.\nNow Trump is continuing that tradition by naming Charles Kushner, Jared’s father, as ambassador to France.\nSUBSCRIBE TO HOWIE'S MEDIA BUZZMETER PODCAST, A RIFF ON THE DAY'S HOTTEST STORIES\nThe elder Kushner had already served a couple of years in prison for a scheme that involved hiring a prostitute and sending the tape to his sister. But at least he had paid his dues when Trump later pardoned him, sparking Jared’s interest in prison reform.\nTrump also picked Massad Boulos – the father of Tiffany Trump’s husband – as White House adviser on Arab andMiddle Eastaffairs. All in the family.\nOne thing the press does is refer to Trump nominees as \"loyalists,\" as if that’s a dirty word. Sunday’s Washington Post had a headline describing \"loyalist Kash Patel.\"\nCLICK HERE TO GET THE FOX NEWS APP\nBut while Biden named an inner circle of aides who had been with him as long as four decades, they were not dismissed as loyalists. That’s because the media agree that these were the good guys. And who can forget former AG Eric Holder describing himself asBarack Obama’s\"wingman.\"\nThe Hunter pardon has set in motion a potential cycle of both presidents using the DOJ and FBI for purely partisan ends, and Joe Biden bears full responsibility for that.\nHoward Kurtz is the host of FOX News Channel'sMediaBuzz(Sundays 11 a.m.-12 p.m. ET). Based in Washington, D.C., he joined the network in July 2013 and regularly appears onSpecial Report with Bret Baierand other programs."}, {"source": "foxnews", "title": "Trump hit for hiring loyalists like Pam Bondi: Doesn’t every president do that?", "link": "https://www.foxnews.com/politics/trump-hit-hiring-loyalists-pam-bondi-doesnt-every-president-do-that", "content": "FOX Business' Charlie Gasparino joined 'MediaBuzz' to discuss how digital media has overshadowed 'legacy media,' Elon Musk's possible conflicts of interest and Google possibly selling the Chrome browser.\nIt’s spat out like a dirty word.\nDonald Trump– take a deep breath – is hiring loyalists.\nThe president-elect – can you imagine?? – is nominating people he knows will support him. He’s used plenty of curse words, but nothing said by the media is more disdainful than loyalists.\nTRUMP DROPPED MATT GAETZ AFTER COMPLAINING ABOUT HIGH POLITICAL COST OF DEFENDING HIM\nNow stop and think: Doesn’t every president hire loyalists?\nDidn’t Joe Bidensurround himself with folks who had been with him for decades? Ron Klain, Steve Richetti and Tom Donilon created a protective bubble around the president. But few, if any, prognosticators dismissed them as loyalists.\nWhy? The press generally approved of Biden’s picks, including Tony Blinken; the non-communicative Lloyd Austin (who didn’t tell the boss about his cancer surgery), and the equally non-communicative Janet Yellen. The only person who stood out for great TV skills wasPete Buttigieg, the former presidential candidate and outgoing Transportation secretary.\nPresident-elect Trump has picked former Florida Attorney General Pam Bondi to lead the Department of Justice.(Getty Images)\nIt’s hardly a recent development. George Washington took a team-of-rivals approach, naming Thomas Jefferson secretary of state and Alexander Hamilton as treasury secretary. So did Abraham Lincoln, with Salmon Chase as treasury secretary and William Seward as secretary of war.\nBut if Trump picks people he expects to support him, the knee-jerk media reaction is that they’re dangerous to the country and will run roughshod over the rule of law.\nTrump didn’t make much use of his Cabinet in his first term and I doubt he will this time, except for a handful of top positions. Besides, he runs the show. Any Cabinet member who strays off the reservation can get fired, \"Apprentice\"-style. Serving at the pleasure of the president and all that.\nHACKER OBTAINS HOUSE ETHICS TESTIMONY ON MATT GAETZ AS TRUMP MAKES CALLS FOR AG NOMINEE\nFor what it’s worth, Trump wound up with an ideologically balanced Cabinet. The first wave – from Marco Rubio as secretary of state to a spate of current and formermembers of Congress– is generally impressive.\nBut then there was the fiasco over Matt Gaetz, now charging hundreds of dollars for Cameo videos, and such controversial nominees as Pete Hegseth, RFK Jr. and Tulsi Gabbard. And also Dr. Oz. Not to mention animosity toward pro-union Rep. Lori Chavez-DeRemer as labor secretary.\nIt’s quite obvious that the president-elect likes people he’s seen on TV, and he watches a lot of Fox News.\nJen Psaki speaks onstage during \"Jen Psaki in Conversation with Lawrence O’Donnell - Say More: Lessons from Work, the White House, and the World\" in New York City.(Dia Dipasupil/Getty Images)\nBut consider: Jen Psaki and Symone Sanders-Townsend were both CNN contributors when they joined the Biden campaign and then held top jobs in the White House. Now they’re hosting or co-hosting shows on MSNBC. Nobody bats an eye because they’re viewed as good guys joining the right team.\nFrom Fox, Trump has picked Army combat veteran Hegseth; ex-Congressman Sean Duffy, a FOX Business co-host, and two frequent medical commentators.\nWhat’s fascinating is the way many in the media have turned on Pam Bondi, a former Florida attorney general and career prosecutor who possesses the experience Gaetz lacked.\nTRUMP, DEFYING MEDIA PREDICTIONS, MAINLY PICKS SEASONED CAPITOL HILL VETERANS SUCH AS MARCO RUBIO\nSure, Bondi has said plenty of partisan things over the years, such as \"prosecuting the prosecutors,\" then quickly adding, \"the bad ones.\" She was part of Trump’s first impeachment legal team and then ran the legal arm of a pro-Trump PAC.\nBondi was passed over in the first Trump term because she accepted a $25,000 campaign donation from Trump’s foundation while her office was conducting a probe of Trump University (itself a mess).\n\"Fox & Friends Weekend\" host Pete Hegseth hosts the 2022 Patriot Awards from Hollywood, Fla.(Fox Nation/Bryan Many)\nIn 2013, Bondi accepted a $25,000 campaign donation from Trump’s foundation at the same time her office was conducting a fraud investigation into Trump University.\n\"Her acceptance of the donation coincided with her decision not to bring fraud charges against Trump University,\" says MSNBC legal analyst Barbara McQuade. No evidence of a quid pro quo emerged. And a Florida ethics panel cleared her of any wrongdoing. But that’s old news now.\n\"Bondi has shown a taste for vengeance herself — at the 2016 Republican National Convention, Bondi embraced chants of ‘lock her up,’\" McQuade says. \"Even joking about jailing a political opponent is an insult to the rule of law.\"\nBut wait – didn’tBarack Obama’sAG, Eric Holder, describe himself as the president’s \"wingman\"? There’s clearly a different standard for Democrats.\nRachel Maddow producer Steve Benen says Bondi \"falsely accused then-special counsel Robert Mueller of leading a ‘corrupt’ investigation that was \"worse than Watergate.’\"\nOn the other hand, Dave Aronberg, now state’s attorney for Palm Beach County, lost his race to challenge Bondi as AG, but she hired him anyway as drug czar. \"She’s someone who believes in the rule of law..I do not believe she will be Matt Gaetz 2.0. She is not going to burn it all down.\"\nCLICK HERE TO GET THE FOX NEWS APP\nI suppose it comes down to a question of trust. The pro-Kamala media refuse to give many Trump nominees the benefit of the doubt. Bondi has criticized the weaponization of the DOJ. You might even call her a loyalist.\nBut she will be the new attorney general, and that will be the ultimate test.\nHoward Kurtz is the host of FOX News Channel'sMediaBuzz(Sundays 11 a.m.-12 p.m. ET). Based in Washington, D.C., he joined the network in July 2013 and regularly appears onSpecial Report with Bret Baierand other programs."}]