[{"title": "Economic discontent, issue divisions add up to tight presidential contest: POLL", "link": "https://abcnews.go.com/Politics/economic-discontent-issue-divisions-add-tight-presidential-contest/story?id=114723390", "content": "Harris has 50% support to Trump’s 48% among likely voters, the poll finds.\nDreary economic attitudes and sharply divergent views on social policies mark the 2024 presidential election, contributing to a tighter contest between Vice President Kamala Harris and former President Donald Trump: Just 2 percentage points now divide them in a new ABC News/Ipsos poll.\nHarris has 50% support to Trump's 48% among likely voters in the national survey, with a similar 49-47% result among all registered voters. (Among all adults, regardless of registration status, it's a single-point race, 49-48%, excluding those who wouldn't vote.)\nThe results are slightly closer than Harris' +5 points among likely voters and the general public, and +4 among registered voters, in the last ABC/Ipsos poll in mid-September. A gain for Trump among men -- he's now +8 points among those registered to vote -- is a factor, as is a slip for Harris among independents, often swing voters.\nSee PDF for full results.\nBeneath the horse race, issues pull in opposite directions. The poll, produced for ABC News byLanger Research Associates, with fieldwork by Ipsos, finds that 56% of Americans now favor deporting all undocumented immigrants, up 20 points from eight years ago. That reinforces one of Trump's strongest issues, with a 10-point Trump lead in trust to handle immigration at the southern border.\nYet the same share, 56%, side with Harris on abortion, saying the federal government should restore access to what it was before the Supreme Court eliminated the constitutional right to abortion in 2022. Many fewer, 41%, favor Trump's view that each state should decide. It follows that abortion is Harris' best issue in this poll, with a 15-point lead over Trump in trust on it.\nThen there's the economy, and related to it, a sharp division on the nation's future. As reportedFriday, 44% of Americans say they're not as well off now as they were when Biden took office, tying the most negative number on this question in data since 1986.\nFurther, while inflation has eased and employment is strong, those gains haven't hit home for most people: 59% say the economy is getting worse, more than twice as many as say it's getting better, 23%. And among registered voters who say the economy's worsening, Trump leads Harris by a sweeping 53 points, 74-21%.\nLargely informed by economic attitudes, registered voters divide, 51-47%, on whether America's best days are still ahead, or behind it. This in turn relates to candidate choice: Trump, with his message of national decay, leads Harris by 27 points, 61-34%, among those who say the country's best days are behind it. Harris, with her more optimistic messaging, leads Trump by 28 points, 63-35%, among those who think America's best days are ahead.\nTaken another way, 59% of Trump's supporters say the country's best days are behind it. Among Harris supporters, 67% say the country's best days are still to come.\nTrump leads Harris by 8 points overall in trust to handle the economy and 7 points on inflation, consistent results since August that are central to his competitiveness and reflect Harris' challenges breaking free from dissatisfaction with Biden's economic stewardship. (See more on this inFriday's reporton Harris' headwinds as an agent of change.)\nThat said, Harris pushes back on another economic benchmark, \"looking out for the middle class.\" A new item in this poll, she leads Trump on it by 5 points, 42-37%. (The rest don't trust either of them to handle it.)\nA test of three economic proposals from each candidate fills out the story: Trump has both the most popular and the least popular proposals, with Harris winning the second, third and fourth slots of the six.\nSpecifically, Trump's suggestion to end income taxes on Social Security benefits leads in popularity, followed by three from Harris -- a tax credit for middle- and lower-income families with newborns, a limit on the profits food companies can make on groceries and grants to first-time home buyers. Two more Trump proposals come next -- raising tariffs on foreign imports, and the one that is unpopular among most people, cutting corporate income taxes.\nOne of these -- the idea to end taxes on Social Security benefits -- rises to the level of majority \"strong\" support, 55%. Harris' three proposals also get more strong support than strong opposition, by 10 to 23 points. Trump's remaining items, by contrast, get much less strong support -- and cutting corporate income taxes is more apt to be strongly opposed.\nIn trust on other issues, Trump holds single-digit leads on handling crime and safety, national security and the conflict in the Middle East; Harris has a single-digit lead on \"protecting American democracy.\" Results for items repeated from past polls are virtually unchanged.\nWhile potential voters are closely divided on many points, enthusiasm and personal favorability are two areas in which Harris has clear advantages. Among registered voters who support her, 84% say they're enthusiastic about it; among Trump supporters, enthusiasm drops by 6 points, to 78%. That's markedly lower than enthusiasm for Trump -- 93% -- at this point in 2020.\nEnthusiasm is related to personal favorability, and 44% of Americans see Harris favorably, vs. 35% for Trump. Harris' favorability rating lost 3 points in this poll, and 47% now see her unfavorably. That said, many more, 58%, have an unfavorable opinion of Trump.\nFavorability isn't determinative. Trump has been underwater in favorability consistently since 2015 -- but won the Electoral College eight years ago regardless.\nOne important boost to Trump is that, among the 15% of registered voters who see both candidates unfavorably, he leads by a wide margin, 62-24%. Looking at it another way, 21% of Trump's supporters see him unfavorably, but support him anyway. The corresponding figure for Harris is just 7%.\nTrump also continues to score a few points by portraying Harris as too liberal. Forty-eight percent of Americans see her this way, vs. 43% who call Trump too conservative. That said, 7% call Harris too conservative and 9% call Trump too liberal; at the end of the day, very similar numbers call them \"about right\" ideologically, 43% for Trump, 41% for Harris.\nHowever much they're liked or disliked, another result shows that most people are ready to hear more from the candidates: 57% say Harris and Trump should agree to an additional televised debate, while 41% say not.\nTrump reiterated last week that another debate is not in the cards. And there's a difference on the question between their supporters. Among registered voters who prefer Harris, 71% are looking for another debate, while among those who prefer Trump, this drops sharply, to 45%. (After their sole debate last month, 58% overall thought Harris had won it.)\nWith the election close to three weeks away, partisanship infuses survey results. Eighty-five percent of Republicans and Republican-leaning independents say the economy is getting worse, for instance, while just 32% of Democrats and Democratic leaners agree. In another example, Republicans and GOP leaners are far more apt than their Democratic counterparts to say the country's best days have passed, 60% vs. 36%.\nPolicy preferences show similar patterns. Eighty-eight percent of Republicans support mass deportation, as do 58% of independents, compared with 26% of Democrats. (That said, support for deportations has increased broadly compared with a 2016 survey, with the exception of views among Democrats and liberals.)\nOn abortion, partisan divisions results are reversed: Eighty-seven percent of Democrats say the federal government should restore abortion access, as do 57% of independents, dropping to 27% of Republicans.\nPolls are best used not to recite who's ahead, but to assess how and why the country is coming to its decision. It's also important to keep in mind that the ultimate winner of the popular vote may differ from the winner of the presidency, as demonstrated in 2016 and 2000 (and likewise, for history buffs, in 1888, 1876 and 1824).\nWith Election Day drawing close and early voting underway, this poll includes slight departures from previous ABC/Ipsos polls this cycle in measuring vote preferences. Survey respondents are offered up to five candidates -- Harris, Trump, Jill Stein, Chase Oliver and Cornel West, and their running mates -- based on which of those candidates are on the ballot in the state where the respondent lives. (Robert F. Kennedy Jr., while on the ballot in 30 states and the District of Columbia, is not listed, since he's not actively running. Respondents can volunteer their support for Kennedy or anyone else.)\nIn addition to being asked whom they'd support, respondents are given the option of saying they already voted. In this survey 1% had done so, a number likely to ramp up quickly.\nAs mentioned, one shift in this poll is the result among men who are registered to vote -- 52-44% in Trump's favor, compared with a dead heat, 48-48%, in mid-September. That includes a 19-point Trump lead among white men and a close contest among Hispanic men and younger men (age 18-39) alike.\nA slight change is among independents, who, per exit polls, have voted for the winner in nine out of the last 12 presidential elections. Harris led among independents by 10 points, 51-41%, in mid-September, compared with a non-significant 5 points now, 49-44%.\nHarris, for her part, continues to lead among women by 9 points, 53-44%, aided by her showing among under-40, Black and Hispanic women. And she leads by 14 points among college graduates, 56-42%, among the more reliable groups for turnout.\nThe 17-point gender gap between the candidates (Trump +8 among men, Harris +9 among women) is back to its typical level; it has averaged 19 points in exit polls since 1996. This reflects the fact that women are 8 points more apt than men to identify as Democrats.\nThe contest stands at 82-13%, Harris-Trump, among Black people who are registered to vote; that compares with 87-12% in the 2020 exit poll (a slight 5 points lower for Harris; no better for Trump). Black women are at 87-10% now (compared with 90-9% in 2020); Black men are at 76-18% (compared with 79-19% four years ago). These differences from 2020 aren't statistically significant.\nThen there's the division of votes by state groupings. In what are thought to be safely and likely red states, Trump is comfortably ahead, 55-42%. In expected blue states, Harris is well ahead, 56-39%. And in the seven battleground states where the contest is expected to be close -- Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin -- it couldn't be closer: 49% for Harris, 49% for Trump.\nMETHODOLOGY – This ABC News/Ipsos poll was conducted online via the probability-based Ipsos KnowledgePanel® Oct. 4-8, 2024, in English and Spanish, among a random national sample of 2,631 adults. Partisan divisions are 29-29-30%, Democrats-Republicans-independents. Results have a margin ofsampling errorof plus or minus 2 percentage points, including the design effect, for the full sample. Error margins are larger for subgroups. For registered voters, the sample size is 2,226 and the error margin is 2 points. For likely voters, the sample size is 1,714 and the error margin is 2.5 points. Sampling error is not the only cause of differences in polls.\nThe survey was produced for ABC News byLanger Research Associates, with sampling and data collection by Ipsos. See details on ABC News survey methodologyhere.\n24/7 coverage of breaking news and live events"}, {"title": "Vance stands by Trump's false claims Venezuelan gangs have invaded Aurora, Colorado", "link": "https://abcnews.go.com/Politics/vance-stands-trumps-false-claims-venezuelan-gangs-aurora/story?id=114751512", "content": "The Republican mayor of the city has said the claims are grossly exaggerated.\nGOP vice presidential nominee Sen. JD Vance is standing by former PresidentDonald Trump'sfalse claims that Venezuelan gangs have invaded and conquered Aurora, Colorado.\nTrump has repeatedly claimed that members of the Venezuelan Tren de Aragua gang have \"taken over\" apartment complexes and \"overrun\" the city, as he did in arally in the cityon Friday.\nMike Coffman, the Republican mayor of Aurora, said Trump's claims are \"grossly exaggerated\" and \"have unfairly hurt the city's identity and sense of safety.\"\nAsked by \"This Week\" co-anchor Martha Raddatz on Sunday if he supports Trump making those claims, Vance did not back down.\n\"Well, Martha, you just said the mayor said they were exaggerated. That means there's got to be some element of truth here,\" Vance said.\"\nRaddatz followed up with Vance, saying the issues in Aurora were limited to a handful of apartment complexes and that the mayor released a statement saying the city's \"dedicated police officers have acted on those concerns and will continue to do so.\"\nVance responded, saying Democratic nominee Vice President Kamala Harris caused the issues in Aurora.\n\"Unfortunately, when you let people in by the millions, most of whom are unvetted, most of whom you don't know who they really are, you're going to have problems like this.\"\n\"Kamala Harris, 94 executive orders that undid Donald Trump's successful border policies. We knew this stuff would happen. Bragged about opening the border, and now we have the consequences, and we're living with it. We can do so much better, but frankly, we're not going to do better, Martha, unless Donald Trump calls this stuff out. I'm glad that he did.\"\nIn the aftermath of Hurricane Helene, which devastated parts of states in the southeastern U.S., including Florida, North Carolina, and Georgia,Trump has falsely suggestedthat aid from FEMA meant for the hurricane was going to migrants and that the federal government is going out of their way to not help people in Republican areas.\nAsked if he believed that true, Vance defended the president.\n\"What the President said is that fundamentally, FEMA aid is distracted by going to illegal migrants,\" Vance responded. \"We've got Republican congressmen who are on the ground who represent that area saying that they have to call the White House to get food and water to FEMA? I don't, frankly, think there's anything malicious going on here, Martha, but I do think that we've had an incompetent response to this particular crisis, particularly in Western North Carolina, which, to be fair, was hit harder than a lot of us expected it.\"\nVance called the federal government's response to the crisis incompetent, saying members of the military are still \"trickling\" into western North Carolina.\nRaddatz pushed back against the false claims that the government is not assisting people in Republican areas and citing Pentagon officials who said that active duty troops were staged and ready to go before being called upon and were instantly out the door.\nOn Friday in Georgia, Vance said that the attorney general is the second-most important government role after the president.\nRaddatz pressed Vance if Trump would go after his political opponents if he won another term.\n\"No, he was president for four years, and he didn't go after his political opponents. You know, who did go after her political opponents? Kamala Harris, who has tried to arrest everything from pro-life activists to her political opponents,\" Vance said.\nTo follow up, Raddatz told Vance that Trump has said in the past that those who have cheated will be prosecuted.\n\"Well, he said that people who violated our election laws will be prosecuted. I think that's the administration of law,\" Vance said. \"He didn't say people are going to go to jail because they disagree with me.\"\nVance continues to refuse to acknowledge that Trump lost the 2020 election. In an interview with \"This Week\" earlier this year, Vance said he wouldn't have certified the results of the 2020 race until states submitted pro-Trump electors.\nRaddatz pressed Vance again on the 2020 election.\n\"In interview after interview, question after question, and in the debate, you refuse to say that Donald Trump lost the 2020 election,\" Raddatz said. \"So I'm just going to assume that if I ask you 50 times whether he lost the election, you would not acknowledge that he did. Is that correct?\"\n\"Martha, you've you asked this question. I've been asked this question 10 times in the past couple of weeks. Of course, Donald Trump and I believe there were problems in 2020,\" Vance said.\nPressed again by Raddatz, Vance replied, \"I've said repeatedly I think the 2020 election had problems. You want to say rigged? You want to say he won? Use whatever vocabulary term you want.\"\n24/7 coverage of breaking news and live events"}, {"title": "Harris medical report released amid new Trump health scrutiny", "link": "https://abcnews.go.com/Politics/harris-release-medical-report-give-trumps-health-advanced/story?id=114739386", "content": "Despite promising to release his medical records, Trump hasn't yet.\nVice President Kamala Harris released a report with details about her health and medical history on Saturday, as the Harris team tries to place former PresidentDonald Trump's health and advanced age under new scrutiny.\nHarris \"remains in excellent health,\" her physician, Dr. Joshua Simmons, said in a letter on Saturday. \"She possesses the physical and mental resilience required to successfully execute the duties of the presidency, to include those as Chief Executive, Head of State and Commander in Chief.\"\nThe doctor pointed to seasonal allergies and hives (urticaria) as a \"notable\" part of her health history. He also listed a number of over-the-counter medications used to improve her symptoms, which he said have never been \"severe.\"\nSimmons details Harris' most recent physical exam, which was in April 2024. He said the results were \"unremarkable.\" The doctor also said he found her routine bloodwork was \"unremarkable,\" though he noted that her Vitamin D levels were \"in the insufficient range.\"\nSimmons also noted that the vice president has a family history of colon cancer. He detailed no other personal history of a number of conditions.\nHarris slammed Trump, who has yet to release his own medical records, during an interview with reporters on the tarmac in North Carolina.\n\"So, today I release my medical records as has, I believe every candidate for president of the United States, except Donald Trump in this election cycle. And it's just a further example of his lack of transparency that on top of his unwillingness to debate again, his unwillingness to do an interview with '60 Minutes,' which again, is part of the norm of what anyone running for president of the United States does,\" she said.\nWhen asked if, despite never seeing his medical records, Trump seems unfit to be president, Harris resonded that she would not give \"a medical analysis of his fitness,\" but added the former president \"does not have the ability to do the job.\"\nThe mostcomprehensive details that are knownof Trump's health care are from a nearly 7-year-old report from his physician at the time following a physical exam. In that report, it was learned Trump had high cholesterol, was overweight and had rosacea, a benign skin disease.\nTrump refused to release his medical records during his first campaign in 2016, and despite promising multiple times to release his medical records in this race, he's not done so yet.\nIn response to ABC News' requests concerning Trump's medical records, his campaign is pointing to previous letters released by former White House physician Rep. Ronny Jackson, R-Texas, and Trump's personal physician, Dr. Bruce Aronwald.\nJackson's letters, released in July after the assassination attempt in Butler, Pennsylvania, describe in detail the former president's ear injury but doesn't detail Trump's health conditions. In one of the two letters, Jackson wrote that he reviewed Trump's medical records from Butler Memorial Hospital and said he was rapidly recovering from the injury.\nAronwald's letter, released in November last year, said he conducted \"several comprehensive examinations\" and reported that his \"overall health is excellent,\" without providing any details.\n\"President Trump has voluntarily released updates from his personal physician, as well as detailed reports from Dr. Ronny Jackson who treated him after the first assassination attempt,\" Trump campaign Communications Director Steven Cheung said. \"All have concluded he is in perfect and excellent health to be Commander in Chief.\"\nCheung added that Trump \"has maintained an extremely busy and active campaign schedule unlike any other in political history, whereas Kamala Harris has been unable to keep up with the demands of campaigning and reveals on a daily basis she is wholly unqualified to be President of the United States.\"\nNot much was known about Harris' health prior to this new report, either.\nFor example, in contrast to PresidentJoe Biden, whose physician has issued memos following his routine physicals, no such reports have been made available for the vice president. Only her annual check-up in 2021 was announced by the White House, but results from that visit were not released.\nThe White House had also previously announced that Harristested positivefor COVID-19 in April 2022, for which she was treated with the drug Paxlovid.\nAhead of the release of Harris' medical report, ABC News had also inquired about the records for Minnesota Gov. Tim Walz and Ohio Sen. JD Vance, Harris and Trump's running mates, respectively.\nThis new move by Harris is a stark illustration of how the political baggage of advanced age has flipped.\nBefore he dropped out of the race for a second term, Biden's age was an effortless battering ram for Trump and Republicans. The former president would attack his successor, America's oldest president, as \"sleepy Joe\" \"sick\" and \"weak.\" But now it's Harris, who is approximately two decades Trump's junior, and her allies taking advantage of their opponent's age.\nWalz described Trump's debate performance as \"a nearly 80-year-old man shaking his fist at clouds;\" former President Bill Clinton joked during his Democratic National Convention speech, \"Two days ago I turned 78… and the only personal vanity I want to assert is I'm still younger than Donald Trump.\"\nHours before the vice-presidential debate earlier this month, the Harris campaign rolled out a new ad taking aim at Trump, who, if he wins, would be the oldest person elected president, through Vance.\n\"He's not just weird or dangerous,\" a narrator says of Vance, \"he could be a heartbeat away from the Oval Office.\" The ad ends with clips of the former president appearing to slur his words.\nABC News' Katherine Faulders, Soorin Kim, Isabella Murray, Hannah Demissie, Lalee Ibssa and Kelsey Walsh contributed to this report.\n24/7 coverage of breaking news and live events"}, {"title": "Trump's Pennsylvania town hall turns into impromptu concert after medical incidents", "link": "https://abcnews.go.com/Politics/wireStory/trumps-pennsylvania-town-hall-turns-impromptu-concert-after-114800081", "content": "Donald Trump’s town hall in the Philadelphia suburbs turned into an impromptu concert after the former president was twice interrupted by medical emergencies in the room\nOAKS, Pa. --OAKS, Pa. (AP) —Donald Trump's town hall in thePhiladelphia suburbsturned into an impromptu concert Monday after the former president was twice interrupted by medical emergencies in the room.\nThe Republican presidential nominee paused during a question-and-answer session as a doctor in the room attended to the first person to have a medical issue. After a second emergency halted the discusion moderated by South Dakota Gov. Kristi Noem, Trump stopped taking questions. He and Noem mentioned it was hot in the venue, and Trump asked about air conditioning.\n“They probably can't afford it, sir, in this economy,” Noem quipped.\nDuring the first interruption, Trump requested “Ave Maria” be played and was answered with an instrumental version of the song. During the second incident, he said he meant Italian opera singer Luciano Pavarotti’s version of the song. It was promptly tuned up.\nOnce Noem announced the second person was up and moving, Trump spoke for a few more minutes before calling for music to be played, as many in the crowd lingered, unsure whether he was done speaking.\n“Those two people who went down are patriots,” Trump said after the music. “We love them. And because of them, we ended up with some great music, right?”\nTrump suggested they could wrap up the evening with the audience in their seats, enjoying some musical selections rather than hearing him answer more questions.\nHe called for the Village People’s “YMCA\" and it blasted through the loudspeakers, the usual signal that Trump is done speaking and is ready to leave. But he remained onstage.\nMore music, more dancing.\n“Nobody’s leaving,” Trump said. “What’s going on?”\nMore music played — and for roughly 40 minutes, it didn't stop.\nTrump bopped and shimmied onstage to an eclectic playlist of songs that included Sinead O’Connor’s “Nothing Compares 2 U,\" Rufus Wainwright’s cover of “Hallelujah\" and Guns N’ Roses’ “November Rain.”\nMany of his supporters made their way to the exits, but some stayed through the end. The scene was reminiscent of Trump’s winters at Mar-a-Lago, his South Florida estate, where he likes to play DJ and hold court with the wealthy members of his private club.\nFinally, Trump left the stage as “Memory” from the musical “Cats” played.\nKaroline Leavitt, Trump's national press secretary, published on the social media site X a photo of Trump from the side of the stage. “DJ TRUMP!” she wrote.\nTrump spokesperson Steven Cheung wrote on X that “something very special is happening in Pennsylvania” as the scene unfolded, adding Trump “is unlike any politician in history, and it's great.”\n___\nCooper reported from Phoenix.\n24/7 coverage of breaking news and live events"}, {"title": "Harris was asked to name a few of Trump's virtues. Here's her response", "link": "https://abcnews.go.com/Politics/wireStory/harris-asked-3-virtues-trump-114704743", "content": "Vice President Kamala Harris was asked to name three virtues that her opponent in next month's election, Donald Trump, possesses — but was unable to come up with even one\nLAS VEGAS --Vice PresidentKamala Harriswas asked to name three virtues that her opponent in next month's election,Donald Trump, possesses — but was unable to come up with even one.\nAt the end of hertown hall for Spanish-language network Univisionin Las Vegas on Thursday, audience member Teresa Djedjro, 48 and originally born in Mexico, asked Harris to, \"Please give me three virtues that Trump has.”\nHarris laughed and thanked her for the question before saying, “I know that the vast majority of us has so much more in common than what separates us.” Then she made clear that is not the case for herself and the former president, saying Trump's approach to politics, “pains me” while singling out his ”us versus them” approach.\n“I don’t think that's healthy for our nation, and I don’t admire that,\" Harris said. \"And I’m quite critical of it, coming from someone who wants to be president of the United States.”\nTaking another stab at a compliment, she offered, “I think Donald Trump loves his family and I think that’s very important,\" only to continue, \"But I don’t really know him. I only met him one time ... so I don’t really have much more to offer you.”\nTrump is holding his own Univision town hall next week, after the original gathering in Miami was postponed due to Hurricane Milton. Still, he too has had little nice to say about Harris during the campaign, calling her “mentally impaired.”\n24/7 coverage of breaking news and live events"}, {"title": "Trump's protests aside, his agenda has plenty of overlap with Project 2025", "link": "https://abcnews.go.com/Politics/wireStory/trumps-protests-aside-agenda-plenty-overlap-project-2025-114770305", "content": "Donald Trump insists that Project 2025, a nearly 1,000-page blueprint for a hard-right turn in American government and society, does not reflect his priorities for a White House encore\nATLANTA --ATLANTA (AP) —Donald Trumpinsists that Project 2025, a nearly 1,000-page blueprint for a hard-right turn in American government and society, does not reflect his priorities for a White House encore.\n“I haven’t read it. I don’t want to read it — purposefully,” the Republican presidential nominee said Sept. 10 on thedebate stage.\nYet from economics, immigration and education policy to civil rights and foreign affairs, there are common ideas and shared ideology betweenProject 2025and Trump's outline for another term — from his official“Agenda 47”slate, the Republican platform he personally approved and his other statements.\nThere are also differences: Project 2025, led by the Heritage Foundation and written by many conservatives who worked in or with Trump's administration, offers more particulars on some issues than the former president.\nHere's a look at how Trump's 2024 campaign and Project 2025 align and deviate:\nTRUMP: His tax policies lean broadly toward corporations and wealthier Americans. That’s mostly due to his promise to extend his 2017 overhaul while lowering the corporate rate to 15% from the current 21%. He also would end Inflation Reduction Act levies that are financing energy measures intended to combat climate change. Those ideas aside, Trump has put more emphasis on his plans aimed at working- and middle-class Americans: exempting earned tips, Social Security payments and overtime wages from income taxes. His proposal on tips, however, could give a back-door tax break to top wage earners by allowing them to reclassify some pay as tip income — a prospect that, at its most extreme, could see hedge-fund managers or top attorneys taking advantage of a provision Trump frames as an aid to restaurant servers, bartenders and other service workers.\nPROJECT 2025: The document goes further than Trump, calling for two federal income tax rates — 15% and 30% — while eliminating most deductions and credits. It envisions a “nearly flat tax on wage income beyond the standard deduction” by adjusting what income is subjected to the payroll taxes that pay for Social Security and Medicare. An effectively flat tax federally would increase the overall share of taxes paid by poorer and middle-class Americans. That’s because many state and local tax codes, anchored by transactional taxes and flatter income taxes, are more regressive than current federal income tax brackets. Project 2025 also calls for requiring a two-thirds vote in Congress to raise corporate or individual income taxes in the future.\nTRUMP: “Build the wall!” from 2016 has become creating “the largest mass deportation program in history.” Trump calls for enlisting National Guard and police, though he's not said how he'd ensure they target only people in the U.S. illegally. He has pitched “ideological screening” for would-be entrants and ending birthright citizenship (which likely would require a constitutional change). He has also said he’d reinstitute first-term policies such as “Remain in Mexico,” limiting migrants on public health grounds and severely limiting or banning entrants from certain majority-Muslim nations. In full, his approach would not just crack down on illegal migration but also limit immigration altogether.\nPROJECT 2025: There is a litany of detailed proposals for various U.S. immigration statutes, executive branch rules and agreements with other countries — reducing the number of refugees, work visa recipients and asylum seekers, for example. Perhaps the most instructive statement from Project 2025 is its call to reinstate “every rule related to immigration that was issued” during Trump’s 2017-2021 term.\nTRUMP: He frames regulatory cuts as an economic cure-all. He pledges precipitous drops in U.S. households’ utility bills by removing speed bumps for fossil fuel production, including opening all federal lands for exploration. (U.S. energy production and exports are at record highs under President Joe Biden.) Trump promises to boost housing stock by cutting regulations, though most construction rules come from state and local governments.\nTwo broad proposals and ideas stand out: The first would make it easier to fire federal workers by classifying thousands more of them as being outside civil service protections. That almost certainly would weaken the government’s power to enforce statutes and rules by reducing the number of employees engaging in the work. The second is Trump’s assertion that the president has exclusive power to control federal spending despite Congress' appropriations power. Trump argues that lawmakers “set a ceiling” on spending but not a floor — meaning the president’s constitutional duty to “faithfully execute the laws” grants him discretion on whether to spend the money.\nPROJECT 2025: The authors make scores of calls for the president, Cabinet and other political appointees to slash regulations, reclassify federal employees to make them easier to fire, reduce “unaccountable federal spending” and set a course from the West Wing. “The Administrative State is not going anywhere until Congress acts to retrieve its own power from bureaucrats and the White House,” they write. “In the meantime, there are many executive tools a courageous conservative president can use to handcuff the bureaucracy (and) bring the Administrative State to heel.”\nTRUMP: The former president wants to end government diversity programs, using federal funding as leverage, and he would target existing protections for LGBTQ individuals. On transgender rights, he promises to end “boys in girls’ sports,” a practice he insists, without evidence, is rampant. Trump would reverse Biden’s extension of Title IX civil rights protections to transgender students and ask Congress to allow only two gender choices at birth.\nPROJECT 2025: Government should “affirm that children require and deserve both the love and nurturing of a mother and the play and protection of a father.” That philosophy permeates Project 2025, which defines the ideal family — and individual — in narrow, traditionalist terms. Authors envision consolidating federal civil rights efforts within the Justice Department’s civil rights division, with enforcement coming only through litigation. That effectively would concentrate the choice of how and when to enforce civil rights law with the attorney general — and, by extension, the White House.\nTRUMP: The Department of Education would be targeted for elimination. That does not mean Trump wants Washington out of classrooms.Among other maneuvers,he would use federal appropriations as leverage to scrap diversity programs at all levels of education and compel K-12 schools to abolish tenure and adopt merit pay for teachers. He calls for pulling money from “any school or program pushing Critical Race Theory, gender ideology, or other inappropriate racial, sexual, or political content on our children.”\nTrump calls for redirecting universities' endowment money into an online “American Academy”offering college credentials to all Americans without charging tuition. “It will be strictly non-political, and there will be no wokeness or jihadism allowed,” Trump said on Nov. 1, 2023.\nPROJECT 2025: Congress should “shutter” the Department of Education and “return control of education to the states,” Project 2025 argues, echoing Trump’s argument that U.S. educational infrastructure imposes progressive indoctrination. The authors propose, among other things, eliminating the Head Start program, turning the Title I program into block grants and eventually phasing out that federal financing, and using the tax code to incentivize at-home child care, something GOP vice presidential nominee JD Vance advocates.\nTRUMP: Trump claims falsely that climate change is a “hoax” as he disparages Biden spending on cleaner energy designed to reduce U.S. reliance on fossil fuels. Trump would anchor energy and transportation policy to fossil fuels: roads, bridges and combustion-engine vehicles. Trump says he does not oppose electric vehicles but promises to end incentives that encourage EV-market development. And he would lower fuel efficiency standards.\nPROJECT 2025: The document criticizes the Biden administration’s \"climate fanaticism.” It proposes closing or limiting many programs for environmental protection and regulation, including those many Americans take for granted. Among them: the National Oceanic and Atmospheric Administration, which Project 2025 would eliminate, and the National Weather Service, which the document would steer toward exclusively selling weather data to private forecasters. It would leave the National Hurricane Center in place — though NHC depends on the National Weather Service to make forecasts. The plan would not repeal laws like the Clean Air Act and Clean Water Act, but its regulatory and bureaucracy cuts would reduce their reach.\nTRUMP: His strategy is more isolationist diplomatically, noninterventionist militarily and protectionist economically than the U.S. has been since World War II. But the details are more complicated. Trump pledgesmilitary expansion, promises robust Pentagon spending and proposes a missile defense shield — an idea from the Reagan era. He insists he can end Russia’s war in Ukraine and Israel-Hamas fighting, though he has not explained how. He remains openly critical of NATO and top U.S. military brass. “I don’t consider them leaders,” he says. And he repeatedly praises authoritarians like Hungary’s Viktor Orban and Russia’s Vladimir Putin.\nPROJECT 2025: Echoing Trump’s vibe, the document calls for “tough love” in international relations — but with distinctions from Trump. On military preparedness, Project 2025 would curtail the number of generals but expand the number of enlisted personnel, though the authors do not call for reinstituting a draft, as critics have alleged. Project 2025 is perhaps even more aggressive than Trump in its China rhetoric: “Economic engagement with China should be ended, not rethought,” the foreword states.\nOn NATO, the blueprint echoes Trump’s emphasis on other member nations paying more for their own defense, but it does not carry the inherent skepticism of NATO alliances that Trump has projected for years. And while Trump steadfastly refuses to criticize Putin for invading Ukraine, Project 2025 states: “Regardless of viewpoints, all sides agree that Putin’s invasion of Ukraine is unjust and that the Ukrainian people have a right to defend their homeland.”\n24/7 coverage of breaking news and live events"}, {"title": "As Harris, Trump reach out to male voters, here's what polls show about 'gender gaps'", "link": "https://abcnews.go.com/Politics/kamala-harris-donald-trump-reach-male-voters-polls/story?id=114723789", "content": "Harris running mate Tim Walz has been deployed to recruit male voters.\nWith just about three weeks until Election Day, the two major party candidates are working hard to reach voters around the country -- with a key focus on male voters.\nVice President Kamala Harris' running mate, Minnesota Gov. Tim Walz, waskicking off a new push to reach male votersin swing states, the Harris campaign confirmed to ABC News.\nThis included \"Good Morning America\" co-anchor Michael Strahan'sone-on-one interviewthat aired on Friday morning, as well as Walz's Friday travel to Michigan where he met with Black male voters and did local TV interviews focused on hunting and high school football.\nHe was also attending the Mankato West Scarlets football game on Friday -- and giving a pep talk to the team at the Minnesota high school where he taught and also coached football.\nSeparately, former President Barack Obama on Thursday -- as a campaign surrogate for Harris -- sternly criticized Black men over what he called \"excuses\" to not vote for Harris, making comments during a stop at a campaign field office in Pittsburgh's East Liberty neighborhood ahead of his rally, saying he finds sitting out or voting for former President Donald Trump \"not acceptable.\"\nFormer President Donald Trump has also been working to reach male voters -- particularly younger men. That includes joining podcasts such as \"Flagrant\" with Andrew Schulz and Akaash Singh, as well as other recent long interviews with podcast hosts popular among male listeners.\nThe latest polling still shows a \"gender gap\" among Harris' and Trump's support among men and women, with more men supporting Trump and more women supporting Harris.\nAPew Research Center poll of registered voterspublished on Thursday found Harris and Trump in a close race nationally among registered voters nationwide -- but there's a larger gap between them among male and female voters.\nThepoll found51% of male registered voters supporting Trump, and 43% supporting Harris. Among female registered voters, that is effectively reversed: 52% of female registered voters support Harris, while 43% support Trump.\nThis is a dynamic political strategists and analysts have noticed. \"The way that Donald Trump is trying to run up the numbers with men, [Harris has] got to do the same thing with women,\" Sarah Longwell, publisher of the Bulwark and a longtime political strategist, told ABC News contributing correspondent and POLITICO Playbook author Rachael Badein a recent POLITICO Playbook Deep Dive podcast interview.\nHowever, the gender gap is not unprecedented: it has averaged 19 points in presidential exit polls since 1996 (which is because women are 8 to 10 percentage points more likely than men to identify as Democrats). Additionally, Pew's findings are similar to the gender gap seen in the past two presidential elections, according to exit polls.\nIn 2020, 53% of men supported Trump while 45% supported then-Vice President Joe Biden; while 57% of women supported Biden and 42% supported Trump. In 2016, 52% of men supported Trump while 41% supported Democratic nominee Hillary Clinton; but 54% of women supported Clinton while 41% supported Trump.\nAccording toa recent analysis by 538, the gender gap between Harris and Trump has actually narrowed slightly from where it was in August, although the Harvard Youth Poll published in Septemberfound a large gapamong younger voters of either gender – with Harris up 17 points among young men and up 47 points among young women.\nA separaterecent analysis from Gallupfound that young women have increasingly identified as politically liberal; according to Gallup, that trend is not driven by race or education.\nSome recent polls have also delved into Black male support for Harris and Trump, amid uncertainty over whether either candidate is doing enough to reach them. Polling shows that Black men overwhelmingly support Harris, but that Trump has more support from Black men than from Black women.\nThe Pew Research Center's poll found that among Black men who are registered voters, 72% support Harris while 20% support Donald Trump. Among Black women who are registered voters, according to Pew, Kamala Harris has 85% support while Donald Trump has only 8%. (As with any poll, there is a higher margin of sampling error for smaller groups within the poll, so these results may be less precise than the poll's broader findings.)\nOther polls indicate somewhat less of a gender gap among Black voters, however. AnAssociated Press-NORC polltaken in mid-September separately found that 66% of Black male voters say Kamala Harris would make a good president -- similar to 64% of Black female voters and 65% of Black voters overall. 21% of Black male voters think Trump would make a good president, as opposed to 11% of Black female voters and 15% of Black voters overall. (The poll did not ask about who respondents would vote for.)\nABC News' Fritz Farrow, Gabriella Abdul-Hakim, Hannah Demissie, Isabella Murray, Jeff Ballou, Kelsey Walsh, Lalee Ibssa, Mary Bruce, Rachael Bade, Soorin Kim, and Will McDuffie, and 538's Mary Radcliffe, contributed to this report.\n24/7 coverage of breaking news and live events"}, {"title": "Kamala Harris will sit down with Bret Baier for her first Fox News interview", "link": "https://abcnews.go.com/Politics/wireStory/kamala-harris-sit-bret-baier-fox-news-interview-114785770", "content": "Vice President Kamala Harris has agreed to an interview with Fox News anchor Bret Baier\nWASHINGTON --Vice PresidentKamala Harriswill be interviewed by Fox News anchor Bret Baier on Wednesday in Pennsylvania as she steps up her travel and conversations with media outlets in the closing stretch of the presidential campaign.\nIt will be her first sit down with the network, and her first interview with a news outlet outside of her ideological comfort zone since becoming the Democratic nominee.\nHarris has previously granted interviews to CNN and CBS' “60 Minutes,” as well as friendly venues including ABC's “The View” and Howard Stern's radio show.\nMost of the interviews came within the past two weeks,representing a shiftfrom her decision not to talk more with the media earlier in her campaign.\nThe Fox News interview is slated to air at 6 p.m. ET on Wednesday. Baier is Fox News' chief political anchor and one of the few prominent people on the network whose identity isn't associated with conservative commentary.\nAfter facing criticism earlier in her candidacy about avoiding interviews, Harris has tried to turn the tables on Republican nominee Donald Trump. On Sunday in Greenville, N.C., Harris criticized him for not releasinghis medical recordsand for refusing a “60 Minutes” interview.\n“It makes you wonder: Why does his staff want him to hide away?\" she said. \"One must question: Are they afraid that people will see that he is too weak and unstable to lead America? Is that what’s going on?”\nTrump attacked Harris and Fox News on social media Monday, saying the network “has grown so weak and soft on the Democrats.\"\n24/7 coverage of breaking news and live events"}, {"title": "'This Week' Transcript 10-13-24: Republican VP Nominee JD Vance & Gov. Andy Beshear", "link": "https://abcnews.go.com/Politics/week-transcript-10-13-24-republican-vp-nominee/story?id=114757177", "content": "This is a rush transcript of \"This Week\" airing Sunday, October 13.\nA rush transcript of \"This Week with George Stephanopoulos\" airing on Sunday, October 13, 2024 on ABC News is below. This copy may not be in its final form, may be updated and may contain minor transcription errors. For previous show transcripts, visit the \"This Week\"transcript archive.\nMARTHA RADDATZ, ABC NEWS CHIEF GLOBAL AFFAIRS CORRESPONDENT (voice-over): Final sprint, just 22 days to the election. Our brand new poll shows the race tighter than ever, as Kamala Harris goes on a media blitz.\nKAMALA HARRIS, (D) VICE PRESIDENT OF THE UNITED STATES AND PRESIDENTIAL NOMINEE: Let's push toward the future of our country. Let's not go backwards.\nRADDATZ (voice-over): Donald Trump turns to darker campaign rhetoric.\nDONALD TRUMP, (R) FORMER PRESIDENT OF THE UNITED STATES AND PRESIDENTIAL NOMINEE: I will rescue Aurora and every town that has been invaded and conquered.\nRADDATZ (voice-over): And former President Obama blasts black men hesitating on Harris.\nBARACK OBAMA, (D) FORMER PRESIDENT OF THE UNITED STATES: You're coming up with all kinds of reasons and excuses, I've got a problem with that.\nRADDATZ (voice-over): This morning, all the latest from a busy week on the campaign trail, Republican Vice Presidential Candidate, J.D. Vance and Democratic Governor Andy Beshear join us, plus analysis from our Powerhouse Roundtable. Painstaking recovery, after Hurricane Milton slams Florida, the Southeast reels from a second disaster in two weeks.\nJOE BIDEN, (D) PRESIDENT OF THE UNITED STATES: We're fighting now to make sure people have the emergency relief they need.\nRADDATZ (voice-over): Sarasota, Florida Mayor Liz Alpert joins us. And --\nUNIDENTIFIED FEMALE: We're going to continue the fight, continue to make sure that us minorities are not going to be suppressed.\nRADDATZ (voice-over): (Inaudible) reports on unfounded claims of non-citizens voting, the latest in our series, \"Protecting Your Vote.\"\n(END VIDEOTAPE)\nANNOUNCER: From ABC News, it's \"This Week.\" Here now, Martha Raddatz.\nRADDATZ: Good morning and welcome to \"This Week.\" We are now just over three weeks to Election Day and the race for the White House is a dead heat. Our brand new ABC News-Ipsos poll shows Kamala Harris with a narrow two-point lead over Donald Trump nationally among likely voters. That's within the margin of error and a closer gap than the five-point lead she held just a few weeks ago.\nOne likely drag on the Harris-Waltz ticket, despite many positive economic signs, some 59 percent of Americans say they believe the economy is getting worse compared to just 23 percent who say it's getting better, with more Americans trusting Trump to handle the economy if he wins a second term. And while there remain deep divides on issues like immigration and abortion, our poll finds that 56 percent of Americans now favor deporting all undocumented immigrants as Trump has proposed, while 56 percent also support restoring abortion access to what it was before Roe v. Wade was overturned as Harris has advocated.\nAnd in the battleground states that we'll decide it all, our FiveThirtyEight polling average shows a virtual tossup. With the race this close, we saw both campaigns with an all out blitz of events and interviews this week, to try to reach the voters who could decide the election. And this morning, we wanted you to hear directly from the candidates in their own voice as they make their pitch to voters.\nI'll speak with Republican Vice Presidential Nominee J.D. Vance in a moment. But first, here's a look at some of what his running mate said this week on the campaign trail.\n(BEGIN VIDEO CLIP)\nRADDATZ (voice-over): This week, former President Donald Trump hitting the campaign trail hard, holding five rallies across the country.\nTRUMP: California's, really it's a paradise lost, but we're going to bring it back.\nRADDATZ (voice-over): In Coachella, California last night --\nTRUMP: If Kamala gets four more years, the entire country will become like the migrant camp of LA and San Francisco. What the hell is happening to our cities?\nRADDATZ (voice-over): In battleground, Nevada, where Trump once again falsely referred to Democrats rigging the 2020 election.\nTRUMP: We must defeat Kamala Harris and stop her radical left agenda once and for all. We want a landslide that is too big to rig, too big to rig.\nRADDATZ (voice-over): And Colorado --\nTRUMP: This state has to flip Republican. It has to.\nRADDATZ (voice-over): Trump campaigning in Aurora, a city he's called a war zone overrun by a Venezuelan gang.\nTRUMP: Members of the gang now beat down doors with hammers and engage in open gun battles with rival groups in this once peaceful, beautiful, pretty crime-free community.\nRADDATZ (voice-over): A claim strongly disputed by local officials including the city's Republican mayor, but Trump continued regardless of the facts.\nTRUMP: We will put these vicious and bloodthirsty criminals in jail or kick them out of our country.\nRADDATZ: All part of Trump's focus on migrants and the border, an issue where he is leading in the polls, although facts often not mattering.\nTRUMP: They come from the dungeons, think of that. The dungeons of the third world. From prisons and jails, insane asylums and mental institutions, and she has had them resettled beautifully into your community.\nShe lost 325,000 migrant children. Their parents are looking for them. Those children are now dead, in slavery, or just plain missing. Probably most of them will never be found again.\nRADDATZ: Trump focused on women this week as well, where he is lagging in the polls in part because of his positions on abortion.\nTRUMP: I think we're doing very well with women, but somebody said, women love my policy, but they don't like me. I think they do like me. I'll tell you what. I think women like me because I will be your protector, and I protected you for four years.\nRADDATZ: Another favorite topic, transgender children, where Trump made this claim without any evidence this has ever happened.\nTRUMP: Your child goes to school, and they take your child. It was a he and comes back a she.\nRADDATZ: And on Wednesday in Pennsylvania, it was back to immigration. As Hurricane Milton approached Florida Trump accused FEMA of diverting funds to migrant care instead of Americans impacted by the Hurricane Helene despite FEMA's strong denial.\nTRUMP: You know where they gave the money? To illegal immigrants coming in, many of whom are killers, many of whom are drug dealers, many of whom are gang members, and many of whom came out of prisons from all over the world.\n(END VIDEOTAPE)\nRADDATZ: And I'm joined now by Republican vice presidential nominee, Senator J.D. Vance.\nSo happy to have you here this morning, Senator Vance. I know you've been going hard on the campaign trail, but I want to start with the hurricane.\nDuring Hurricane Helene, as we heard, former president Trump suggested the federal government was not only sending FEMA aid meant for the hurricane to migrants, but going out of their way to not help people in Republican areas. Do you think that is true?\nSEN. J.D. VANCE (R), VICE PRESIDENTIAL NOMINEE: Well, Martha, what the president said is that fundamentally FEMA aid is distracted by going to illegal migrants, and by the way, good morning, and thanks for having me.\nWe've got Republican congressmen who are on the ground who represented that area saying that they have to call the White House to get food and water to FEMA. I don't frankly think there's anything malicious going on here, Martha, but I do think that we've had an incompetent response to this particular crisis, particularly in northwestern North Carolina, which, to be fair, was hit harder than a lot of us expected it.\nBut fundamentally if you've got six days after the hurricane, the 82nd Airborne is still trickling in, I do think that we had a fundamentally incompetent, overly bureaucratic response to the hurricane. So what you hear from folks on the ground is they feel left behind.\nAnd Martha, we have to remember, of course, I know this area well. This is the Appalachian region of our country where people have felt ignored by their government for 30 years, and it doesn't help when you have a response to the hurricane, that's slow, that's halting, and then you layer on top of it of course --\nRADDATZ: Senator Vance --\nVANCE: -- that FEMA has done a lot of illegal immigration resettlement work.\nRADDATZ: Senator Vance, I want to go back to --\nVANCE: Go on.\nRADDATZ: I want to go back to what former president Trump said. He said, they're going out of their way to not help people in Republican areas. There is no truth to that, and on staging, Pentagon officials say that active duty troops were staged and ready to go before being called upon and were instantly out the door.\nSo President Trump -- former president Trump is saying things that aren't true about that money being withheld from Republican areas.\nVANCE: Well, Martha, I think you're actually confusing staging of resources from the rapid response of the U.S. Military. I mean, look, in FEMA's defense, there are things after this hurricane that FEMA simply could not do. You actually need military command and control. You need military resources deployed to the area, and I think all the president has said is frankly, what some of Kamala Harris' surrogates have said, which is that if these areas were a little more Democratic, maybe Kamala Harris would have focused on them more.\nThat acknowledgment is not to attack frankly the good folks of FEMA. It's to suggest that Americans are feeling left behind by their government, which they are, Martha.\nRADDATZ: OK. Let's --\nVANCE: If you talk to folks on the ground, we've had -- I have had friends who have been in Boone, North Carolina, helping with the cleanup.\nIt is an extraordinary sense of betrayal and being left behind. People are worried that their government doesn't care about them. I’m much more worried about the incompetence of Kamala Harris's administration that led to that, more than I am --\nRADDATZ: Senator Vance --\nVANCE: -- the fact that Donald Trump --\n(CROSSTALK)\nRADDATZ: -- Senator Vance, I’m just going to say that local officials -- local officials and FEMA officials say that is just flat wrong.\nBut I want to -- we played some other comments about migrants and migrants including in Aurora, in Colorado, where Trump said the city had been invaded and conquered by Venezuelan gangs. The Republican mayor of the city said flatly, the city and state have not been taken over or invaded or occupied by migrant gangs.\nSo, do you support Donald Trump making those claims that the Republican mayor says were grossly exaggerated and have hurt the city's identity and sense of safety?\nI understand what you're saying that some people left behind. But he's making these statements that the mayor is flat out disputing.\nVANCE: Well, Martha, you just said the mayor said they were exaggerated.\nRADDATZ: Grossly exaggerated.\nVANCE: That means there's got to be some -- that means there's got to be some element of truth here.\nAnd, of course, President Trump was actually in Aurora, Colorado, talking to people on the ground and what we're hearing, of course, Martha, is that people are terrified by what has happened with some of these Venezuelan gangs.\n(CROSSTALK)\nRADDATZ: Senator Vance, I’m going to stop you because I know exactly what happened. I’m going to stop you. The incidents were limited to a handful of apartment complex -- apartment complexes and the mayor said our dedicated police officers have acted on those concerns. A handful of problems.\nVANCE: Only -- Martha, do you hear yourself? Only a handful of apartment complexes in America were taken over by Venezuelan gangs, and Donald Trump is the problem, and not Kamala Harris's open border?\nAmericans are so fed up with what's going on and they have every right to be and I really find this exchange, Martha, sort of interesting because you seem to be more focused with nitpicking everything that Donald Trump has said rather than acknowledging that apartment complexes in the United States of America are being taken over by violent gangs.\nI worry so much more about that problem than anything else here. We've got to get American communities in a safe space again.\nAnd unfortunately, when you let people in by the millions, most of whom are unvetted, most of whom you don't know who they really are, you're going to have problems like this. Kamala Harris’ 94 executive orders that undid Donald Trump's successful border policies, we knew this stuff would happen.\nRADDATZ: That’s --\nVANCE: They bragged about opening the border and now we have the consequences and we're living with it.\nWe can do so much better, but frankly, we're not going to do better, Martha, unless Donald Trump calls this stuff out. I’m glad that he did.\nRADDATZ: Okay. Let's -- let's just -- let's just end that with they did not invade or take over the city as Donald Trump said.\nI want to move on to just --\nVANCE: A few apartment complexes, no big deal.\nRADDATZ: A few apartment complexes that the mayor did not see (ph) was invading the entire city.\nLet's move on to women and abortion. Donald Trump is leading Kamala Harris in our poll among males by eight points, but lagging behind Harris by seven points -- nine points among females.\nYou said during the debate that you and Trump have more to do to earn back people's trust specifically as it relates to women and reproductive rights. Fifty-six percent of those polled support restoring abortion access to what it was under Roe v. Way -- Roe v. Wade.\nSo what would you say specifically to the women watching this morning who believe they should have their own say over their bodies and not the government, either state or federal?\nVANCE: Well, Martha, first of all, what I'd say is that I think re-nationalizing this entire debate is a big mistake. And I understand that a lot of Americans according to that poll apparently disagree with me and President Trump here, but we want to respect Californians. We want to respect Alabamans. We want to respect Pennsylvanians.\nThese folks are going to have different approaches to this particular topic, and I think that what we had in this country for 50 years was a culture war over this particular issue because we had nationalized it. And it's also important, Martha, that while Kamala Harris uses the slogan of returning to Roe versus Wade, she has endorsed policies that go way beyond anything that Roe versus Wade ever meant in this country.\nTaxpayer-funded abortions for late term abortions. She's explicitly refused to endorse things like the Born Alive Act which would protect babies who survive botched abortion. So while she hides behind the popular slogan of Roe versus Wade, Kamala Harris's actual abortion views I think are much more radical than even a lot -- I think frankly most of our pro-choice citizens.\nRADDATZ: Well, let me go back again. What would you say to those women who don't want people involved in their individual rights? Kamala Harris is on that side of that, not you.\nVANCE: Well, I think, Martha. That's -- that's not right actually. I think Kamala Harris has taken this so far that a lot of women if they knew Kamala Harris's actual view and not the slogan, they would recognize that it's far more radical. They can believe in individual autonomy but also recognize there are of course limits here.\nWe don't want to abort nine-month-old babies here, and we don't want to have taxpayers funding it. So I think everybody recognizes there's a right balance to strike.\nBut to answer your question, Martha --\nRADDATZ: I --\nVANCE: -- what I would say to women is that Donald Trump and I want to make it easier to make the choice of life in the first place. And I know a lot of young women, especially when I was younger, who chose abortion because they feel like they didn't have any options. And what I want to do as a person who admittedly, Martha, wants to protect the most vulnerable members of our society, I'd like to make it easier for women to choose life to begin with.\nRADDATZ: OK.\nVANCE: I think that goes to lowering the cost of housing, which, of course, has skyrocketed under Kamala Harris' administration. I think it's making it easier for working moms to balance work and life and family. There's a lot that we can do to become more pro-family.\nThat's how I think we can best earn back trust and --\nRADDATZ: Senator --\nVANCE: Yes?\nRADDATZ: Senator, I want to get to some other topics here.\nVANCE: Sure.\nRADDATZ: On the attorney general, you said on Friday that the most important person in government in a Trump-Vance Administration, other than the president, is not you. It would be the attorney general. Why do you consider that the most important spot, the second most important spot?\nVANCE: Well, one reason, Martha, is just public opinion, and what I mean here is that we really want the American people to believe that we have a fair and equitable administration of justice. If not, the entire sort of system falls apart. You need people to believe that if the attorney general prosecutes somebody, it's motivated by justice and law, and not by politics.\nAnd unfortunately --\n(CROSSTALK)\nRADDATZ: Would Donald Trump go after his political opponents?\nVANCE: -- is the --\nRADDATZ: Would Donald Trump go after his political opponents?\nVANCE: No --\nRADDATZ: He suggested that in the past.\nVANCE: Martha, he was president for four years and he didn't go after his political opponents.\nYou know who did go after her political opponents? Kamala Harris, who has tried to arrest everything from pro-life activists to her political opponents --\n(CROSSTALK)\nRADDATZ: He said those people who cheated would be prosecuted.\nVANCE: -- and used the Department of Justice as a weapon against people -- well, he said that people who violated our election laws will be prosecuted. I think that's the administration of law. He didn't say people are going to go to jail because they disagree with me. That is, in fact, been the administration and the policy of Kamala Harris, Martha.\nLook, under the last three-and-a-half years, we have seen politically-motivated after politically-motivated prosecution. I'd like us to just get back to a system of law and order where we try to arrest people when they break the law, not because they disagree with the prevailing opinion of the day, and there's a fundamental difference here between Donald Trump and Kamala Harris. Donald Trump may agree -- agree or disagree on a particular issue, but he will fight for your right to speak your mind without the government trying to silence you.\nKamala Harris is explicitly --\nRADDATZ: Senator Vance, I --\n(CROSSTALK)\nVANCE: -- censorship of folks who disagree with her.\nRADDATZ: I want to go back to Donald Trump.\n(CROSSTALK)\nVANCE: We’ve got to get a Department of Justice that believes in the First Amendment, Martha. The First Amendment is the bedrock of our Constitution.\nRADDATZ: Senator --\nVANCE: We have Kamala Harris who doesn't even believe in it.\nRADDATZ: Senator, we're just about out of time here. We're just about out of time here. And I want to end with this -- in interview after interview, question after question, and in the debate, you refused to say that Donald Trump lost the 2020 election.\nSo I’m just going to assume that if I ask you 50 times whether he lost the election, you would not acknowledge that he did. Is that correct?\nVANCE: Martha, you've -- you asked this question, I’ve been asked this question 10 times in the past couple of weeks. Of course, Donald Trump and I believe there were problems in 2020. You haven't asked about inflation, the --\n(CROSSTALK)\nRADDATZ: No, I’m sorry, let's stick to this. I know -- I know --\nVANCE: The American people want us to talk about how to make their lives better. They don’t want us to --\nRADDATZ: Why won’t you say that? Why won’t you say that?\nVANCE: Because -- because, Martha, I believe that in 2020, when big tech firms were censoring American citizens, that created very serious problems. And by the way, Martha, you're -- you're a journalist. You represent the American media.\nLook at the polling on this. A lot of Americans feel like they were silenced in the run-up to the 2020 election. That is such a bigger issue. That fundamental problem --\n(CROSSTALK)\nRADDATZ: If you -- I just want to --\nVANCE: -- that me and Donald Trump talking about it, and unfortunately, Martha --\nRADDATZ: But I don't understand why you want to say that you believe it?\n(CROSSTALK)\nVANCE: She's -- well, won't just say what, that I think the 2020 election had some problems? I’ve said that repeatedly.\nRADDATZ: Did Donald Trump lose? That's the question, and you know that's the question.\nVANCE: Martha, I’ve said repeatedly I think the election had problems. You want to say rigged. You want to say he won. Use whatever vocabulary term you want -- I want to focus on the fact that we had big technology firms censoring our fellow citizens in a way that violated our fundamental rights.\nThe fact that you're so obsessed with what word I use to describe this phenomenon rather than the phenomenon itself suggests something very broken in the American media.\nIf we want to restore trust in American elections and democracy, which I want to do, Martha, we have to talk openly about what happened in 2020 and most importantly we've got to talk about what happened afterwards.\nRADDATZ: OK.\nVANCE: Americans being unable to afford the basic necessities of middle class life.\nRADDATZ: Thank you, Senator Vance.\nVANCE: Because Kamala Harris is in the White House. Thanks, Martha.\nRADDATZ: We're going to leave it right there. Appreciate your time this morning.\nUp next, Democratic Governor Andy Beshear on the state of the Harris campaign. We're back in two minutes.\n(COMMERCIAL BREAK)\nRADDATZ: While Donald Trump was rallying crowds across the country, Vice President Kamala Harris was on a media blitz. A string of interviews from late-night to radio and podcasts to right here on ABC's \"THE VIEW\" with a town hall wedged in between it all.\n(BEGIN VIDEOTAPE)\nKAMALA HARRIS (D), VICE PRESIDENT OF THE UNITED STATES AND PRESIDENTIAL CANDIDATE: I'll try not to fall asleep during this interview.\nRADDATZ (voice-over): Who says Kamala Harris is avoiding interviews? Certainly not this week. From a sobering \"60 Minutes.\"\nHARRIS: I have a Glock.\nRADDATZ: To late-night laughs with Stephen Colbert. Topped off by a popular podcast.\nALEX COOPER, HOST, \"CALL HER DADDY\" PODCAST: Madam Vice President.\nHARRIS: Alex.\nCOOPER: Welcome to \"Call Her Daddy.\"\nHARRIS: It is good to be with you.\nRADDATZ: Kamala Harris trying to invigorate her campaign and paint a sharp difference with former president Trump, talking aimed at his comments about the administration's response to Hurricane Helene on \"The Late Show with Stephen Colbert.\"\nHARRIS: What just upsets me so is the idea that any politician would play political games with these folks, and then for the sake of political gain tell these lies in a way that is meant to make people distrust the help that is there for them to receive.\nRADDATZ: But when it came to differentiating herself from Joe Biden, when speaking to the ladies of ABC's \"THE VIEW,\" Harris struggled.\nSUNNY HOSTIN, CO-HOST, ABC'S THE VIEW: Would you have done something differently than President Biden during the past four years?\nHARRIS: There is not a thing that comes to mind in terms of -- and I have been a part of most of the decisions that have had impact.\nRADDATZ: But 25 minutes and two commercial breaks later, Harris came back to the question.\nHARRIS: Listen, I plan on having a Republican in my cabinet. I got a list. You asked me what's the difference between Joe Biden and me, well, that will be one of the differences.\nRADDATZ: Having a Republican in her cabinet is not exactly on top of voters' minds. It is the economy, and Harris took that on with Latino voters in a Noticias Univision town hall.\nHARRIS: The macroeconomic numbers are looking good, but it still doesn't change the experience you're having at the grocery store, and we still need to deal with that.\nRADDATZ: And reiterated her plan to lower costs for Americans.\nHARRIS: Part of my plan is to expand the child tax credit, to give first-time homebuyers a $25,000 down payment assistance. For startup small businesses, the tax deduction right now is $5,000, to extend it to $50,000.\nRADDATZ: While Harris focused on Latino voters, she did have some heavy hitter help this week. Former president Barack Obama encouraging black men to get out and vote for Harris.\nBARACK OBAMA, FORMER U.S. PRESIDENT: On the other side, you have someone who has consistently shown disregard not just for the communities but for you as a person. And you're thinking about sitting out? Part of it makes me think that -- well, you just aren't feeling the idea of having a woman as president.\nRADDATZ: For Harris, a strong voice in a race she acknowledged this week --\nHARRIS: Good evening, Arizona!\nRADDATZ: -- could not be closer.\nHARRIS: This will be a very tight race until the very end and we are the underdog. So we have some hard work ahead of us but we like hard work.\n(END VIDEOTAPE)\nRADDATZ (on camera): And Democratic Governor Andy Beshear of Kentucky joins me now.\nA lot of hard work ahead. I'd like to hear a quick reaction to what you heard J.D. Vance talk about.\nGOV. ANDY BESHEAR (D), KENTUCKY: It's just amazing. Apparently, there is no lie too big for Donald Trump and J.D. Vance.\nI mean, when you ask him about the last election, all you're asking him to do is admit reality, and we deserve to have a vice president who believes in democracy and can say, yes, Donald Trump lost the last election, and now, we're running in this election.\nAnd then the lies on -- on FEMA and disaster response -- listen, in Kentucky, we went through our worst tornado disaster and our worst flood disaster in our history, and I didn't have to deal with any of the shenanigans that Donald Trump has putting out right now.\nAnd his lies can hurt people. I mean, lying that $750 is all that's available, that -- that means that individual might not apply for the $40,000 plus in individual assistance.\nLike if you truly care about the people that are harmed more than yourself, you wouldn't politicize this. You wouldn't be putting out all this misinformation and that’s somebody --\nRADDATZ: Governor --\nBESHEAR: -- who has led through natural disasters. It -- it hurts.\nRADDATZ: Governor, Governor, to your point though, you talk about Donald Trump lying. The Harris campaign has consistently said that Donald Trump is a liar, a threat to democracy, a convicted felon, and yet, the race appears tighter than ever, even with record-breaking dollars for Kamala Harris.\nWhat is happening? What is not happening?\nBESHEAR: Well, we've got a lot of partisanship in America right now, and it's something that I hope after this election that the vice president can move us beyond, that she can remind us that this isn't supposed to be an us versus a them, that Donald Trump seems to do in everything that -- that he's about and that he does.\nShe can remind us that we are all Americans first and Democrats, Republicans and independent second, third, or fourth.\nYou look at her plans and that's exactly what they do.\nRADDATZ: But again --\nBESHEAR: A middle-class tax breaks -- go ahead.\nRADDATZ: Governor, again, this race is incredibly tight. Vice President Harris's campaign motto is a new way forward.\nOur ABC/Ipsos poll, however, found that while 74 percent of Americans want Harris to diverge from President Biden if elected, 65 percent think she'll mainly continue the administration's policies.\nWhy isn't her idea of being a change candidate resonating?\nBESHEAR: Well, I think it's starting to resonate and it's going to resonate even more. And what we need are for folks to look at her policies. Again, the middle-class tax break would help right now. Expanding the child tax credit would help right now.\nShe's the first presidential candidate in my lifetime talking about affordable housing, both on the supply and on the affordability side. All of her plans are about helping people right now.\nDonald Trump, his plans are -- Project 2025, are tearing away the Affordable Care Act, which will eliminate health care coverage from tens of millions of people. You know, it couldn't be clear whose policies will help the American people, but we've got to communicate that over and over and over beyond the scare tactics.\n(CROSSTALK)\nRADDATZ: What do you think the biggest difference will be? Do you think she will be different than Joe Biden? What do you think the difference is?\nShe struggled on “The View” to say anything about anything different, that she would be different.\nBESHEAR: Well, of course, she'll be different because we are -- we are all different individuals. But just look at the plans --\n(CROSSTALK)\nRADDATZ: Policy-wise, policy-wise.\nBESHEAR: I mean, right there -- right, but President Biden plans were about building a future economy that is happening right now. We're building the two biggest battery plants on planet Earth in Kentucky.\nWe built the cleanest -- greenest recycle paper mill the world has ever seen. Those are all through his policies, but hers are about right now. How do we help the American people that are struggling to pay the bills? And that's middle-class tax breaks. That's affordable housing. That's the child care tax break. All the things that she is working on will help us get through the next six months and the next year, so that we will walk into this really strong economy that's being built out there.\n(CROSSTALK)\nRADDATZ: Which is a problem for her right now.\nBESHEAR: -- yet.\n(CROSSTALK)\nRADDATZ: A problem according to our polls right now, despite the positive jobs and inflation reports, in our new poll, 59 percent of Americans say the economy is getting worse, more than twice the 23 percent who say it's getting better. I also want to talk a little bit about what she said about her economic plan. She said she'd make sure the rich pay their fair share. That's something we heard Biden say over and over and over again. Then there's been no major tax overhaul.\nSo why would that be different under Harris, especially since she might be play -- might face a Republican Senate? How does she get that through?\nBESHEAR: Well, certainly she's telling you what her values are and the idea that those that have benefited from the United States of America, from being able to get out there and live the American dream, and have created wealth for themselves and their family should pay back into America to make sure that that dream is available for everybody else.\nI think what you're seeing is someone who has been in the Senate, who has that expertise, who has cast tie-breaking votes, and when you look at her policies, is seeking common ground with common sense. And ultimately that helps all of us. It helps her govern closer to the center in a way where she can build confidence from all the American people because after this election, after she wins, we've got to get past this constant us versus them, being asked to pick a side in everything from the car you drive to the beer you drink -- somehow beer became political in the last couple of years.\nShe is an answer that can get our country back on the right track. Being someone who knows her and Governor Walz very well, I have full confidence that they're going to lead us in the right direction.\nRADDATZ: OK, thanks for joining us this morning, Governor Beshear. We appreciate it.\nUp next, we'll check in with the mayor of Sarasota, Florida on the aftermath of Hurricane Milton. We'll be right back.\n(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nJOE BIDEN, PRESIDENT OF THE UNITED STATES: Those who engage in such lies are undermining confidence in the rescue and recovery work that's opening and ongoing. Lives are on the line. People are in desperate situations. Have the decency to tell them the truth.\n(END VIDEO CLIP)\nRADDATZ: President Biden weighing in on the misinformation surrounding the hurricane response in recent weeks. He visits Florida today to survey the damage.\nI'm joined now by Sarasota Mayor Liz Alpert whose city took a direct hit from Hurricane Milton.\nIt's good to see you this morning. I'm glad you're okay. But what's the latest you can tell us about where things stand in the recovery in Sarasota right in the region where Hurricane Milton made landfall?\nMAYOR LIZ ALPERT (D), SARASOTA, FLORIDA: Well, we're still -- it's still a mess but it's going to be a long recovery. We're still working on getting power restored. The power is back at probably about 80 percent of Sarasota County right now. There's still no water out to the barrier islands or power, but we're hoping by maybe end of the day Monday that that will be resolved.\nLots of debris, as you can imagine, to clean up. Sand that washed onto the roadways we're working on cleaning up that. But, you know, everybody is all hands on deck, even our Finance Department was out yesterday helping with the cleanup. So people are coming together. Neighbors are helping neighbors. It's been heartening to see all of the outpouring of support and help that people have been offering.\nRADDATZ: And Governor DeSantis said that you avoided the worst-case scenario. So far deaths are really low compared to what we saw in North Carolina with Hurricane Helene. What's your message to residents who might want to ignore evacuation warnings next time since the storm didn't end up as bad as expected thankfully?\nALPERT: Yes. I think because of Helene, this time people did heed the evacuation orders. But since it wasn't as bad now as they predicted I fear that people will again say, well, you know, it was OK last time, so maybe next time it won't be. But because they did heed the evacuation orders, in the city of Sarasota, we did not have one call for a rescue. And I think that speaks volumes about how you can save lives if you follow the orders and evacuate when a storm like this is coming.\nRADDATZ: Fair.\nALPERT: And if it's not as bad as it was supposed to be, that's fine.\nRADDATZ: Mayor, that's such good news. And we do hope everyone continues to heed those warnings.\nUp next, the powerhouse roundtable breaks down the state of the race with just three weeks to go. We'll be right back.\n(COMMERCIAL BREAK)\nRADDATZ: The roundtable is all here ready to break down our new poll, and we'll have the latest report in “Our Protecting Your Vote” series.\nWe'll be right back.\n(COMMERCIAL BREAK)\nRADDATZ: Now to our month-long series on the integrity of the voting process, and this morning, we look at how some candidates are using the unfounded threat of noncitizens voting in national elections to rally their base and intimidate voters, while some state officials have used those claims to purge voter registration lists.\nABC's Mireya Villarreal has the latest in our series, “Protecting Your Vote”.\n(BEGIN VIDEOTAPE)\nCECILIA CASTELLANO (D), TEXAS STATE REPRESENTATIVE CANDIDATE: How are you? I’m Cecilia. Pleasure to meet you.\nMIREYA VILLARREAL, ABC NEWS NATIONAL CORRESPONDENT (voice-over) Cecilia Castellano's roots run deep in South Texas. She grew up in a small conservative town just outside San Antonio, and now she wants to be their Democratic representative.\nCASTELLANO: I've been living here in Atascosa for 24 years.\nVILLARREAL (voice-over) But she never thought she would be caught up in the middle of a political storm, accused of violating election law.\nCASTELLANO: We are still working hard.\nVILLARREAL: August 20th, what happened that day?\nCASTELLANO: I remember being woken up, my doorbell going off and a banging on my door.\nUNIDENTIFIED MALE: Hi, police department.\nCASTELLANO: They said, ma'am, we have a search warrant. I said, a search warrant for what? They're like, well, can we come in?\nVILLARREAL (voice-over): Officers were looking for evidence of vote harvesting, a newly minted Texas law that says it's illegal to interact with people while their ballot is nearby. But Cecilia says she's never been charged, so she's not clear what she's accused of. What is clear, Cecilia says, is that this is voter intimidation.\nCASTELLANO: Why are they coming to the areas where the -- where it's predominantly Latinos, the rural areas? Why are they targeting this area?\nVILLARREAL (voice-over): What happened at Cecilia's home was one of more than a dozen raids that morning.\nSEAN MORALES-DOYLE, DIRECTOR, BRENNAN CENTER'S VOTING RIGHTS PROGRAM: Many of these search warrants, investigations are often sort of tied in the public rhetoric of the AG to conspiracy theories about non-citizens participating in our elections.\nVILLARREAL (voice-over): Republican Texas Governor Greg Abbott says this is a crackdown on illegal voting, but critics say that he's using new election law as a tool to make voting more difficult and to purge eligible voters from the rolls. And Republican officials in states like Ohio, Florida, Virginia, Tennessee, and Alabama are also purging their voter lists.\nMORALES-DOYLE: I don't think that there's anything wrong with voter list maintenance. It's a good thing and it's required by federal law. Sometimes election officials get aggressive in conducting voter list maintenance. Some officials engage in large-scale removals of voters.\nVILLARREAL (voice-over): With less than a month left until the November election, rhetoric is ramping up. And with it, a number of conspiracy theories like unsubstantiated claims of non-citizen voting.\nREP. MIKE JOHNSON, (R) SPEAKER OF THE HOUSE OF REPRESENTATIVES: We all know intuitively that a lot of illegals are voting in federal elections.\nVILLARREAL (voice-over): It is illegal on both the federal and state level for non-citizens to vote, and experts say it almost never happens. \"The Washington Post\" publishing a report this week saying they found no evidence supporting the Virginia Governor's claims that non-citizens were illegally voting.\nMORALES-DOYLE: Typically, the people who are telling you that non-citizens are voting in our elections don't have any evidence to cite. At the same time, you see the conspiracy theories about responding to Hurricane Helene.\nTRUMP: They stole the FEMA money just like they stole it from a bank, so they could give it to their illegal immigrants that they want to have vote for them.MORALES-DOYLE: I think that politicians are spreading these conspiracy theories with a focus on immigrants in order to pander to xenophobia.\nVILLARREAL (voice-over): Back in Texas, Cecilia is undeterred.\nCASTELLANO: We're going to continue the fight, continue to make sure that us minorities are not going to be suppressed, to be intimidated and to be told you don't have rights.\n(END VIDEOTAPE)\nRADDATZ: Our thanks to Mireya and ABC's investigative team. Let's bring in our Powerhouse Roundtable, Former DNC Chair, Donna Brazile; Former RNC Chair and Trump White House Chief of Staff, Reince Priebus; New Yorker Staff Writer, Susan Glasser; and Politico Playbook Co-Author Rachel Bade. Good morning to you all.\nOur latest poll, Donna, still shows a very, very tight race. Kamala Harris does not seem to be moving the needle. She was out there all week with the media blitz, with many interviews, many friendly interviews. What's happening -- what's -- what's your take on that?\nDONNA BRAZILE, FORMER DNC CHAIR& CONTRIBUTOR: Well, it's anybody's ball game, we all know that, this is going to be a close election. It was close in 2020. It was close in 2016. It's going to be close in 2024. What matters right now is that the campaign is reaching people where they live, where they work, where they play, and where they pray. This morning, the vice president is down in North Carolina, activating souls to the polls. That is people who go to church, people who know churchgoers will be told that this is a very important election. The only way Kamala Harris wins is if she gets on the ground, not just the vice president, but all of her supporters, and talk to people directly.\nRADDATZ: So you're saying just ground game, ground game, ground game, right?\nBRAZILE: Oh, right.\nRADDATZ: She does have a very strong ground game going, and especially as Donna will say, female voters. Donald Trump is lagging with female voters and some of the statements he makes are probably not helping.\nREINCE PRIEBUS, FORMER RNC CHAIR& FORMER TRUMP WHITE HOUSE CHIEF OF STAFF& ABC POLITICAL ANALYST: Yeah. Well, you can't win every demographic. I mean, the reality is, is that for the first time in 32 years in this poll, it shows that Republicans are beating Democrats straight up. When you ask people a generic ballot, in 32 years, it shows that Donald Trump's doing better with black voters, Hispanic voters, off the charts. But what the most important thing is what happened last week is that what was working with female voters with Kamala Harris was that there was some feeling of joy in the air.Well, that joy is gone. She had a terrible week. She picked a pointless fight with Ron DeSantis.\nShe -- you know, she's losing in the Sun Belt, and she tried to recover by going on \"THE VIEW\" which a lot of women watch. she went on \"THE VIEW.\" You talked about it earlier, and she wanted to clarify the two most important issues that are facing these two candidates, the economy and immigration, and she bombed like Rory at the U.S. Open, and she went out there and said there was nothing she would do that would be different than Joe Biden, and she created a campaign commercial for Donald Trump, and so she's trying to recover.\nThere is no joy here, and --\nRADDATZ: He created a few himself this week.\nPRIEBUS: And everybody knows it, and it's obvious that there is a leak in the balloon here in the Kamala Harris campaign.\nRADDATZ: And Rachael, despite what Reince said, and I'm sure you would argue with some of that, Donna, she is still very popular among female voters.\nRACHAEL BADE, ABC NEWS CONTRIBUTING POLITICAL CORRESPONDENT: Yes. Absolutely.\nRADDATZ: You've actually said this is kind of boys versus girls because --\nBADE: It seems like it.\nRADDATZ: Donald Trump is not.\nBADE: It seems like it. I mean, look, we've been talking about women this entire election, how they're running away from Trump. Childless cat lady comments, abortion, just Trump's temperament in general. But, you know, in the final weeks of this election, we are really starting to see that Donald Trump has been very successful with turning out men or at least getting them excited to vote for him.\nAnd not just, you know, conservative men, men who consider themselves to be, you know, pro-abortion rights, socially liberal men, black men, Latino men. And, you know, I was interviewing one of the sort of more famous focus group analyst, Sarah -- I'm sorry, Sarah Longwell at \"The Bulwark,\" and she was the talking about why, and it sounds like a lot of these men, they don't view Donald Trump as extreme.\nYou might disagree with that. They like him. They think he's sort of somebody that they would want to hang out with, and he has just been sort of successful and leaning into the strongman mentality that right now with, you know, all the chaos in the Middle East, with the issues with the hurricanes, she's hearing more and more in focus groups not just from men, but also some women who are reaching for that sort of strongman mentality and starting to second guess Harris.\nRADDATZ: And what does she do about that? Because, look, the battleground states are also very, very close.\nSUSAN GLASSER, THE NEW YORKER STAFF WRITER: Well, that's right. I mean, and it's interesting to see the national polls, but in the end it's going to come down to a handful of states. Six or seven or maybe even just three, the same three that determined the race in 2016. Pennsylvania, Michigan, and Wisconsin.\nThe polls this week underscored what, you know, in many ways we already knew, which is that Harris has not yet definitively managed to lock down the must-win states for a Democrat, but I think this conversation we're having, Martha, it's really a question of who in the end is the election about, and if people's gaze is focused on Donald Trump, his escalatory rhetoric, I mean, some of the things we've seen this week are the most nakedly racist and xenophobic things I've ever seen from a national candidate, and that includes Donald Trump in his previous two outings.\nHe thinks that's going to motivate his base. That's going to motivate his most committed supporters. Donald Trump always runs a base election, but for Kamala Harris, she also needs the race to a certain extent to be about Donald Trump and if he's not defined as an extremist at this point, you know, that is why she has not succeeded yet in putting away a race where she had an enormous amount of momentum this summer.\nRADDATZ: And Donna, I want you to respond to some of the things that Reince said about black voters, Latino voters. You had Barack Obama out there this week saying, you know, you've got to vote. That didn't go over so well with a lot of people.\nDONNA BRAZILE, FORMER DNC CHAIR: You know, I talked to my brothers, and they liked it. My nephews, you know, they said, wow, that was tough. But you know what, sometimes you need tough love in order to get people to focus on the reality and the dangers of another four years of Donald Trump.\nYou know, you talk about joy. Joy is something that comes in the morning. Joy is not dissipated simply because you put out a fog of lies. Going to Detroit, a city that is on the rebound, a city that is proud of its future and they are working very hard, and by the way, the Detroit Lions are very happy at this moment.\nLook, Kamala Harris is going to have to go out there every day and not just restore trust, but also outline the vision that she intends to provide for the American people. If she provides a vision that includes not just men, but women in the country as well, she will win.\nPRIEBUS: There is a feeling --\n(CROSSTALK)\nRADDATZ: I want to just let Rachael jump in here. Go ahead.\nBADE: Yes. I was going to say, we have a colleague, Brent Booker, who actually went to Detroit to talk to a lot of these black men that we're seeing in the polls who are sort ofturning from Harris and considering at least voting for Trump and they said a couple of things. Number one, they want to hear from Harris herself. They want to be asked for their vote and they didn't want to be lectured, and that's something he heard sort of universally, you know, around, you know, town in Detroit.\nAnd so, the fact that Obama came out there and as you mentioned, this tough love, maybe it works for some, but it certainly seemed even before he hit the campaign trail, a lot of these folks who were on the fence were saying, we don't want to be looked down upon for thinking maybe we want to vote for Trump. Tell us why we're wrong, but don't lecture us about being on the fence on this.\nPRIEBUS: First of all, people who are 30 years old today were about 14 during Barack Obama's heyday. It just doesn't move the needle. The reality is, I'm going to go back to what Donna started with, which is going to be a unified time for Donna and I, which is, this is going to come down to 75,000 votes in six states. Nothing.\nSo the kinds of folks that we're talking about are not paying attention to what Barack Obama is saying in some swing state somewhere. This is on the ground, person to person, thousands of people getting paid to target people knowing everything about a person, what beer they drink, what car they drive, how many kids they have, and what's going to move them. That's what is happening right now across America.\nRADDATZ: I want to just wrap up here with each of you, hopefully, if we can get to each of you, on what you really think this race will boil down to you. You touched on it, Susan, but I want to start with you, Donna. What is this race really about? Why are voters going to the poll?\nBRAZILE: It's about hope. It's about believing that this is a country that we have all put in the work, and now we want -- we are hiring a leader that will represent all of us, our values and our sense of optimism. That's what I believe this will come down to.\nRADDATZ: Susan?\nGLASSER: Martha, we're nine years into the Donald Trump era. This is the third consecutive election that Republicans have nominated Donald Trump. That's never happened in Republican Party history before. We have not re-elected a president who was defeated in more than a hundred years and only once in American history. Donald Trump challenged the results of a legal election for the first time in American history. He refused to accept the results. He has said things that are outside the mainstream of any candidate. And if Americans are going to return him to office, that's going to tell us something very important about this.\nRADDATZ: We have literally 10 seconds.\n(CROSSTALK)\nBADE: Yeah, I would say it's -- it's -- how it's going to impact their own lives, whether it's their own pocketbooks, their own freedom.\nPRIEBUS: People are tired of being lied to. They're tired of being told the economy is great, the border is secure. They're tired of being told that they're wrong to want the illegal crime gangs deported out of this country, and they want the economy back on track, and that's Donald Trump.\nRADDATZ: OK. Thank you very much. Good to see all of you. We'll be all right back.\n(COMMERCIAL BREAK)\nRADDATZ: And that's all for us today. Thanks for sharing part of your Sunday with us. Check out \"World News Tonight\" and have a great day.\n(COMMERCIAL BREAK)\n24/7 coverage of breaking news and live events"}, {"title": "Voters with disabilities are feeling ignored by presidential candidates", "link": "https://abcnews.go.com/Politics/wireStory/voters-disabilities-feeling-presidential-candidates-114778555", "content": "A new report from Rutgers University estimates that about 40.2 million eligible voters in the quickly approaching U.S. presidential election are disabled\nA new report from Rutgers University estimates that about 40.2 million eligible voters in the quickly approaching U.S. presidential election are disabled. Add those who cohabitate withpeople who have a disability, and you’re looking at close to one-third of the voting population for an election in which health care is among the key campaign issues.\nThe disabled voting bloc is growing as the U.S. population ages, but voters and advocates say the hurdles that make people feel excluded from the electoral process aren’t being addressed. That ranges from inaccessible campaign materials to formerPresident Donald TrumpandVice President Kamala Harrisseldomly mentioning how issues like COVID-19 impact the disability community, as well asTrump making a statement at a rally last monththat advocacy groups considered discriminatory.\n“They should be treating us like we’re their path to victory because we are, frankly,” said Dom Kelly, the founder and CEO of New Disabled South, an advocacy group that focuses on disability rights in the South. “You win or lose because of disabled people, and if you don’t take our community seriously, that will reflect on the outcome of your campaign.”\nLisa Schur and her husband Doug Kruse lead the Program for Disabilities Research at Rutgers and co-wrotethe new report, which also shows there are 7.1 million disabled voters in the battleground states of Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin.\nSchur said that disabled people are less likely to receive information about politics and can face numerous difficulties when voting in-person and by mail. All of it can lead to less participation.\n“It’s kind of like death by a thousand cuts,\" Schur said.\nMatt Mills is a former Trump supporter and avid voter. The 41-year-old from Brown County in southern Ohio has lupus, polyneuropathy and received two kidney transplants since 2017.\nThis year, he’ll be voting for Harris because of her “proven track record” of advocating for health care policies he likes. Even so, he believes voters with disabilities are taken for granted.\n“When we don’t see ourselves represented,” he said, “then we continue to get beat down and we get tired and we get discouraged.”\nJim Piet and Patricia Vincent-Piet of Concord, New Hampshire, both have cerebral palsy. The married couple say they’ve been dismissed by political candidates over the years when they try to talk with them — but also have had candidates be welcoming.\nWhat concerns them most, though, are policies that impact their day-to-day lives.\n“Just because I’m going to talk or be kind to people with disabilities does not mean that their policies are helpful,” said Vincent-Piet, 53.\nHer 63-year-old husband gets assistance through Medicaid’s long-term care program, which helps provide medical and personal care to people with disabilities and chronic illnesses. Vincent-Piet is worried that Republicans will make cuts to Medicaid. They both plan to vote for Harris.\nIn 2015, when Trump first ran for office, he flailed his arms in an apparent attempt to mock a disabled journalist. At a September rally in Erie, Pennsylvania, the former president falsely claimed Harris was “mentally impaired.” The American Association of People with Disabilitiescondemned Trump’s wordsas ableist and “harmful to people with disabilities.”\nTrump campaign spokesperson Karoline Leavitt said Trump is “committed to making sure every voter, including voters with disabilities, can exercise their right to vote in the most important election of our lifetime.”\nThere’s more to engaging disabled voters, said Meighan Stone, who uses a wheelchair due to symptoms of long COVID.\n“The focus on ableist jokes or whether or not disabled people are visibly at campaign events reduces disabled people to one thing,” Stone said, adding, “... That’s a level of discrimination we live with every day.”\nStone would like to see both candidates focus on solving how long it takes to get disability benefits — about 6-8 months, according to the federal government — and getting the Food and Drug Administration to approvea treatment for long COVID, saying, “I think both campaigns want to act as if they solved a pandemic and it’s over.”\nThe Harris campaign recently hired Anastasia Somoza as its disability engagement director. Somoza, who has cerebral palsy and uses a motorized wheelchair, said the Harris campaign will host an event with disabled entrepreneurs in Pittsburgh on Monday. Somoza also said she tries to make sure there's a virtual option for all campaign events.\nIn 2023, the vice president met with leaders in the disability space about transportation issues, and she has proposed paying forhome care with Medicareandeliminating subminimum wagefor disabled workers.\nBut the two presidential campaigns could do more, said Holly Latham at #MEAction, which advocates for people with chronic fatigue syndrome. She said ads, fliers and events need to be accessible to all disabled people.\n“Are they doing the basics? Are they providing alt-text (a written description of an image)?” Latham said. “Are they making sure they have interpreters for sign language and stuff like that?”\nDisabled Folks for Kamala, a coalition of advocates, said a virtual Harris campaign event for disabled voters on Oct. 8 “did not meet the basic access requirements.” Marissa Ditkowsky, who has a form of muscular dystrophy, watched the event and said she was frustrated by the issues.\nThe Harris campaign said it “deeply regrets” the technical difficulties. A human wasn't transcribing the closed captioning, and a sign language interpreter wasn't visible at the beginning of the event.\n“We want people to be thinking about us while they’re creating these spaces instead of coming around after the fact,” said Ditkowsky, who calls Harris the “clear choice” in the presidential race.\nThe U.S. Election Assistance Commission is currently working with election officials to ensure that every American that’s eligible to vote can do so independently, privately and without restrictions, Commissioner Benjamin Hovland said.\nHe acknowledged the increasing need for more focused and adequate training on disabilities for election officials and poll workers — especially for things like anxiety or different ways of processing information — in hopes of setting up more accommodating polling places.\n“No matter what it is or who someone is voting for, If somebody needs assistance, as a poll worker — which I say is the customer service face of our democracy — it’s your job to make sure that they can get through the process privately and independently and feel great about that,” Hovland said. “Give them the ‘I voted’ sticker and thank them. Just think about how that interaction matters.”\nPatti Chang, 61, is blind and lives in Chicago. She said this feeling of exclusion that she and other people who live with disabilities encounter isn’t just found in politics.\n“Until the society has higher expectations for people with disabilities and until society itself is more inclusive,” she said, “you’re going to see this not just in voting, but in almost everything you encounter.”\n___\nAssociated Press data journalist Kasturi Pananjady contributed to this report.\n___\nThe Associated Press Health and Science Department receives support from the Robert Wood Johnson Foundation. The Associated Press’ coverage of race and voting receives support from the Jonathan Logan Family Foundation. See more about AP’s democracy initiativehere. The AP is solely responsible for all content.\n24/7 coverage of breaking news and live events"}, {"title": "Abortion, voting rights, other key issues on the ballot in states this election", "link": "https://abcnews.go.com/Politics/abortion-voting-rights-key-issues-ballot-states-election/story?id=114511530", "content": "Forty-one states have a combined 147 ballot measures in the 2024 election.\nWhile the presidential race may be getting the spotlight this election season, key regulations, laws and policies are on the ballot in several states.\nAnd those ballot measures could have huge ramifications for the rest of the country.\nForty-one states have a combined 147 ballot measures in the 2024 election. While some measures are hyperlocal, some state initiatives dovetail with national topics.\nHere are some of the major ballot initiatives in this election.\nSince the U.S. Supreme Court overruled Roe v. Wade in 2022, voters in a handful of states have turned to ballot measures to enshrine or expand reproductive access in the face of abortion bans.\nTen statesin this election season will give their voters a chance to change their laws on the topic.\nArizona, Florida, Colorado, Missouri, Montana, Nebraska and Nevada all have measures that would amend their state constitutions with specific language to protect or recognize the right to an abortion for all constituents.\nNebraska also has another ballot measure that would change the state constitution to prohibit abortions in the second and third trimesters except for cases of \"medical emergency or when the pregnancy results from sexual assault or incest.\"\nNew York state has a ballot measure that would change the constitution's equal rights amendment to protect against discrimination for pregnancy outcomes, including abortion.\nSouth Dakota voters will decide on a measure that would establish a right to an abortion and add an amendment to the state constitution that would determine when the state may regulate abortions.\nVice President Kamala Harris has repeatedly called for the restoration of the reproductive rights established by Roe v. Wade.\nFormer President Donald Trump, who has taken credit for helping overturn Roe v. Wade, has said on the campaign trail that the states should decide abortion access and indicatedhe will vote \"no\"on Florida's ballot initiative.\nIllinois voters will decide on a measure that would advise state officials on whether to provide for medically assisted reproductive treatments, including in vitro fertilization, to be covered by any health insurance plan in Illinois that provides full coverage to pregnancy benefits.\nEven though it is already illegal for non-documented immigrants to register to vote and cast a ballot in federal and state elections, some leaders in states have been pushing laws and measures to prohibit those groups from casting ballots in local elections.\nA handful of municipalities have passed laws allowing some noncitizens to vote in certain local races. For example, non-U.S. citizens who have children attending public schools can vote in school board elections in San Francisco, following a 2016 ballot measure.\nThis year, Idaho, Iowa, Kentucky, Missouri, North Carolina, Oklahoma, South Carolina and Wisconsin have ballot measures that would prohibit noncitizens from voting in state and local elections.\nProponents have argued these laws would secure elections and prevent localities from allowing non-Americans to vote.\nHowever, opponents have emphasized that non-American citizens cannot vote in state and federal elections and the ballot measures are moot.\nSix states have already passed ballot measures banning noncitizens: Alabama, Arizona, Colorado, Florida, Louisiana, North Dakota and Ohio.\nUnder aranked-choice voting system, or RCV, voters cast a ballot ranking their candidates. If a candidate receives more than 50% of the No. 1 ranking, they win the election.\nIf no candidate receives that 50% majority, the election goes into an instant runoff.\nElection officials will look at the ballots and eliminate candidates with the fewest number of No.1 rankings. The ballots that listed the eliminated candidate as the top choice are then re-examined.\nThe candidates ranked No. 2 on those ballots are tallied, and those votes are transferred to the remaining candidates. The process continues until one candidate reaches the 50% majority.\nAlaska and Maine are the only two states in the nation that hold their state and federal elections using RCV, but that could change after this election.\nNevada and Oregon have ballot measures to change their state and federal elections to RCV. The District of Columbia also has a ballot measure that would change local elections to an RCV method.\nMissouri would ban the method if its voters pass a ballot measure that also includes banning noncitizens from voting.\nA ballot measure in Alaska would repeal its laws that mandate RCV for state and federal elections. Voters approved a measure in the 2020 election with 50.55%. Two years later, the method came under the national spotlight when an instant runoff decided the Senate race.\nSen. Lisa Murkowski, the incumbent who did not have the support of Republicans following her vote to convict Trump in his second impeachment trial, went on to win the election following the first elimination round.\nRepublican-controlled legislatures in 10 states -Tennessee, Florida, Idaho, South Dakota, Montana, Kentucky, Alabama, Mississippi, Louisiana, and Oklahoma- have passed laws in the last four years banning RCV from all elections.\nVoters in a few states will decide on state changes for laws and regulations concerning LGBTQ+ rights.\nColorado and Hawaii voters will vote on a ballot measure that would change their state constitutions to change language and allow same-sex couples the right to marry.\nA measure in South Dakota would change male pronouns in the state constitution to gender-neutral terms or titles.\nCalifornia voters will decide whether to repealProp 8, the 2008 voter measure that banned same-sex marriages. The law became invalid after the Supreme Courtruled in 2013that same-sex marriages were constitutional.\nMarijuana laws are potentially up for change in two states this election season.\nFlorida and South Dakota both have ballot measures that would legalize recreational marijuana for adults over the age of 21. This is South Dakota voters' third time deciding on the matter in four years.\nVotersapproved a measure in 2020to legalize recreational cannabis, but it was struck down by a lawsuit a year later. In 2022, a ballot measure to legalize marijuanafailed to pass.\nArizona has a voter initiative that would change state laws to allow for state and local police to arrest noncitizens who cross the border unlawfully and allow for state judges to order deportations.\nA North Dakota ballot includes an initiative that would require future ballot measures to be passed by voters in two consecutive elections before it's approved.\nColorado voters will decide on a measure that, if passed, would levy a 6.5% excise tax on the manufacture and sale of firearms and ammunition. Tax money would go \"to fund crime victim services programs, education programs, and mental and behavioral health programs for children and veterans.\"\nKentucky has a ballot initiative that would amend the constitution to enable the General Assembly to provide state funding to students who attend private schools.\n24/7 coverage of breaking news and live events"}, {"title": "Trump suggests a protester may get 'the hell knocked out of her' by her parents", "link": "https://abcnews.go.com/Politics/wireStory/trump-suggests-protester-hell-knocked-parents-114762243", "content": "Former President Donald Trump is continuing to use violent language when confronted by protesters at his rallies\nCOACHELLA, Calif. --Former President Donald Trump called for a protester at one of his rallies to “go back home to Mommy” to “get the hell knocked out of her,” his latest instance of using violent language when confronted by demonstrators.\nThe protester was ejected from Trump's Saturday evening rally in Coachella, California. As the crowd jeered her, Trump said “Back home to Mommy. She goes back home to Mommy.”\nTrump continued, imitating the imagined mother: “'Was that you, darling?' And she gets the hell knocked out of her.”\n“Her mother's a big fan of ours,” the former president finished before returning to his speech. “Her mother, her father.”\nIt was unclear what the protester was doing during the event, or what happened to her afterwards.\nTrump has a long history of using violent language about hecklers at his rallies. During his 2016 campaign, he urged his crowds to “knock the crap” out of protesters and said of one, “I'd like to punch him in the face.”\n24/7 coverage of breaking news and live events"}, {"title": "Walz weighs in on Biden's term when pressed on 'GMA'", "link": "https://abcnews.go.com/Politics/walz-weighs-bidens-term-pressed-gma/story?id=114710666", "content": "Joe Biden has “done everything in the best interests of the American public.”\nMinnesota Gov. Tim Walz said that he wasn’t sure anyone does “everything right” but that President Joe Biden has “done everything in the best interests of the American public” when pressed on whether he’d change any actions the Biden administration has taken over the last term.\n“Look, I don't know if any of us do everything right. But I can tell you he's done everything in the best interests of the American public,\" Walz, the Democratic vice presidential nominee, said in an interview that aired Friday on \"Good Morning America.\"\nThe governor was initially asked by \"GMA\" co-anchor Michael Strahan whether he’d have led the country differently from Biden on any points. His running mate, Vice President Kamala Harris, was not able to identify a decision where she would have gone another way when posed a similar question on “The View” earlier this week.\nWalz avoided a specific answer on Thursday, remarking that as a governor -- both during the Trump administration and during the Biden-Harris administration -- he’d seen a difference in leadership which ultimately “drew” him to the Democratic ticket. Walz also highlighted that Harris' values haven’t changed, which is something her critics have accused her of doing.\n“As a governor, I was asked to be governor of this state when Donald Trump was president and when Joe Biden was there, and I watched Donald Trump dismiss the COVID pandemic. I watched him drive an economy into the ground,” Walz said. “I watched Joe Biden and Kamala Harris pick those pieces up ... I think the thing that drew me to this ticket, and I think what the vice president's talking about is that her values on these hasn't changed,” he added.\nWalz also discussed his past false statements about his background -- including being in Hong Kong during the Tiananmen Square massacre and carrying a gun in a war.\nThese misstatements came to a head during his debate with Republican vice presidential nominee JD Vance, with Walz calling himself a \"knucklehead\" for making those mistakes.\nWhen Strahan asked if it was fair for Walz’s opponents to say he makes false claims to make himself look better, the governor responded by talking about his personal background while pointing to his recent cleanup efforts when called out for an inaccurate timeline surrounding the Tiananmen Square massacre.\n“Well, look, 35 years ago got the opportunity to be in Hong Kong, be in China, learned a lot about it. Served 24 years in the National Guard, passionately. In an instance, talking about gun violence in schools ... proud of the service that I've done, proud to be a teacher in that classroom, proud to have been very public all these years and owning it when I, you know, said, 'Look, I was in there in August of '89,'” Walz said.\nHe also pointed to the accomplishments of Minnesota under his leadership, insinuating that the results he was able to oversee outweighs the potential trust issue.\nWalz then pivoted to mention the claims about former President Donald Trump’s closeness with foreign leaders like Russian President Vladimir Putin published in Bob Woodward’s new book, which Trump has denied.\n“What you see here, you saw it in Minnesota, been elected eight times here -- these things have been very public for folks here. They see the results of things that we pass. We see a state that's a top-five state for business,” Walz said.\n“We see third-best state, top-three state for raising a child. And we've got the best health care. And I think the policies, whether it be dealing with China and understanding China's human rights record, what you can be certain there is that Kamala Harris and I aren't going to, you know, put dictators on speed dial,” Walz said.\nHe also reiterated that voters, like his constituents, would vote for him because they “know who I am,” when he was pressed by Strahan about concerns over trust.\nStrahan highlighted the fact that Walz said, during an interview airing earlier this week with \"60 Minutes,\" that Harris told him to be \"more careful on how you say things\" after several occasions where the campaign had to clarify his false statements.\n“I wear, you know, my -- I wear my emotions on my sleeve. And I do think in these positions, whether it be governor or being vice president of the United States, you do need to be careful,” Walz responded.\nWalz also said that he supports the Electoral College after saying only earlier this week that he supported eliminating it.\nOn the economy, Strahan highlighted recent polling that showed Americans needed to cut back on groceries in order to accommodate rising costs and how voters could be concerned that Harris might be responsible for this inflation.\nWalz appeared to say that that to reach these voters who blame Harris for the economy, the campaign should focus on their economic proposals.\n\"The reality for most people is if those costs are up, they want to know what you're gonna do about it,\" said Walz.\n24/7 coverage of breaking news and live events"}]