[{"source": "foxnews", "title": "President and first lady campaign in the biggest of the battlegrounds", "link": "https://www.foxnews.com/politics/bidens-trail-president-first-lady-campaign-biggest-battlegrounds", "content": "Fox News White House correspondent Peter Doocy has the latest on rumors President Biden feels wounded after withdrawing from the race on 'Special Report.'\nWith a margin of error race betweenVice President Kamala Harrisand former President Trump and three weeks to go until Election Day, the two residents of the White House are heading to the biggest of the battlegrounds to campaign on behalf of Harris and down-ballot Democrats.\nPresident Bidentravels to his native state of Pennsylvania on Tuesday, as he serves as the main attraction at the Philadelphia Democratic City Committee's autumn fundraising dinner.\nAnd first lady Jill Biden will be in suburban Philadelphia – as she headlines an afternoon event in Chester County and then speaks in the evening in Montgomery County, where she grew up.\nThe first lady is campaigning on behalf of Harris in the seven key swing states whose razor-thin margins decided her husband's 2020 victory over Trump and will likely determine if Harris or Trump succeed Biden in the White House.\nCHECK OUT THE LATEST FOX NEWS POWER RANKINGS IN THE 2024 ELECTION\nFirst lady Jill Biden speaks during a campaign stop Monday, Oct. 14, 2024, in Madison, Wisconsin.(AP Photo/Morry Gash)\nBiden's latest campaign trail foray for fellow Democrats comes amid reports of a lack of coordination between political advisers to the president and the vice president.\nTENSIONS ALLEGEDLY RISE BETWEEN BIDEN AND HARRIS AIDES\nThe appearances by both Bidens also come a day after the Democratic and Republican presidential nominees campaignedin Pennsylvania, with Harris holding two events in Erie, in the northwest corner of the state, and Trump in suburban Philadelphia, in the southeastern portion of the commonwealth.\nVice President Kamala Harris and President Biden arrive at a campaign event at the IBEW Local Union #5 hall in Pittsburgh, on Labor Day, Monday, Sept. 2, 2024.(AP Photo/Jacquelyn Martin)\nIt was the vice president's 10th visit to Pennsylvania since replacing Biden atop the Democrats' 2024 ticket in mid-July. Trump's also been a frequent visitor, with rallies in Scranton and Reading less than a week ago.\nPennsylvania, along with Michigan, Wisconsin, Georgia, North Carolina, Arizona and Nevada, had razor-thin margins that decided Biden's 2020 victory over Trump. And the seven states will likely determine whether Harris or Trump wins the 2024presidential election.\nCLICK HERE TO GET THE FOX NEWS APP\nBut with 19 electoral votes at stake, Pennsylvania's the biggest of the key battlegrounds. And while the campaigns and their allied super PACs are pouring resources into all seven states, more money has been spent running spots in Pennsylvania than any of the other battlegrounds, according to figures from AdImpact, a top national ad tracking firm.\nVice President Kamala Harris arrives to speak during a campaign rally at Erie Insurance Arena, in Erie, Pennsylvania, Monday, Oct. 14, 2024.(AP Photo/Jacquelyn Martin)\nPennsylvania, along with Michigan and Wisconsin, are the three Rust Belt states that make up the Democrats' so-called \"Blue Wall.\"\nThe party reliably won all three states for a quarter-century before Trump narrowly captured them in the 2016 election to win the White House.\nFour years later, in 2020, Biden carried all three states to put them back in the Democrats' column and defeated Trump.\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub."}, {"source": "foxnews", "title": "Trump says GOP is 'party of common sense' during contentious Bloomberg interview", "link": "https://www.foxnews.com/politics/trump-says-gop-party-common-sense-during-contentious-bloomberg-interview", "content": "Former President Trump details his foreign policy and trade policies on ‘Sunday Morning Futures.’\nFormer President Trump said theRepublican Partyis \"the party of common sense\" Tuesday during a contentious interview with Bloomberg News in Chicago.\nTrump sat for an interview with Bloomberg News’ editor-in-chief John Micklethwait at the Economic Club of Chicago. The two discussed Trump’s plans forthe economyin a potential second term during a heated interview that lasted nearly an hour.\nMicklethwait spoke about the economy to start, but later got into the state of the presidential race, asking the former president which state he believed was most critical to deciding the election.\nFormer President Trump speaks at a campaign town hall at the Greater Philadelphia Expo Center & Fairgrounds, Monday, Oct. 14, 2024, in Oaks, Pennsylvania.(AP Photo/Alex Brandon)\nTRUMP REVEALS WHICH ELECTION ISSUE IS A 'BIGGER DEAL' THAN INFLATION AND THE ECONOMY\n\"They say Pennsylvania. I think we’re doing very well there. I think you look at Michigan, too, and I’m doing very well,\" Trump said. \"We’re way up in Pennsylvania. We’re way up in Michigan. We’re doing very well in Arizona. In fact, somebody said they’re going to pull the plug in Arizona – they’re going to give it up because it looks like we’re quite a ways ahead.\"\nA RealClearPolitics polling average as of Tuesday afternoon showed Trump slightly ahead in Pennsylvania, as well as in Arizona and Michigan.\nTrump went on to say that the Republican Party is \"the party of common sense.\"\n\"Forget about conservative, liberal. We’re, let’s say, conservative, but we’re really a party of ‘We need borders. We need fair elections. We don’t want men playing in women’s sports. We don’t want transgender operations without parental consent,’\" Trump explained. \"It is 99.9% common sense. It really is common sense. I say we’re really a party of common sense, and we want to have great people in our country.\"\nTrump added: \"I have a good heart. I have a heart where I want people to be taken care of. But I don’t want to take in people where millions of people – 21 million people at least have come in the last three and a half years unvetted, unchecked. We don’t know anything about them.\"\nFormer President Trump answers questions at a meeting of the Detroit Economic Club, Thursday, Oct. 10, 2024, in Detroit.(AP Photo/Julia Demaree Nikhinson)\nMicklethwait began Tuesday's interview by claiming Trump’s economic plan would drive up debt and inflation, with the former president claiming that he served in office without inflation.\n\"Yeah, I had four years – no inflation,\" Trump said.\nMicklethwait also hit Trump on his plan for tariffs on foreign goods, but Trump fired back, explaining that foreign countries will pay a \"100% tariff on everything sold into the United States.\"\nFOX NEWS POWER RANKINGS: HARRIS LOSES HER LEAD AND A NEW ELECTORATE EMERGES\nEarlier this year, Trump rolled out a plan to eliminateChina's most favored nation trade statusand impose universal baseline 10% tariffs on imports. In private, Trump has even floated tariffs as high as 60% on Chinese goods. Economists have warned that increasing tariffs would also cause an increase in prices for everyday goods due to American companies relying on cheap raw materials from China.\nMicklethwait said Trump’s plans would \"have a serious effect on the overall economy.\"\n\"It’s going to have a massive effect – positive effect. It’s going to be a positive effect,\" Trump replied. \"It must be hard for you to spend 25 years talking about tariffs as being negative and then have somebody explain to you that you’re totally wrong.\"\nMicklethwait fired back at Trump, saying he could be \"plunging America into the biggest trade war.\"\n\"No, there are no tariffs – all you have to do is build your plant in the United States and you don't have any tariffs,\" Trump said. \"That's what I want.\"\nThe former president's response was met with applause from the audience.\n\"The higher the tariff, the more likely it is that the company will come into the United States and build a factory in the United States so it doesn't have to pay the tariff,\" Trump explained.\nAs for national security and foreign policy, Trump touted his relationships with adversaries, like Russian President Vladimir Putin, Chinese President Xi Jinping and North Korean leader Kim Jong Un, saying the United States was respected under his administration.\nTrump was asked if he would send American troops to defend Taiwan if China invaded. The Chinese military are currently engaged in rehearsals for a naval blockade of the island nation.\n\"The reason they're doing it now is because they're not going to do it afterward,\" Trump said – a response met with applause from the audience.\nTrump was also asked if he has spoken to Putin since he left office, to which he replied: \"I don’t comment on that.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"But I will tell you that if I did, it’s a smart thing,\" Trump said. \"If I’m friendly with people, if I can have a relationship with people, that’s a good thing, not a bad thing, in terms of a country.\"\n\"President Trump was in his element as he spoke passionately about restoring economic growth, prosperity, and opportunity for all Americans,\" his campaign wrote in an email to supporters following the interview, adding that he \"put on a master class outlining his plan to return American citizens and businesses to the successes they enjoyed during his first term.\"\nThe campaign added: \"Kamala could NEVER.\"\nThe Trump campaign touted the former president's responses and policies, and added: \"President Trump did it once with record success – and he'll do it again.\"\nBrooke Singman is a political correspondent and reporter for Fox News Digital, Fox News Channel and FOX Business."}, {"source": "foxnews", "title": "CNN anchor and Rep. Waltz clash over Harris ‘socialist’ label, networks likening Trump to Hitler", "link": "https://www.foxnews.com/media/cnn-anchor-rep-waltz-clash-harris-socialist-networks-trump-hitler", "content": "CNN anchor John Berman and Rep. Mike Waltz, R-Fla., debated loaded terms like ‘fascist’ and ‘socialist’ that have been used to describe the two presidential candidates.\nCNN anchor John Berman andRep. Mike Waltz, R-Fla., got into a tense exchange Tuesday morning over politically charged terms like \"fascist\" and \"socialist\" that have been used to describe the two presidential candidates.\nAt a recent rally in Erie, Pennsylvania, Vice President Kamala Harris played a mashup of clips in which Trump warned ofdangers from \"the enemy within.\"\n\"The worst people are the enemies from within... those people are more dangerous; the enemy within; than Russia and China. These people should be put in jail the way they talk about our judges and our justices,\" Trump collectively stated in some of the television clips played.\nIn recent comments on the matter toFox Business'Maria Bartiromo, Trump spoke about such \"enemies,\" and quipped that while China and Russia are \"dangerous\" at times to deal with, \"the thing that's tougher to handle are these lunatics that we have inside like Adam Schiff.\"\nMAHER SAYS HE'S NOT WORRIED ABOUT 'CRAZY' TRUMP WINNING ELECTION: ‘NOT EVEN NERVOUS'\nDemocratic presidential nominee, Vice President Kamala Harris speaks during a campaign rally at the Williams Arena at Minges Coliseum on the campus of East Carolina University on October 13, 2024, in Greenville, North Carolina.(Alex Wong/Getty Images)\nSchiff, a congressman from Burbank, Calif., is currently the Democratic nominee for U.S. Senate against Republican retired MLB star Steve Garvey.\nDuring an interview on \"CNN News Central,\" Berman asked Waltz whether it was \"responsible\" for Trump to make such comments.\nWaltz claimed that Trump was talking about issues that are \"detrimental\" to democracy in the United States and undermine public trust in institutions. For example, he claimed that Schiff, a senior House Intelligence Committee member, leaked information from compartmented hearings and lied to the public in open hearings.\nBerman then referenced the \"lunatic\" comment directed at Schiff and suggested that Trump was also talking about dealing with \"lunatics\" in a hypothetical military deployment.\n\"John, people were on this network calling Trump Hitler and the next coming of another dictator and two people have tried to kill him. We have the Iranians trying to kill him. A foreign adversary trying to assassinate him and we're talking about him playing music in a rally,\" Waltz said.\nBerman acknowledged that while it is essential to talk about heated rhetoric directed at Trump, Waltz himself has suggested that Harris is a \"socialist.\"\nAS A CAUTIOUS KAMALA LOSES MOMENTUM, DEMOCRATS ARE PANICKING OVER A TRUMP WIN\nCNN's John Berman and Rep. Mike Waltz, R-Fla., sat down on \"CNN News Central\" to discuss former President Donald Trump's \"enemy from within\" comments.(CNN/Screenshot)\n\"So, these phrases do get tossed around,\" Berman added.\nWaltz said that socialism is a \"longstanding political ideology\" and very different from claiming that Trump would be \"the world's most god-awful dictator\" and Hitler. Waltz also contended that such language is radicalizing people to take action.\nHe also noted that some members of Congress have referred to themselves as \"democratic socialists\" and insisted that Berman was not making a \"fair comparison.\"\n\"You don't?\" Berman asked. \"You talk about Marxism. You talk about socialism. And do you think Kamala Harris is a Marxist or a socialist?\"\nCLICK HERE TO GET THE FOX NEWS APP\nWaltz said that he believes Marxism is \"underpinning\" some of Harris' policies, such as price controls.\nBerman then tried to draw a comparison between Waltz's comments about Harris andretired Gen. Mark Milley'sremarks about Trump.\nMilley reportedly said, \"No one has ever been as dangerous to this country as Donald Trump… Now I realize he's a total fascist. He is the most dangerous person to this country,\" according to a new book by journalist Bob Woodward.\n\"He's saying that Donald Trump espouses fascist policies,\" Berman said. \"It's a political ideology. Fascism is a political ideology.\"\nNikolas Lanum is an associate editor for Fox News Digital."}, {"source": "foxnews", "title": "Nathan Wade grilled by House investigators probing Georgia Trump prosecution", "link": "https://www.foxnews.com/politics/nathan-wade-grilled-house-investigators-probing-georgia-trump-prosecution", "content": "Former Fulton County special prosecutor Nathan Wade is on Capitol Hill for a closed-door deposition by the House Judiciary Committee.\nFormer Fulton County Special Prosecutor Nathan Wade left Capitol Hill on Tuesday after a marathon four-and-a-half hour grilling by House Judiciary Committee investigators.\nWade, whose legal team included former Georgia Gov. Roy Barnes, said little to reporters before, after and during his closed-door deposition. No lawmakers were seen entering or leaving the room.\n\"This is all I’m going to say – we gave our testimony, we cooperated and we are through,\" Barnes told reporters after the session.\nGEORGIA GOP CHAIR SHARES 2-PRONGED ELECTION STRATEGY AS TRUMP WORKS TO WIN BACK PEACH STATE\nFormer Fulton County prosecutor Nathan Wade spoke with House investigators who are looking into the Georgia case against Donald Trump.(Getty Images)\nBarnes said \"yes\" when asked if it was an effective meeting and \"no\" when asked by Fox News Digital if he expected to follow up with the committee.\nEarlier, he had testy words for a reporter who asked whether Wade would plead the Fifth Amendment, responding tersely, \"What crime has been committed here?\"\nThe House Judiciary Committee has been seeking information on Wade’s relationship with Fulton County District Attorney Fani Willis, who is investigating former President Trump’s alleged efforts to overturn his 2020 electionloss in Georgia. Trump and 18 allies were indicted by a grand jury in August 2023 on charges including racketeering and conspiracy.\nWade was brought into that investigation by Willis as a special prosecutor, but stepped away after it was revealed he and Willis began a romantic relationship, which has since ended.\nTRUMP VS HARRIS ROUND 2? VOTERS IN KEY GA COUNTY REVEAL IF THEY WANT SECOND DEBATE\nWade had a romantic relationship with Fulton County District Attorney Fani Willis.(AP Photo/Brynn Anderson)\nIn a pair of letters published by the Republican majority on the committee on Monday night,Willis saidWade was instructed \"not to answer any questions about his role in the election interference case or about any evidence in that case.\"\n\"The disclosure of such evidence may also interfere with ongoing proceedings, this is considered legally privileged and not subject to disclosure,\" Willis wrote.\nThe committee responded on X, saying, \"What is she trying to hide?\"\nCLUB FOR GROWTH POURS $5M INTO TIGHT HOUSE RACES AS GOP BRACES FOR TOUGH ELECTION\nIt’s one of several probes by House Republicans into Trump’slegal battlessince he left office.\nBoth Willis and Wade have maintained that their relationship had nothing to do with the case and have accused Republicans of trying to unjustly interfere in the Fulton County probe.\nHouse Judiciary Chairman Jim Jordan's staff spoke with Wade for four hours.(Anna Rose Layden/Getty Images)\nJordan, meanwhile, is probing whether U.S. tax dollars were used to help bankroll their relationship during the course of the Trump probe.\nCLICK HERE TO GET THE FOX NEWS APP\nOne of Trump’s co-defendants had sued to have Willis and Wade disqualified from the case, arguing their relationship presented a conflict of interest and that they financially benefited from the probe – which they have denied.\nA Fulton County judge ruled in March that Willis could stay on the case if Wade was removed.\nFox News Digital reached out to the House Judiciary Committee for comment on Wade's deposition.\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com"}, {"source": "foxnews", "title": "GOP senator warns thousands have been 'rushed' into US after Afghanistan withdrawal: 'Weren't properly vetted'", "link": "https://www.foxnews.com/media/gop-senator-warns-thousands-have-been-rushed-us-after-afghanistan-withdrawal-werent-properly-vetted", "content": "Sen. Markwayne Mullin, R-Okla., shares new details about an Afghanistan national allegedly tied to an Election Day terror plot and discusses his swing state tour.\nLawmakers are raising new concerns about potential terror threats after the arrest of an Afghan national accused of planningan Election Dayattack. On\"Fox & Friends\"Tuesday, Sen. Markwayne Mullin, R-Okla., raised concerns about the vetting process for foreign nationals, warning \"thousands\" of individuals were \"rushed\" over in the wake of the Biden-Harris administration's botched Afghanistan withdrawal.\nAFGHAN CHARGED WITH ELECTION DAY TERROR PLOT RAISES QUESTIONS, FEARS FROM LAWMAKERS: ‘THIS IS REAL’\nSEN. MARKWAYNE MULLIN:I was briefed a few weeks prior to this, not by the FBI, but from a different agency. What we understood is this individual was vulnerable to touch points, meaning that they were accepted in on an SIV, special immigration visa, but there's confusion if he was prior or after the withdrawal. We believe that he was rushed with an SIV after the disastrouswithdrawal from Afghanistan,and it wasn't proper vetting to actually say he was an SIV. The issue that we have here is there's thousands of individuals that [were] rushed over here because of the Harris-Biden withdrawal, and they weren't properly vetted. And when you don't probably vet them, you don't know what their touch points – touch points mean their vulnerabilities –  vulnerabilities mean what can be leveraged against the individual to make them turn on their host country like this individual did. Fortunately, the FBI was doing their job. They did it correctly that no one was actually at harm, but they caught the individual.How many individuals are out therethat we're not paying attention to?\nNasir Ahmad Tawhedi is seen making the \"Tawhid\" gesture in a photo taken.(Department of Justice)\nAuthorities announced last week the arrest ofNasir Ahmad Tawhedi, an Afghan nationalwho came to the U.S. in 2021 after the withdrawal from Afghanistan. Tawhedi is charged with conspiring and attempting to provide material support to ISIS and receiving a firearm to be used to commit a felony or a federal crime of terrorism.\nAuthorities say he liquidated his family's assets to finance his plan, including purchasing rifles and one-way tickets for his wife and child back to Afghanistan.\n\"This defendant, motivated by ISIS, allegedly conspired to commit a violent attack, on Election Day, here on our homeland,\" said FBI Director Christopher Wray in a statement.\nCLICK HERE TO GET THE FOX NEWS APP\nCourt filings initially stated that he came on a special immigrant visa but have since clarified that he came to the U.S. via humanitarian parole and later applied for SIV status.\nA senior administration officialtold Fox News last week that Tawhedi was screened three times. He was screened first to work security for the CIA in Afghanistan, then for humanitarian parole to enter the U.S. in 2021, when he was vetted and screened in a third country, and then for special immigrant status, for which he was approved. His status has not yet been finalized. Officials believe he was radicalized after coming to the U.S.\nFox News' Adam Shaw and Chad Pergram contributed to this report.\nThis article was written by Fox News staff."}, {"source": "foxnews", "title": "More than 230 doctors and health care professionals call on Trump to release medical records", "link": "https://www.foxnews.com/politics/more-than-230-doctors-health-care-professionals-call-trump-release-medical-records", "content": "Trump 2024 senior adviser Tim Murtaugh reacts to Vice President Kamala Harris calling on former President Trump to release his medical records on 'The Story.'\nMore than 230 doctors, nurses and other health care professionals are calling on former President Trump to release his medical records afterVice President Kamala Harrisdid so.\nIn anopen letterdated Oct. 13, first reported by CBS News, the health care providers raise concerns about Trump's advanced age and argue that the 78-year-old Republican nominee should be transparent about his health and medical history.\n\"On August 20, Donald Trump said he would ‘very gladly’ release his medical records. In the 55 days since, he has yet to do so,\" the letter states. \"With no recent disclosure of health information from Donald Trump, we are left to extrapolate from public appearances. And on that front, Trump is falling concerningly short of any standard of fitness for office and displaying alarming characteristics of declining acuity.\"\nMost of the signatories support Harris for president. The letter asserts that Trump appears to \"ramble, meander, and crudely lash out at his many perceived grievances\" during his campaign events and questions whether this behavior is the result of cognitive changes associated with old age.\nHARRIS GOADS TRUMP TO RELEASE MEDICAL RECORDS AFTER SHE GETS CLEAN BILL OF HEALTH FROM PERSONAL PHYSICIAN\nVice President Kamala Harris (left) and former President Donald Trump, the 2024 U.S. presidential candidates.(Getty Images)\n\"The American people deserve to have confidence in their elected officials' mental and physical capacity to do the jobs that they've elected them to do. Trump ought to be going above and beyond to provide transparency on his physical health and mental acuity, given his advancing age.\"\nThe letter comes while Harris is goading Trump into releasing his health information after the White House put out a \"Healthcare Statement\" on Saturday that declared her to be in \"excellent health.\"\nWHITE HOUSE CORRECTS RECORD ON BIDEN'S PHYSICIAN, PARKINSON'S EXPERT MEETING, SAYS IT WAS FOR PRESIDENT'S CARE\nTrump, the GOP nominee, has not yet released up to date health information ahead of the 2024 presidential election.(Spencer Platt/Getty Images)\nThestatement from Harris' doctoralso indicated she had her most recent annual physical exam in April of this year. Trump released his own health records while campaigning in 2016, and once he took over the White House he continued the trend. In August, with the 2024 election quickly approaching, Trump told CBS News that he would release updated medical records to the public. However, he has yet to do so, with roughly three weeks until Election Day.\n\"He won't put out his medical records,\" Harris said Monday morning during an interview with podcast host Roland Martin. She also slammed Trump for refusing to debate a second time and questioned why Trump's \"staff\" would not allow him to do an interview with CBS' \"60 Minutes,\" particularly when it is tradition for both presidential candidates to do a sit down with the show.\nWHITE HOUSE RELEASES MEDICAL REPORT ON VP KAMALA HARRIS\nHarris on Saturday released a detailed statement of her health and medical records in an effort to contrast herself with Trump.(AP Photo/Susan Walsh)\n\"It may be because they think he's just not ready and unfit and unstable and should not have that level of transparency for the American people,\" Harris suggested.\nThe Trump campaign responded by pointing out several times the former president has voluntarily released updates about his health. They also noted that he sharedrecords from a July screeningconducted by Dr. Ronny Jackson, a former White House physician turned GOP congressman, following the second assassination attempt on his life.\n\"All have concluded [Trump] is in perfect and excellent health to be Commander in Chief,\" said Trump campaign spokesman Steven Cheung. \"He has maintained an extremely busy and active campaign schedule unlike any other in political history.\" Meanwhile, Cheung slammed Harris as being \"unable to keep up with demands of campaigning,\" arguing that compared to Trump her schedule \"is much lighter because, it is said, she does not have the stamina of President Trump.\"\nCLICK HERE TO GET THE FOX NEWS APP\nTrump himself reacted to Harris' medical statement on social media, calling it \"really bad.\"\n\"With all of the problems that she has, there is a real question as to whether or not she should be running for President!\" he wrote. \"MY REPORT IS PERFECT - NO PROBLEMS!!!\"Fox News Digital's Alec Schemmel contributed to this report.\nChris Pandolfo is a breaking news reporter for Fox News Digital. Send tips to chris.pandolfo@fox.com and follow him on Twitter @ChrisCPandolfo."}, {"source": "foxnews", "title": "Local officials face off against Georgia's elections board over rule that could shake up November", "link": "https://www.foxnews.com/politics/local-officials-face-off-against-georgias-elections-board-over-rule-could-shake-up-november", "content": "Fox News Digital spoke with Cobb County Democratic Party Chairwoman Essence Johnson about the 2024 election and the fight to keep Georgia blue.\nA hearing was held Tuesday in akey Georgia county’slawsuit against the State Elections Board (SEB), roughly three weeks until voters head to the polls on Nov. 5.\nFulton County Superior Court Judge Robert McBurney is overseeing the case filed by the Cobb County Board of Elections earlier this month. The bipartisan board is taking issue with a set of new rules imposed by the SEB, including a measure to require county election workers tohand count ballotsafter polls close to ensure accurate machine tabulation.\nThe rule has also sparked a lawsuit filed by Georgia Democratic officials, which is set for a hearing on Wednesday.\nCobb County is a majority suburban area anchored by the city of Marietta, a suburb of Atlanta.\nGEORGIA GOP CHAIR SHARES 2-PRONGED ELECTION STRATEGY AS TRUMP WORKS TO WIN BACK PEACH STATE\nFormer President Donald Trump and Vice President Kamala Harris are battling it out over Georgia while the major parties fight in the courts.(Fox News )\nDuring the Tuesday hearing, attorneys for the SEB argued that there were no limitations on when election rules can be passed and pointed out that the specific hand-counting rule applies only to the ballots themselves, not tallying individual votes cast on the ballots.\n\"All we are doing is saying, you need to [have] receipts of votes cast, mirror the number that the machine says were cast,\" the lawyer said.\nBut McBurney noted that it was \"late in the game\" for the SEB to change election rules but also conceded that, in a vacuum, wanting to ensure that the number of ballots cast matched the machine-count was a \"laudable goal.\"\nGEORGIA DEMS CHAIR REVEALS MESSAGE TO UNDECIDED GOP VOTERS AS HARRIS WORKS TO BUILD BROAD BASE\n\"Why wouldn’t we just pause, especially on the hand-count rule, given what looks like a fairly robust record of chaos that it is sowing?\" the judge asked the defendants’ lawyer.\n\"I'm asking you from a practical perspective, if the goal is orderly, reliable elections, why the prudent — in terms of reasonableness approach — wouldn't be to say, 'Let's try this next election,' when all those questions can be answered with no one having to sue?\"\nFulton County Superior Court Judge Robert McBurney is overseeing the case.(AP Photo/John Bazemore, File)\nRepublican Party officials have held the rule up as a critical guardrail to ensuring voters can be confident in their elections, but Democrats contend that its goal is to foment doubt in the process.\nThe Cobb County lawsuit argued the rules put elections boards across the state in \"an untenable position.\"\nAn attorney in support of the plaintiffs later pointed out the state officials who have come out in opposition to the rules changes, including Republican Secretary of State Brad Raffensperger.\n\"All of them are concerned about the impact of this rule,\" the lawyer said.\nTRUMP VS HARRIS ROUND 2? VOTERS IN KEY GA COUNTY REVEAL IF THEY WANT SECOND DEBATE\n\"It would be one thing in an ideal sterile environment to have people who are fresh and energized sit down and count ballots… That's not how this is going to play out. In reality, as our petitioner affidavits reference, poll workers get to their polls as early as 5 a.m., 5:30, 6 a.m. They stay as late as 8 p.m., 10 p.m. And so we're talking about adding something on top of an already 14- to 16-hour day when people are exhausted.\"\nMcBurney pointed out that it could then be done the next day, to which the attorney responded, \"But then there are challenges that come with that as well, Your Honor.\"\nThe judge said the hand-counting ballots rule \"does not directly interfere with the certification work going on\" but that it \"will be a resource drain, no question.\"\nBut the SEB attorney later criticized the plaintiffs’ arguments as conjecture.\n\"All that it says over and over again is, quote, ‘I am concerned about the rule’s last minute adoption….I am concerned that the Cobb County Elections Office lacks space. I am concerned that the hand-count rule may lead to delays,\" he said.\nCLICK HERE TO GET THE FOX NEWS APP\n\"It is hypothetical on top of conjecture, on top of speculation. There is no imminent threat here. There is a threat of potential things that might happen if the worst-case scenario comes up, and that's simply not sufficient for declaratory judgment.\"\nMcBurney heard the case the same day as he issued a decision in a separate Georgia elections case, ruling that county elections supervisors are not allowed to delay certification of results on the grounds of their own suspicions of fraud or mistakes.\nThere are a flurryof lawsuitsexpected around the vote count and voter access this election, as there are virtually every presidential election cycle.\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com"}, {"source": "foxnews", "title": "CNN anchor and Rep. Waltz clash over Harris ‘socialist’ label, networks likening Trump to Hitler", "link": "https://www.foxnews.com/media/cnn-anchor-rep-waltz-clash-harris-socialist-networks-trump-hitler", "content": "CNN anchor John Berman and Rep. Mike Waltz, R-Fla., debated loaded terms like ‘fascist’ and ‘socialist’ that have been used to describe the two presidential candidates.\nCNN anchor John Berman andRep. Mike Waltz, R-Fla., got into a tense exchange Tuesday morning over politically charged terms like \"fascist\" and \"socialist\" that have been used to describe the two presidential candidates.\nAt a recent rally in Erie, Pennsylvania, Vice President Kamala Harris played a mashup of clips in which Trump warned ofdangers from \"the enemy within.\"\n\"The worst people are the enemies from within... those people are more dangerous; the enemy within; than Russia and China. These people should be put in jail the way they talk about our judges and our justices,\" Trump collectively stated in some of the television clips played.\nIn recent comments on the matter toFox Business'Maria Bartiromo, Trump spoke about such \"enemies,\" and quipped that while China and Russia are \"dangerous\" at times to deal with, \"the thing that's tougher to handle are these lunatics that we have inside like Adam Schiff.\"\nMAHER SAYS HE'S NOT WORRIED ABOUT 'CRAZY' TRUMP WINNING ELECTION: ‘NOT EVEN NERVOUS'\nDemocratic presidential nominee, Vice President Kamala Harris speaks during a campaign rally at the Williams Arena at Minges Coliseum on the campus of East Carolina University on October 13, 2024, in Greenville, North Carolina.(Alex Wong/Getty Images)\nSchiff, a congressman from Burbank, Calif., is currently the Democratic nominee for U.S. Senate against Republican retired MLB star Steve Garvey.\nDuring an interview on \"CNN News Central,\" Berman asked Waltz whether it was \"responsible\" for Trump to make such comments.\nWaltz claimed that Trump was talking about issues that are \"detrimental\" to democracy in the United States and undermine public trust in institutions. For example, he claimed that Schiff, a senior House Intelligence Committee member, leaked information from compartmented hearings and lied to the public in open hearings.\nBerman then referenced the \"lunatic\" comment directed at Schiff and suggested that Trump was also talking about dealing with \"lunatics\" in a hypothetical military deployment.\n\"John, people were on this network calling Trump Hitler and the next coming of another dictator and two people have tried to kill him. We have the Iranians trying to kill him. A foreign adversary trying to assassinate him and we're talking about him playing music in a rally,\" Waltz said.\nBerman acknowledged that while it is essential to talk about heated rhetoric directed at Trump, Waltz himself has suggested that Harris is a \"socialist.\"\nAS A CAUTIOUS KAMALA LOSES MOMENTUM, DEMOCRATS ARE PANICKING OVER A TRUMP WIN\nCNN's John Berman and Rep. Mike Waltz, R-Fla., sat down on \"CNN News Central\" to discuss former President Donald Trump's \"enemy from within\" comments.(CNN/Screenshot)\n\"So, these phrases do get tossed around,\" Berman added.\nWaltz said that socialism is a \"longstanding political ideology\" and very different from claiming that Trump would be \"the world's most god-awful dictator\" and Hitler. Waltz also contended that such language is radicalizing people to take action.\nHe also noted that some members of Congress have referred to themselves as \"democratic socialists\" and insisted that Berman was not making a \"fair comparison.\"\n\"You don't?\" Berman asked. \"You talk about Marxism. You talk about socialism. And do you think Kamala Harris is a Marxist or a socialist?\"\nCLICK HERE TO GET THE FOX NEWS APP\nWaltz said that he believes Marxism is \"underpinning\" some of Harris' policies, such as price controls.\nBerman then tried to draw a comparison between Waltz's comments about Harris andretired Gen. Mark Milley'sremarks about Trump.\nMilley reportedly said, \"No one has ever been as dangerous to this country as Donald Trump… Now I realize he's a total fascist. He is the most dangerous person to this country,\" according to a new book by journalist Bob Woodward.\n\"He's saying that Donald Trump espouses fascist policies,\" Berman said. \"It's a political ideology. Fascism is a political ideology.\"\nNikolas Lanum is an associate editor for Fox News Digital."}, {"source": "foxnews", "title": "Nathan Wade grilled by House investigators probing Georgia Trump prosecution", "link": "https://www.foxnews.com/politics/nathan-wade-grilled-house-investigators-probing-georgia-trump-prosecution", "content": "Former Fulton County special prosecutor Nathan Wade is on Capitol Hill for a closed-door deposition by the House Judiciary Committee.\nFormer Fulton County Special Prosecutor Nathan Wade left Capitol Hill on Tuesday after a marathon four-and-a-half hour grilling by House Judiciary Committee investigators.\nWade, whose legal team included former Georgia Gov. Roy Barnes, said little to reporters before, after and during his closed-door deposition. No lawmakers were seen entering or leaving the room.\n\"This is all I’m going to say – we gave our testimony, we cooperated and we are through,\" Barnes told reporters after the session.\nGEORGIA GOP CHAIR SHARES 2-PRONGED ELECTION STRATEGY AS TRUMP WORKS TO WIN BACK PEACH STATE\nFormer Fulton County prosecutor Nathan Wade spoke with House investigators who are looking into the Georgia case against Donald Trump.(Getty Images)\nBarnes said \"yes\" when asked if it was an effective meeting and \"no\" when asked by Fox News Digital if he expected to follow up with the committee.\nEarlier, he had testy words for a reporter who asked whether Wade would plead the Fifth Amendment, responding tersely, \"What crime has been committed here?\"\nThe House Judiciary Committee has been seeking information on Wade’s relationship with Fulton County District Attorney Fani Willis, who is investigating former President Trump’s alleged efforts to overturn his 2020 electionloss in Georgia. Trump and 18 allies were indicted by a grand jury in August 2023 on charges including racketeering and conspiracy.\nWade was brought into that investigation by Willis as a special prosecutor, but stepped away after it was revealed he and Willis began a romantic relationship, which has since ended.\nTRUMP VS HARRIS ROUND 2? VOTERS IN KEY GA COUNTY REVEAL IF THEY WANT SECOND DEBATE\nWade had a romantic relationship with Fulton County District Attorney Fani Willis.(AP Photo/Brynn Anderson)\nIn a pair of letters published by the Republican majority on the committee on Monday night,Willis saidWade was instructed \"not to answer any questions about his role in the election interference case or about any evidence in that case.\"\n\"The disclosure of such evidence may also interfere with ongoing proceedings, this is considered legally privileged and not subject to disclosure,\" Willis wrote.\nThe committee responded on X, saying, \"What is she trying to hide?\"\nCLUB FOR GROWTH POURS $5M INTO TIGHT HOUSE RACES AS GOP BRACES FOR TOUGH ELECTION\nIt’s one of several probes by House Republicans into Trump’slegal battlessince he left office.\nBoth Willis and Wade have maintained that their relationship had nothing to do with the case and have accused Republicans of trying to unjustly interfere in the Fulton County probe.\nHouse Judiciary Chairman Jim Jordan's staff spoke with Wade for four hours.(Anna Rose Layden/Getty Images)\nJordan, meanwhile, is probing whether U.S. tax dollars were used to help bankroll their relationship during the course of the Trump probe.\nCLICK HERE TO GET THE FOX NEWS APP\nOne of Trump’s co-defendants had sued to have Willis and Wade disqualified from the case, arguing their relationship presented a conflict of interest and that they financially benefited from the probe – which they have denied.\nA Fulton County judge ruled in March that Willis could stay on the case if Wade was removed.\nFox News Digital reached out to the House Judiciary Committee for comment on Wade's deposition.\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com"}, {"source": "foxnews", "title": "'Ruining our car industry': Biden-Harris EV regs prove flashpoint in Michigan Senate debate", "link": "https://www.foxnews.com/politics/ruining-our-car-industry-biden-harris-ev-regs-prove-flashpoint-michigan-senate-debate", "content": "Mike Rogers emphasized the importance of his latest endorsement in the Michigan Senate race, as farmers back the Republican over his Democrat foe.\nFormer Rep. Mike Rogers, R-Mich., and Rep. Elissa Slotkin, D-Mich., traded blows on electric vehicle mandates and border security during their Senate debate in the criticalswing state of Michigan.\n\"It's ruining our car industry,\" Rogers said of mandates related to buying and producing electric vehicles (EV) during Monday’s debate, starting one of the most heated exchanges of the event. \"You're promoting Chinese technology in America.\"\nThe two candidates in Michigan’s critical Senate race have sparred over the issue of EV mandates throughout the campaign, highlighting how critical the issue is in a state that will play a major role in deciding thepresidential electionand control of the federal legislature.\nRogers has attempted through two debates in the race to tie President Biden and the Democratic Party’s support for EVs to Slotkin, who has countered that her support for the technology will ensure that Michigan remains competitive in the future of auto manufacturing.\nMICHIGAN SENATE CANDIDATES CLASH ON NATIONAL SECURITY, IMMIGRATION AND ABORTION\nThe Michigan Senate race between Elissa Slotkin and Mike Rogers is more competitive than initially predicted.(Associated Press)\nRogers said Democrats such as Slotkin are \"killing the car business\" when it comes to promoting EVs, accusing his opponent of voting for a \"mandate\" on EVs \"at least three times.\"\nWhile there has been no mandate that Americans must purchase EVs, the Biden administration has pressed emissions standards that could force automakers to ensure that up to two-thirds of their new vehicles sold are zero-emissions by 2032. According to a report in the Detroit Free Press, Slotkin voted against legislation that would have blocked the new standards, but has expressed openness to rewriting them if they would hurt U.S. automakers.\n\"I want that manufacturing here. I don't care what you drive, I want to build them,\" Slotkin said during Monday’s debate.\nThe two candidates also attempted to cast blame on the other for the situation at thesouthern border, with Slotkin accusing Rogers and Republicans of a campaign to kill Biden’s border legislation before it could get through Congress.\n\"What's going on at the southern border is a symptom of a broken immigration system,\" Slotkin said, accusing Republicans of using the \"border as a political issue than actually do the real work and get things done.\"\nFOX NEWS POWER RANKINGS: HARRIS TICKS UP AND SENATE REPUBLICANS TAKE CHARGE\nRogers instead blamed Democrats on the issue, calling Biden’s legislation a \"terrible bill\" that would have allowed for continued legal crossings, while Slotkin questioned how Rogers could claim to know better on the issue than the national Border Patrol union, which threw its support behind the deal.\nThe debate also highlighted the two candidates' competing viewson abortion, with Slotkin doubling down on campaign ads that have accused Rogers of supporting several pieces of anti-abortion legislation.\n\"He has shown us who he is, don’t trust him on this issue,\" Slotkin said.\nMICHIGAN DEM LAUNCHES ANTI-EV AD IN BID FOR SENATE RACE AFTER VOTING AGAINST A BIPARTISAN PUSHBACK ON MANDATES\nRogers countered by arguing that he supported leaving the question of abortion to the voters in each state, promising not to do anything in the Senate that would undo the will of voters in Michigan who voted to make abortion a right in the state.\n\"I won't do anything when I go back to the United States Senate to undo the vote of the people,\" Rogers said.\nAnother tense exchange saw the two candidates trade blows over gun reform, with Slotkin acknowledging her ownhistory with firearmsbut calling for tougher legislation to \"go after the number one killer of children in our communities.\"\nFormer President Trump campaigns with Senate candidate Mike Rogers at the Ryder Center for Health and Physical Education at Saginaw Valley State University in Saginaw, Michigan, Oct. 3, 2024. (Jim Watson/AFP via Getty Images)\n\"It's really, really easy to understand why politicians, in the face of murdered children, don't do anything. They don't do it because they receive campaign donations and they're scared,\" Slotkin said. \"They're scared because they don't want to lose their election, and it's terrible.\"\nTHE BIDEN-HARRIS EV MANDATES WILL HURT WORKERS IN STATES LIKE MICHIGAN: TUDOR DIXON\nRogers countered that the issue mostly centered on the country’s struggles with mental health, and that \"banning guns isn’t going\" to solve the issue.\nInflation andthe economywere another major issue during the debate, with Rogers appealing to voters to remember if they were better off under the leadership of Republicans four years ago.\n\"Are you better off than you were four years ago?\" Rogers asked. \"My opponent voted 100% with Biden-Harris (Vice President Kamala Harris, who is the Democratic presidential nominee) on all of the things that have raised your prices.\"\nSlotkin responded by pointing to her support for bringing supply chains back to the U.S., which she argued would help bring prices down. She also hit Rogers on his lack of support for allowing the government to negotiate lower pharmaceutical prices, something she said would help alleviate the pressure on middle-class families.\nRep. Elissa Slotkin after speaking at the Democratic National Convention on Aug. 22, 2024, in Chicago. (Kevin Dietsch/Getty Images)\nCLICK HERE TO GET THE FOX NEWS APP\nThe Senate race in Michigan will be one of the closely watched nationally and features one of the few tight races that could determine control of the upper chamber this election.\nAccording to theFox News Power Rankings, the Michigan Senate race leans in the Democrats' favor. According to the Real Clear Politics polling average, Slotkin currently holds a slim 1.9 lead over her Republican opponent.\nEven so, the race has shifted significantly since Sept. 19, when Slotkin held a 5.1 advantage over Rogers in the average.\nRepublicans have showed optimism about the race, with Axios reporting Tuesday that the Republicans' Senate Leadership Fund will pour another $10.5 million into Rogers' campaign for the home stretch of the election.\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.\nMichael Lee is a writer for Fox News. Prior to joiningFox News, Michael worked for theWashington Examiner,Bongino.com, andUnbiased America. He has covered politics for more than eight years."}, {"source": "foxnews", "title": "Trump says 'I don't care when you vote' in new House GOP ad urging voters to turn out early", "link": "https://www.foxnews.com/politics/trump-says-i-dont-care-when-you-vote-new-house-gop-ad-urging-voters-turn-out-early", "content": "Georgia Republican Party Chairman Josh McKoon spoke with Fox News Digital about the race to flip the Peach State back to red in this year's presidential election.\nFIRST ON FOX:A dramatic, months-longcampaign seasonis drawing to a close as the clock ticks closer to Election Day, according to a new message from House Republicans to voters.\nThe National Republican Congressional Committee (NRCC), the House GOP’s campaign arm, released a new digital ad on Tuesday marking 21 days until the election.\nIt comes as Republican Party operators at the state, federal and local level work overtime to convince supporters to vote early, particularly in pivotal swing states like Georgia and North Carolina that have been ravaged by Helene this storm season.\nCLUB FOR GROWTH POURS $5M INTO TIGHT HOUSE RACES AS GOP BRACES FOR TOUGH ELECTION\nRepublicans are working overtime to turn voters out early in former President Trump's race to beat Vice President Harris.(Getty Images)\nThe ad features audio clips from the entire House GOP leadership suite – Speaker Mike Johnson, Majority Leader Steve Scalise, Majority Whip Tom Emmer, House GOP Conference Chairwoman Elise Stefanik and NRCC Chairman Richard Hudson – as well asformer President Trump.\nTrump’s voice opens the video with, \"Republicans must win, and we must use every appropriate tool available to beat the Democrats. They are destroying our country.\"\n\"I don’t care when you vote, but you’ve got to vote,\" Trump says in the video.\nMeanwhile, clips of vulnerable Republicans, like Rep. Jen Kiggans, R-Va., and Ken Calvert, R-Calif., flash across the screen interspersed with the word \"vote.\"\nGEORGIA GOP CHAIR SHARES 2-PRONGED ELECTION STRATEGY AS TRUMP WORKS TO WIN BACK PEACH STATE\nThe ad features vulnerable Republicans like Rep. Jen Kiggans.(Win McNamee/Getty Images)\nIt’s set against a portion of \"Dream On\" by Aerosmith, per an airing viewed by Fox News Digital.\n\"In 21 days, Americans will cast their ballots to end Democrats’ dangerous, far-left socialist agenda for our country. Every trip to the grocery store, fentanyl death or crime committed in a family’s neighborhood should give voters another reason to record their vote in this critical election,\" NRCC rapid response director Macy Gardner told Fox News Digital.\nEarly in-person voting is kicking off in four states this week. Georgia can head to the polls before Election Day from Tuesday through Nov. 1, while North Carolina begins early voting on Thursday. Voters in Iowa and Kansas are also heading to the polls.\nRepublican Party officials have been working overtime to convince their base to vote earlyafter Democratswalloped the GOP with non-Election Day voters in 2020.\nSPEAKER JOHNSON RIPS ‘LACK OF LEADERSHIP’ IN BIDEN ADMIN'S HELENE RESPONSE: 'ALARMED AND DISAPPOINTED'\nPresident Biden's 2020 victory was due in no small part to non-Election Day voters.(Aaron Schwartz/Sipa/Bloomberg via Getty Images)\nThose efforts will be particularly critical in North Carolina and Georgia, both states hit hard by Hurricane Helene and where the election is expected to be close.\nCLICK HERE TO GET THE FOX NEWS APP\nGetting likely voters to head to the polls early, Georgia GOP Chairman Josh McKoon explained early this month, frees up resources closer to Election Day to convince \"low propensity voters\" to turn out as well.\n\"All of that requires resources. That requires money – put mail in the mailbox, ads on television, telephone calls to their home, knocking on their door. We’re trying to do all of those things,\" McKoon told Fox News Digital.\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com"}, {"source": "foxnews", "title": "More than 230 doctors and health care professionals call on Trump to release medical records", "link": "https://www.foxnews.com/politics/more-than-230-doctors-health-care-professionals-call-trump-release-medical-records", "content": "Trump 2024 senior adviser Tim Murtaugh reacts to Vice President Kamala Harris calling on former President Trump to release his medical records on 'The Story.'\nMore than 230 doctors, nurses and other health care professionals are calling on former President Trump to release his medical records afterVice President Kamala Harrisdid so.\nIn anopen letterdated Oct. 13, first reported by CBS News, the health care providers raise concerns about Trump's advanced age and argue that the 78-year-old Republican nominee should be transparent about his health and medical history.\n\"On August 20, Donald Trump said he would ‘very gladly’ release his medical records. In the 55 days since, he has yet to do so,\" the letter states. \"With no recent disclosure of health information from Donald Trump, we are left to extrapolate from public appearances. And on that front, Trump is falling concerningly short of any standard of fitness for office and displaying alarming characteristics of declining acuity.\"\nMost of the signatories support Harris for president. The letter asserts that Trump appears to \"ramble, meander, and crudely lash out at his many perceived grievances\" during his campaign events and questions whether this behavior is the result of cognitive changes associated with old age.\nHARRIS GOADS TRUMP TO RELEASE MEDICAL RECORDS AFTER SHE GETS CLEAN BILL OF HEALTH FROM PERSONAL PHYSICIAN\nVice President Kamala Harris (left) and former President Donald Trump, the 2024 U.S. presidential candidates.(Getty Images)\n\"The American people deserve to have confidence in their elected officials' mental and physical capacity to do the jobs that they've elected them to do. Trump ought to be going above and beyond to provide transparency on his physical health and mental acuity, given his advancing age.\"\nThe letter comes while Harris is goading Trump into releasing his health information after the White House put out a \"Healthcare Statement\" on Saturday that declared her to be in \"excellent health.\"\nWHITE HOUSE CORRECTS RECORD ON BIDEN'S PHYSICIAN, PARKINSON'S EXPERT MEETING, SAYS IT WAS FOR PRESIDENT'S CARE\nTrump, the GOP nominee, has not yet released up to date health information ahead of the 2024 presidential election.(Spencer Platt/Getty Images)\nThestatement from Harris' doctoralso indicated she had her most recent annual physical exam in April of this year. Trump released his own health records while campaigning in 2016, and once he took over the White House he continued the trend. In August, with the 2024 election quickly approaching, Trump told CBS News that he would release updated medical records to the public. However, he has yet to do so, with roughly three weeks until Election Day.\n\"He won't put out his medical records,\" Harris said Monday morning during an interview with podcast host Roland Martin. She also slammed Trump for refusing to debate a second time and questioned why Trump's \"staff\" would not allow him to do an interview with CBS' \"60 Minutes,\" particularly when it is tradition for both presidential candidates to do a sit down with the show.\nWHITE HOUSE RELEASES MEDICAL REPORT ON VP KAMALA HARRIS\nHarris on Saturday released a detailed statement of her health and medical records in an effort to contrast herself with Trump.(AP Photo/Susan Walsh)\n\"It may be because they think he's just not ready and unfit and unstable and should not have that level of transparency for the American people,\" Harris suggested.\nThe Trump campaign responded by pointing out several times the former president has voluntarily released updates about his health. They also noted that he sharedrecords from a July screeningconducted by Dr. Ronny Jackson, a former White House physician turned GOP congressman, following the second assassination attempt on his life.\n\"All have concluded [Trump] is in perfect and excellent health to be Commander in Chief,\" said Trump campaign spokesman Steven Cheung. \"He has maintained an extremely busy and active campaign schedule unlike any other in political history.\" Meanwhile, Cheung slammed Harris as being \"unable to keep up with demands of campaigning,\" arguing that compared to Trump her schedule \"is much lighter because, it is said, she does not have the stamina of President Trump.\"\nCLICK HERE TO GET THE FOX NEWS APP\nTrump himself reacted to Harris' medical statement on social media, calling it \"really bad.\"\n\"With all of the problems that she has, there is a real question as to whether or not she should be running for President!\" he wrote. \"MY REPORT IS PERFECT - NO PROBLEMS!!!\"Fox News Digital's Alec Schemmel contributed to this report.\nChris Pandolfo is a breaking news reporter for Fox News Digital. Send tips to chris.pandolfo@fox.com and follow him on Twitter @ChrisCPandolfo."}, {"source": "foxnews", "title": "From cease-fire push to boots on the ground in Israel: US seemingly accepts involvement in escalating war", "link": "https://www.foxnews.com/politics/what-does-putting-us-troops-ground-mean-us-involvement-israeli-response-iran", "content": "Fox News chief national security correspondent Jennifer Griffin reports on the U.S. deploying a missile defense system to Israel on ‘Your World.’\nThe U.S. is now more deeply entrenched in the conflict in the Middle East after a pivotal move to send troopsto Israelwas announced this week.\nOn Monday, the Biden administration revealed it would offer Israel one of theU.S.’s highly sophisticated THAAD missile defense systems– as Israel braces for potential Iranian retaliation to the counter-attack it is planning after Tehran rained down missiles on Tel Aviv on Oct. 1.\nOnly U.S. troops can operate the system, and 100 of them will deploy to Israel. The Pentagon only has seven operable Terminal High-Altitude Area Defense (THAAD) batteries in its possession, and the one offered to Israel would presumably be among the seven.\nThough Washington has armed Israel throughout its existence, putting boots on the ground for Israel's defense is a rare departure from U.S. policy and the first U.S. deployment there since the outbreak of war after the Oct. 7 Hamas attack.\n\"It's a bit unprecedented,\" said EJ Kimpton, policy director at the U.S. Israel Education Association.\n\"Israel's mantra has been, you know, with ‘Never Again,’ meaning we will defend ourselves by ourselves, obviously working with allies, but that we should be able to defend our country and not be dependent upon others,\" Kimpton went on. \"It changes the dynamic between the U.S. and Israel in Israel's war fighting over the years.\"\nThe THAAD system provides a transportable, rapidly deployable ability to intercept and destroy ballistic missiles.(Missile Defense Agency/ US Department of Defense)\n\"This would be the first time that U.S. personnel would be actively engaged in essentially fighting a war with Israelif Iranwere to carry out additional strikes.\"\nNETANYAHU HITS BIDEN ADMIN, SAYS ISRAEL – NOT US – WILL DECIDE HOW TO HANDLE IRAN\nFrom pushing Israel to a cease-fire, the U.S. has pivoted to containing the war in the Middle East, to seemingly accepting the fate of U.S. involvement in the conflict.\nThe U.S. has some 43,000 troops deployed elsewhere in the Middle East and recently sent a \"few thousand\" to the region within the last few weeks to be ready to defend Israel if necessary.\n\"It's inescapable to see it as anything else [than escalation], the United States is now actually sending troops. We did not do that in Ukraine,\" Trita Parsi, vice president of the Quincy Institute for Responsible Statecraft, told Fox News Digital.\nSending U.S. troopsto Ukraineis a non-starter in American discourse – a popular refrain among supporters is that such aid will prevent U.S. troops from ever having to put themselves in Russia's line of fire.\n\"We may end up having American casualties, and to put soldiers in that type of vulnerable situation for something that is not the defense of the United States itself, I think, is a very serious step taken by the administration,\" said Parsi.\nIn the past, Iranians have targeted military installations, including Israeli air defense systems. The THAAD system is expected to be able to intercept ballistic missiles launched from Iran and Yemen and shoot down any short-range missiles launched by Hezbollah from Lebanon.\nOthers question why the administration is supplying the system with no real off-ramp to the conflict or U.S. involvement in it. Israel’s mission to eradicate Hezbollah and Hamas has now drawn it into direct conflict with Iran, and hope for peace anytime soon appears to have faded.\n\"Why are we keeping U.S. troops in harm’s way in Iraq and Syria with no clear mission or defensive strategy, while deploying critical defense systems like THAAD to Israel?\" Jason Beardsley, senior coalitions adviser to Concerned Veterans for America, questioned.\nThe THAAD system is loaded onto a 4th Airlift Squadron C-17 Globemaster III at Fort Bliss, Texas.(Staff Sgt. Cory D. Payne/U.S. Air Force/AP)\nHeavy smoke billows from an Israeli airstrike on the Lebanese southern border town of Khiam.(Stringer/picture alliance via Getty Images)\n\"The reality is, we’re funding both sides of this conflict – directly aiding Iraq, whose Iranian-backed militias target our forces, and indirectly supporting Israel’s defense without addressing the real vulnerability: U.S. personnel scattered across the Middle East, with Iran’s proxies actively targeting our troops.\"\nIDF MEETS LITTLE RESISTANCE FROM HEZBOLLAH AFTER WEEKS OF HITTING TERROR TARGETS, OFFICIALS SAY\nThe U.S. has some 2,500 troops in Iraq leading a coalition that provides extensive support to the Iraqi Security Forces to fight ISIS. But Iran has already tightened its grip on Baghdad and the mission its forces carry out.\nThe THAAD will assist Israel’s other missile defenses in what could be the Biden administration bracing for escalation: an aggressive counter-attack from Iran to an aggressive counter-attack from Israel.\nFor two weeks, the world has waited to see how Israel responds to the 200 missiles Iran fired at the heart of Tel Aviv.\nA violent showing from Israel might deter Iran from wanting to pick a larger battle. But in the Biden administration’s view, a disproportionate response risks a tit-for-tat that could lead to all-out war.\nPresident Biden may have offered the system as a way to coax Prime Minister Benjamin Netanyahu to follow his recommendation: to make sure Israel's counterstrike to Iran’s missile attacks is \"proportional\" – by going after military installations – not nuclear or oil facilities.\nCLICK HERE TO GET THE FOX NEWS APP\n\"I think the administration may be thinking that by offering this, they can convince the Israelis not to go that far,\" said Parsi.\n\"If you truly want to put an end to this, then sending the same system that actually makes it easier for Israel to escalate is not the answer…  Sometimes, it's really difficult to discern who is actually making the policy and what is the policy.\"\nNetanyahu told Biden he was willing to strike military facilities when they spoke on the phone last week, according to aWashington Post report.But after that report, Netanyahu said in a statement he would not be making any decisions based on Biden's insistence on proportionality. \"We listen to the opinions of the United States, but we will make our final decisions based on our national interest.\""}, {"source": "foxnews", "title": "Biden-Harris admin warns Israel over Gaza humanitarian aid, leaked letter reveals", "link": "https://www.foxnews.com/politics/biden-harris-admin-warns-israel-over-gaza-humanitarian-aid-leaked-letter-reveals", "content": "Former Missile Defense Agency director Vice Admiral James Syring reacts to Biden sending a missile defense system to Israel on 'The Story.'\nU.S. Secretary of State Antony Blinken and Secretary of Defense Lloyd Austin sent a letter to Israel demanding it improve thehumanitarian situation in Gazaor risk losing crucial security assistance.\nThe letter was supposed to be a private, diplomatic communication and was not intended for the public, State Department spokesperson Matt Miller said at a press conference Tuesday.\n\"What we have seen over the past few months is that the level ofhumanitarian assistancehas not been sustained,\" adding, \"Ultimately, we did not see our concerns sufficiently addressed, which is why the two secretaries sent the letter they did,\" Miller warned.\nISRAELI MILITARY KILLS 250 HEZBOLLAH TERRORISTS SINCE START OF LIMITED GROUND OPERATION IN LEBANON\nNational Security Council spokesperson John Kirby tried to assuage fears and told reporters that the letter was not meant as a threat. \"The letter was simply meant to reiterate the sense of urgency we feel and the seriousness with which we feel about the need for an increase, dramatic increase in humanitarian assistance. And that's what you can do with your friend. That's what you can do with your ally. And it's not the first time we've communicated that to Israel. But hopefully we won't have to communicate it again.\"\nSome critics took issue with the letter not being a threat.\nSecretary of State Antony J. Blinken meets with Israeli Prime Minister Benjamin Netanyahu in Jerusalem, Aug. 19, 2024.(Office of the Prime Minister)\n\"I’m not sure which is worse to consider, that threatening an ally is a necessary pre-election political theater to pacify radical pro-Hamas leftists or that it’s actually U.S. policy to cut off arms to Israel if Israel doesn’t agree to feed, fuel and fund Hamas,\" Richard Goldberg, a senior adviser at the Foundation for Defense of Democracies and former NSC official in the Trump administration, told Fox News Digital.\n\"Because let’s be clear, that’s what this is really all about – whether Hamas survives by controlling humanitarian aid and its distribution,\" Goldberg said.\nThe letter, which wasfirst obtained by Axios, expressed its \"deep concern over the deteriorating humanitarian situation in Gaza\" and is particularly concerned that recent actions by the Israeli government, including halting commercial imports and denying or impeding nearly 90% of humanitarian movements between northern and southern Gaza in September, are \"contributing to an accelerated deterioration in the conditions in Gaza.\"\nYAZIDI WOMAN HELD HOSTAGE FOR 10 YEARS IN GAZA RESCUED IN ISRAEL, US OPERATION\nSince assurances made by Israel last spring, which the letter acknowledges produced important improvements in the humanitarian situation, the amount ofaid delivered to Gazahas dropped by 50% in September, the lowest amount of aid delivered in any month since the war began.\nDefense Secretary Lloyd Austin and Israeli Defense Minister Yoav Gallant at the Pentagon, June 25, 2024.(AP Photo/Susan Walsh)\nThe letter says Israel has within 30 days to \"reverse the downward humanitarian trajectory\" and remain consistent with its obligations to the U.S. Failure to comply with these demands, the letter said, would violate existing U.S. law and have serious implications for U.S. national security policy.\nIsrael has defended its humanitarian response to the crisis in Gaza in a statement released on Monday by COGAT, the army division that deals with aid to Gaza, stating, \"Since the start of the war, Israel has allowed the international community to bring 54,270 aid trucks into Gaza, carrying 1,064,820 tons of humanitarian aid through various crossings, including 38,746 trucks carrying approximately 824,078 tons of food.\"\nKIRBY: 'NO USE IN RESPONDING' TO A 'HANDFUL OF VETS' ON BIDEN'S BOTCHED AFGHAN WITHDRAWAL\nHaifa, Israel, under missile fire from southern Lebanon on Sept. 30, 2024.(Mostafa Alkharouf/Anadolu via Getty Images)\nThe U.S. must continually assess the delivery of humanitarian aid under the Foreign Assistance Act in order to provide foreign military financing assistance to Israel. President Biden issued a memorandum in February stating countries receivingU.S. weaponsmust adhere to international humanitarian law and provide written assurances of their compliance under the laws of war.\nThe U.S. has surged billions of dollars in security aid to Israel since the Hamas terrorist attack on Oct. 7, 2023. Israel is also the largest recipient of U.S. foreign aid since its founding and has received around $310 billion in economic and military aid. On average, the U.S. provides Israel with over $3 billion in security assistance a year.\nNETANYAHU HITS BIDEN ADMIN, SAYS ISRAEL – NOT US – WILL DECIDE HOW TO HANDLE IRAN\nA major component of security aid includes $500 million a year for joint U.S.-Israeli missile defense programs, notably the Iron Dome, David’s Sling and Arrow II, which have been critical to thwarting rocket and missile attacks from Hamas, Hezbollah and Iran since Oct. 7.\nSome of the military aid to Israel since Oct. 7 includes 13,981 120mm M830A1 high-explosive anti-tank multi-purpose with tracer (MPAT) tank cartridges, 500 aircraft deliveries and 107 sea shipments to Israel of over 50,000 tons of munitions and weapons systems, according to the Congressional Research Service.\nShelter tents erected near collapsed buildings in the Bureij camp for Palestinian refugees in the central Gaza Strip on Oct. 1, 2024.(Eyad Baba/AFP via Getty Images)\nThe U.S. also announced that it would be sending military personnel and initial components necessary to operate theTerminal High-Altitude Area Defense (THAAD)battery to Israel to bolster the country’s security.\nCLICK HERE TO GET THE FOX NEWS APP\n\"The deployment of the THAAD battery to Israel underscores the United States’ commitment to the defense of Israel and to defend Americans in Israel from any ballistic missile attacks by Iran,\" the Pentagon press secretary, Maj. Gen. Pat Ryder, said in a statement.\nAccording to the Hamas-run Gaza Ministry of Health, over 40,000 people have been killed since the start of hostilities following the terror group's massacre of Israelis last October. Some 1,200 Israelis were massacred and 257 were kidnapped and held hostage by Hamas in Gaza. All of Gaza’s 2.1 million people are in need of urgent humanitarian assistance and 1.9 million people are internally displaced, according to the International Rescue Committee."}, {"source": "foxnews", "title": "Netanyahu tells Macron that Israel was not created by the UN, but by 'blood of our heroic fighters'", "link": "https://www.foxnews.com/us/netanyahu-tells-macron-israel-not-created-un-blood-our-heroic-fighters", "content": "Israeli Prime Minister Benjamin Netanyahu on Saturday called French President Emmanuel Macron and other Western leaders who support an arms embargo on Israel over Gaza a \"disgrace.\" (Credit: Government Press Office Israel)\nIsraeli Prime MinisterBenjamin Netanyahuon Tuesday took umbrage at remarks made by French President Emmanuel Macron, in which he stated that Israel was created by the United Nations.\nMacron was speaking to his cabinet when he said, \"Mr Netanyahu must not forget that his country was created by a decision of the U.N.,\" referring to the resolution adopted by the United Nations General Assembly in 1947 to partition Britain's Palestinian mandate into separate Jewish and Arab states.\n\"Therefore, this is not the time to disregard the decisions of the U.N.,\" he added.\nIDF MEETS LITTLE RESISTANCE FROM HEZBOLLAH AFTER WEEKS OF HITTING TERROR TARGETS, OFFICIALS SAY\nIsraeli Prime Minister Benjamin Netanyahu on Tuesday reminded French President Emmanuel Macron about Israel's founding after he said Israel was created by the United Nations.(Reuters)\nIsrael accepted the partition plan while the Palestinians rejected it. Hours after declaring its independence on May 14, 1948, armies from the surrounding Arab countries attacked Israel, which won the war a year later.\n\"A reminder to the French President: It was not a UN decision that established the State of Israel but the victory that was achieved in theWar of Independencewith the blood of our heroic fighters, many of whom were Holocaust survivors, including from the Vichy regime in France,\" Netanyahu read from a statement in response to Macron's comment.\nMacron's remarks came as he called for an end to arms exports to the Gaza Strip and Lebanon in an effort to create conditions for a cease-fire.\nThe call for an arms embargo comes amid Israel's war with Hamas in Gaza following the terror group's unprovoked attack on Oct. 7, 2023, and its military operations in Lebanon, following a year of rocket fire from Hezbollah, which is backedby Iran.\nEarlier this month, Netanyahu criticized Macron and other Western leaders for calls to stop the flow of arms.\nAMERICAN FATHER OF HAMAS HOSTAGE ITAY CHEN PUSHES US, ISRAEL ON ‘PLAN B’ AS NEGOTIATIONS FALTER\nIsraeli forces during the Arab-Israeli war, Oct. 1, 1948.(Pictures from History/Universal Images Group via Getty Images)\n\"As Israel fights the forces of barbarism led by Iran, all civilized countries should be standing firmly by Israel’s side, yet President Macron and other western leaders are now calling for arms embargoes against Israel. Shame on them,\"Netanyahu saidin a statement.\nHe continued, \"Is Iran imposing an arms embargoon Hezbollah, on the Houthis, on Hamas and on its other proxies? Of course not. This axis of terror stands together, but countries who supposedly oppose this terror axis call for an arms embargo on Israel.\"\nHe called their stance a \"disgrace,\" saying that Israel would win \"with or without their support, but their shame will continue long after the war is won.\"\nOn Oct. 6, Macron said France would no longer supply arms to Israel, although it would continue to send missile defense equipment.\nPalestinians take control of an Israeli battle tank after crossing the border fence with Israel from Khan Yunis in the southern Gaza Strip on Oct. 7, 2023.(Getty Images)\nCLICK HERE TO GET THE FOX NEWS APP\n\"I think that today, the priority is that we return to a political solution, that we stop delivering weapons to fight in Gaza,\" Macron said in an interview, according toEuro News.\nLouis Casiano is a reporter for Fox News Digital. Story tips can be sent tolouis.casiano@fox.com."}, {"source": "foxnews", "title": "CNN anchor and Rep. Waltz clash over Harris ‘socialist’ label, networks likening Trump to Hitler", "link": "https://www.foxnews.com/media/cnn-anchor-rep-waltz-clash-harris-socialist-networks-trump-hitler", "content": "CNN anchor John Berman and Rep. Mike Waltz, R-Fla., debated loaded terms like ‘fascist’ and ‘socialist’ that have been used to describe the two presidential candidates.\nCNN anchor John Berman andRep. Mike Waltz, R-Fla., got into a tense exchange Tuesday morning over politically charged terms like \"fascist\" and \"socialist\" that have been used to describe the two presidential candidates.\nAt a recent rally in Erie, Pennsylvania, Vice President Kamala Harris played a mashup of clips in which Trump warned ofdangers from \"the enemy within.\"\n\"The worst people are the enemies from within... those people are more dangerous; the enemy within; than Russia and China. These people should be put in jail the way they talk about our judges and our justices,\" Trump collectively stated in some of the television clips played.\nIn recent comments on the matter toFox Business'Maria Bartiromo, Trump spoke about such \"enemies,\" and quipped that while China and Russia are \"dangerous\" at times to deal with, \"the thing that's tougher to handle are these lunatics that we have inside like Adam Schiff.\"\nMAHER SAYS HE'S NOT WORRIED ABOUT 'CRAZY' TRUMP WINNING ELECTION: ‘NOT EVEN NERVOUS'\nDemocratic presidential nominee, Vice President Kamala Harris speaks during a campaign rally at the Williams Arena at Minges Coliseum on the campus of East Carolina University on October 13, 2024, in Greenville, North Carolina.(Alex Wong/Getty Images)\nSchiff, a congressman from Burbank, Calif., is currently the Democratic nominee for U.S. Senate against Republican retired MLB star Steve Garvey.\nDuring an interview on \"CNN News Central,\" Berman asked Waltz whether it was \"responsible\" for Trump to make such comments.\nWaltz claimed that Trump was talking about issues that are \"detrimental\" to democracy in the United States and undermine public trust in institutions. For example, he claimed that Schiff, a senior House Intelligence Committee member, leaked information from compartmented hearings and lied to the public in open hearings.\nBerman then referenced the \"lunatic\" comment directed at Schiff and suggested that Trump was also talking about dealing with \"lunatics\" in a hypothetical military deployment.\n\"John, people were on this network calling Trump Hitler and the next coming of another dictator and two people have tried to kill him. We have the Iranians trying to kill him. A foreign adversary trying to assassinate him and we're talking about him playing music in a rally,\" Waltz said.\nBerman acknowledged that while it is essential to talk about heated rhetoric directed at Trump, Waltz himself has suggested that Harris is a \"socialist.\"\nAS A CAUTIOUS KAMALA LOSES MOMENTUM, DEMOCRATS ARE PANICKING OVER A TRUMP WIN\nCNN's John Berman and Rep. Mike Waltz, R-Fla., sat down on \"CNN News Central\" to discuss former President Donald Trump's \"enemy from within\" comments.(CNN/Screenshot)\n\"So, these phrases do get tossed around,\" Berman added.\nWaltz said that socialism is a \"longstanding political ideology\" and very different from claiming that Trump would be \"the world's most god-awful dictator\" and Hitler. Waltz also contended that such language is radicalizing people to take action.\nHe also noted that some members of Congress have referred to themselves as \"democratic socialists\" and insisted that Berman was not making a \"fair comparison.\"\n\"You don't?\" Berman asked. \"You talk about Marxism. You talk about socialism. And do you think Kamala Harris is a Marxist or a socialist?\"\nCLICK HERE TO GET THE FOX NEWS APP\nWaltz said that he believes Marxism is \"underpinning\" some of Harris' policies, such as price controls.\nBerman then tried to draw a comparison between Waltz's comments about Harris andretired Gen. Mark Milley'sremarks about Trump.\nMilley reportedly said, \"No one has ever been as dangerous to this country as Donald Trump… Now I realize he's a total fascist. He is the most dangerous person to this country,\" according to a new book by journalist Bob Woodward.\n\"He's saying that Donald Trump espouses fascist policies,\" Berman said. \"It's a political ideology. Fascism is a political ideology.\"\nNikolas Lanum is an associate editor for Fox News Digital."}, {"source": "foxnews", "title": "GOP senator warns thousands have been 'rushed' into US after Afghanistan withdrawal: 'Weren't properly vetted'", "link": "https://www.foxnews.com/media/gop-senator-warns-thousands-have-been-rushed-us-after-afghanistan-withdrawal-werent-properly-vetted", "content": "Sen. Markwayne Mullin, R-Okla., shares new details about an Afghanistan national allegedly tied to an Election Day terror plot and discusses his swing state tour.\nLawmakers are raising new concerns about potential terror threats after the arrest of an Afghan national accused of planningan Election Dayattack. On\"Fox & Friends\"Tuesday, Sen. Markwayne Mullin, R-Okla., raised concerns about the vetting process for foreign nationals, warning \"thousands\" of individuals were \"rushed\" over in the wake of the Biden-Harris administration's botched Afghanistan withdrawal.\nAFGHAN CHARGED WITH ELECTION DAY TERROR PLOT RAISES QUESTIONS, FEARS FROM LAWMAKERS: ‘THIS IS REAL’\nSEN. MARKWAYNE MULLIN:I was briefed a few weeks prior to this, not by the FBI, but from a different agency. What we understood is this individual was vulnerable to touch points, meaning that they were accepted in on an SIV, special immigration visa, but there's confusion if he was prior or after the withdrawal. We believe that he was rushed with an SIV after the disastrouswithdrawal from Afghanistan,and it wasn't proper vetting to actually say he was an SIV. The issue that we have here is there's thousands of individuals that [were] rushed over here because of the Harris-Biden withdrawal, and they weren't properly vetted. And when you don't probably vet them, you don't know what their touch points – touch points mean their vulnerabilities –  vulnerabilities mean what can be leveraged against the individual to make them turn on their host country like this individual did. Fortunately, the FBI was doing their job. They did it correctly that no one was actually at harm, but they caught the individual.How many individuals are out therethat we're not paying attention to?\nNasir Ahmad Tawhedi is seen making the \"Tawhid\" gesture in a photo taken.(Department of Justice)\nAuthorities announced last week the arrest ofNasir Ahmad Tawhedi, an Afghan nationalwho came to the U.S. in 2021 after the withdrawal from Afghanistan. Tawhedi is charged with conspiring and attempting to provide material support to ISIS and receiving a firearm to be used to commit a felony or a federal crime of terrorism.\nAuthorities say he liquidated his family's assets to finance his plan, including purchasing rifles and one-way tickets for his wife and child back to Afghanistan.\n\"This defendant, motivated by ISIS, allegedly conspired to commit a violent attack, on Election Day, here on our homeland,\" said FBI Director Christopher Wray in a statement.\nCLICK HERE TO GET THE FOX NEWS APP\nCourt filings initially stated that he came on a special immigrant visa but have since clarified that he came to the U.S. via humanitarian parole and later applied for SIV status.\nA senior administration officialtold Fox News last week that Tawhedi was screened three times. He was screened first to work security for the CIA in Afghanistan, then for humanitarian parole to enter the U.S. in 2021, when he was vetted and screened in a third country, and then for special immigrant status, for which he was approved. His status has not yet been finalized. Officials believe he was radicalized after coming to the U.S.\nFox News' Adam Shaw and Chad Pergram contributed to this report.\nThis article was written by Fox News staff."}, {"source": "foxnews", "title": "'The View' host admits Kamala Harris needs 'concrete examples' of how she will differ from President Biden", "link": "https://www.foxnews.com/media/the-view-host-admits-kamala-harris-needs-concrete-examples-how-differ-president-biden", "content": "CNN political commentator and \"The View\" co-host Ana Navarro said Tuesday that Kamala Harris needed \"concrete\" examples of how she is different from President Biden.\n\"The View\" co-host Ana Navarro, also a CNN political commentator, said Tuesday during an appearance on CNN that Vice President Kamala Harris needed to find some \"concrete examples\" of how she will differ from President Biden.\nCNN host Kate Bouldan asked Navarro, a rabid supporter of Harris who has called her \"Auntie Kamala,\" how Harris should thread the needle, citing a voter who told CNN that while she's not against voting for the VP, she doesn't know how Harris differs from the president.\nNavarro defended Harrisduring \"The View\" on Monday and said she was \"loyal,\" and therefore would never throw Biden under the bus. She added on Monday, \"if you think an 81-year-old man from Delaware, White man, is going to lead the same way as a 60-year-old child of immigrants, South Asian Black woman from Oakland, you are on something.\"\nShe echoed the same point on CNN during her Tuesday appearance and said Harris needed to lean into who she is, adding, \"She needs to find a few more examples, concrete examples, because people want to hear concrete examples.\"\nTRUMP, HARRIS LOCKED IN DEAD HEAT IN 7 BATTLEGROUND STATES, POLL FINDS: ‘COULD NOT BE CLOSER’\n\"The View\" host and CNN political commentator Ana Navarro said Tuesday that Kamala Harris needed some concrete examples of how she's different from Biden.(Screenshot/CNN)\nDuring \"The View\" last Tuesday, the co-hosts asked Harris if there was anything she would have donedifferently from Bidenover the last three years, in addition to how she plans to be different from the president if she wins in November.\n\"Not a thing comes to mind,\" Harris responded to the first question.\n\"We're obviously two different people,\" Harris said, answering a question about the biggest \"specific\" difference between a potential Harris presidency and a Biden presidency. \"One of the issues I'm focused on is what we do with home healthcare.\"\nLater on during their interview, Harris said one difference between her and Biden was that she plans to have a Republican in her cabinet.\nHarris told the co-hosts of \"The View\" that she was a part of the decisions in the Biden administration that had an \"impact.\" She touted the administration's policies in capping the cost of insulin and said she cared about the issue deeply.\n\"Allowing Medicare to negotiate drug prices and bring the cost of prescription medication down for seniors, but my intention is to expand that for all Americans,\" she added.\nCLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE\nNavarro, a \"Never Trump\" Republican who has openly supported Democrats since 2016,hosted the second nightof the Democratic National Convention.\nCLICK HERE TO GET THE FOX NEWS APP\nHanna Panreck is an associate editor at Fox News."}, {"source": "foxnews", "title": "Netanyahu hits Biden admin, says Israel – not US – will decide how to handle Iran", "link": "https://www.foxnews.com/politics/netanyahu-hits-biden-admin-says-israel-not-us-will-decide-how-handle-iran", "content": "Ret. Gen. Joseph Votel has the latest on the Israel-Hamas war on 'Your World.'\nIsraeli Prime Minister Benjamin Netanyahu took a swipe at President Biden's administration Tuesday, stating firmly that Israel – not the U.S. – will decide how best to retaliate against Iran's recent aggression.\nBidenadministrationofficials have urged Israel to show restraint against both Iran and Hezbollah, the terrorist proxy group operating in Lebanon. Netanyahu's regime has mulled action against Iran since it fired roughly 200 missiles into Israeli territory on Oct. 1.\n\"We listen to the opinions of the United States, but we will make our final decisions based on our national interest,\"Netanyahu saidin a statement.\nNetanyahu issued the statement following a report from the Washington Post claiming that the Biden White House was confident that Netanyahu was in a \"more moderate place\" now than in recent weeks.\nIDF MEETS LITTLE RESISTANCE FROM HEZBOLLAH AFTER WEEKS OF HITTING TERROR TARGETS, OFFICIALS SAY\nIsraeli Prime Minister Benjamin Netanyahu says Israel will take U.S. concerns into consideration, but will ultimately make his own decisions.(OHAD ZWIGENBERG/POOL/AFP via Getty Images)\nWhite House officials say Israel has assured the U.S. that it will not target Iran's oil or nuclear facilities, however. That agreement came after Biden and Netanyahu held a phone call last week and Defense Secretary Lloyd Austin met with Israeli officials this week, according to the Wall Street Journal.\nWhite House national security adviserJakeSullivanreportedly told Israeli officials earlier this month that the U.S. expects \"clarity and transparency\" about Israel's plans, specifically regarding any retaliation against Iran for the latest missile attack.\nAMERICAN FATHER OF HAMAS HOSTAGE ITAY CHEN PUSHES US, ISRAEL ON ‘PLAN B’ AS NEGOTIATIONS FALTER\nA map of known Iranian nuclear sites.\nVice PresidentKamala Harris also wouldn't saywhether she thought the administration had influence over Netanyahu in an interview last week.\nNevertheless,Biden approved the Pentagonto send an advanced missile defense system to Israel this week, along with roughly 100 U.S. soldiers to operate it.\nTerminal High-Altitude Area Defense (THAAD) has previously been deployed to Israel in 2019, but only for an exercise, Pentagon officials say. The system helps bolster Israel's defense against more sophisticated missiles in Iran's arsenal.\nThe THAAD system is shown here being loaded onto a 4th Airlift Squadron C-17 Globemaster III at Fort Bliss, Texas, in February 2019.(Staff Sgt. Cory D. Payne/U.S. Air Force/AP)\nCLICK HERE TO GET THE FOX NEWS APP\n\"The THAAD Battery will augment Israel’s integrated air defense system. This action underscores the United States’ ironclad commitment to the defense of Israel, and to defend Americans in Israel, from any further ballistic missile attacks by Iran. It is part of the broader adjustments the U.S. military has made in recent months, to support the defense of Israel and protect Americans from attacks by Iran and Iranian-aligned militias,\" the Pentagon said in a statement.\nAnders Hagstrom is a reporter with Fox News Digital covering national politics and major breaking news events. Send tips to Anders.Hagstrom@Fox.com, or on Twitter: @Hagstrom_Anders."}, {"source": "foxnews", "title": "Detroit pastor 'offended' by Kamala Harris' strategy to woo Black male voters: 'We're not political infants'", "link": "https://www.foxnews.com/media/detroit-pastor-offended-kamala-harris-strategy-woo-black-male-voters-were-not-political-infants", "content": "Pastor Lorenzo Sewell joined 'Fox & Friends' to discuss why he is so offended about Harris' town hall in Detroit with Charlamagne tha God and top concerns for Black voters ahead of Election Day.\nA Detroit pastor accused Vice President Kamala Harris of \"exploiting\" the Black vote as she prepares for an event with podcaster Charlamagne tha God in a bid to shore up support with Black males.\nPastor Lorenzo Sewell, who leads 180 Church in Detroit, detailed why he is \"offended\" by Harris' decisionduring \"Fox & Friends.\"\nHERSCHEL WALKER SAYS OBAMA ‘FORGOT OUR FIGHT FOR RIGHT TO VOTE’ AFTER SCOLDING BLACK VOTERS AGAINST HARRIS\n\"I have never been so offended in my life,\" Sewell told Lawrence Jones on Tuesday. \"She's bringing a man here who is Charlamagne, a false god, to a community that has 4,500 churches, all people of faith. We are extremely offended that she's bringing a podcaster here to talk to Black men about politics. She brought a retired athlete to Flint who is failing –  Magic Johnson – and she brought Oprah to Oakland County, as if she understands the plight and the playing of people that look like me.\"\n\"We will not allow virtue signaling. We will not allow identity politics. Black men are not political infants,\" he continued. \"We know exactly what's happening with the Democratic Party. We know that they've exploited us for over six decades, and we are saying, just like Moses said to Pharaoh, ‘Let my people go.’\"\nVice President Kamala Harris will sit down with Charlamagne tha God in Detroit, Michigan, Tuesday.(Getty Images)\nHarris dismissed pollingthis week that indicates she has lost support with Black men during a 23-minute sit-down with Black-focused entertainment outlet \"The Shade Room.\"\nShe was asked about polls indicating that the Democrats' advantage with Black voters has declined from past presidential cycles, and among Black men in particular.\n\"When you hear those numbers, and you're seeing in the polls — Black men aren't as excited or fired up for you, how do you respond to that?\" host Justin Carter asked Harris.\nThe VP immediately dismissed the polls and suggested that things could change in the next three weeks before the November election. \"One, that's not my experience,\" Harris responded. \"Two, Election Day has not arrived yet.\"\nCNN DATA REPORTER PREDICTS TRUMP WILL WIN ‘HISTORIC’ NUMBER OF BLACK AND HISPANIC VOTERS\nHarris went on to say that she is not taking these voters for granted and is working to earn their support.\n\"Black men are no different from anybody else. They expect that you have to earn their vote. And that's why I'm out here,\" she continued.\n\"It's incumbent on me to earn their support, that’s why I’m talking to folks about the work I’ve done in my career,\" she said, citing her efforts to help strengthen small businesses and pledging to continue to do so if elected as president.\nAccording to aNew York Times/Siena College pollreleased on Saturday, Harris currently holds 78% of the Black vote, which is down from 2020, when President Biden won approximately 90% of that voting bloc. It's also down from 2016, when Hillary Clinton won approximately 92% of the Black vote. Harris' support among Black men has dropped even more significantly, according to the report: 70% said they would vote for Harris in November, down from Biden’s 85% in 2020.\n\"She continues to think that she can entertain her way to the Black vote,\" Sewell said. \"We're offended, and we want her to be willing to actually bring real solutions to the complex problems that we're facing in urban America.\"\nMeanwhile, Harris rolled out her \"Opportunity Agenda for Black Men\" this week, which includes providing 1 million loans that are fully forgivable to Black entrepreneurs and others to start a business, championing education, training and mentorship programs that help Black men get good-paying jobs in high-demand industries and lead their communities, including pathways to become teachers.\nFox News' Kristine Parks, Nikolas Lanum and Paul Steinhauser contributed to this report.\nCLICK HERE TO GET THE FOX NEWS APP\nBailee Hill is an associate editor with Fox News Digital. Story ideas can be sent to bailee.hill@fox.com"}, {"source": "foxnews", "title": "Trump says 'I don't care when you vote' in new House GOP ad urging voters to turn out early", "link": "https://www.foxnews.com/politics/trump-says-i-dont-care-when-you-vote-new-house-gop-ad-urging-voters-turn-out-early", "content": "Georgia Republican Party Chairman Josh McKoon spoke with Fox News Digital about the race to flip the Peach State back to red in this year's presidential election.\nFIRST ON FOX:A dramatic, months-longcampaign seasonis drawing to a close as the clock ticks closer to Election Day, according to a new message from House Republicans to voters.\nThe National Republican Congressional Committee (NRCC), the House GOP’s campaign arm, released a new digital ad on Tuesday marking 21 days until the election.\nIt comes as Republican Party operators at the state, federal and local level work overtime to convince supporters to vote early, particularly in pivotal swing states like Georgia and North Carolina that have been ravaged by Helene this storm season.\nCLUB FOR GROWTH POURS $5M INTO TIGHT HOUSE RACES AS GOP BRACES FOR TOUGH ELECTION\nRepublicans are working overtime to turn voters out early in former President Trump's race to beat Vice President Harris.(Getty Images)\nThe ad features audio clips from the entire House GOP leadership suite – Speaker Mike Johnson, Majority Leader Steve Scalise, Majority Whip Tom Emmer, House GOP Conference Chairwoman Elise Stefanik and NRCC Chairman Richard Hudson – as well asformer President Trump.\nTrump’s voice opens the video with, \"Republicans must win, and we must use every appropriate tool available to beat the Democrats. They are destroying our country.\"\n\"I don’t care when you vote, but you’ve got to vote,\" Trump says in the video.\nMeanwhile, clips of vulnerable Republicans, like Rep. Jen Kiggans, R-Va., and Ken Calvert, R-Calif., flash across the screen interspersed with the word \"vote.\"\nGEORGIA GOP CHAIR SHARES 2-PRONGED ELECTION STRATEGY AS TRUMP WORKS TO WIN BACK PEACH STATE\nThe ad features vulnerable Republicans like Rep. Jen Kiggans.(Win McNamee/Getty Images)\nIt’s set against a portion of \"Dream On\" by Aerosmith, per an airing viewed by Fox News Digital.\n\"In 21 days, Americans will cast their ballots to end Democrats’ dangerous, far-left socialist agenda for our country. Every trip to the grocery store, fentanyl death or crime committed in a family’s neighborhood should give voters another reason to record their vote in this critical election,\" NRCC rapid response director Macy Gardner told Fox News Digital.\nEarly in-person voting is kicking off in four states this week. Georgia can head to the polls before Election Day from Tuesday through Nov. 1, while North Carolina begins early voting on Thursday. Voters in Iowa and Kansas are also heading to the polls.\nRepublican Party officials have been working overtime to convince their base to vote earlyafter Democratswalloped the GOP with non-Election Day voters in 2020.\nSPEAKER JOHNSON RIPS ‘LACK OF LEADERSHIP’ IN BIDEN ADMIN'S HELENE RESPONSE: 'ALARMED AND DISAPPOINTED'\nPresident Biden's 2020 victory was due in no small part to non-Election Day voters.(Aaron Schwartz/Sipa/Bloomberg via Getty Images)\nThose efforts will be particularly critical in North Carolina and Georgia, both states hit hard by Hurricane Helene and where the election is expected to be close.\nCLICK HERE TO GET THE FOX NEWS APP\nGetting likely voters to head to the polls early, Georgia GOP Chairman Josh McKoon explained early this month, frees up resources closer to Election Day to convince \"low propensity voters\" to turn out as well.\n\"All of that requires resources. That requires money – put mail in the mailbox, ads on television, telephone calls to their home, knocking on their door. We’re trying to do all of those things,\" McKoon told Fox News Digital.\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com"}, {"source": "foxnews", "title": "Nancy Pelosi admits she still hasn't spoken to President Biden after pressuring him to drop out of the race", "link": "https://www.foxnews.com/media/nancy-pelosi-admits-still-hasnt-spoken-president-biden-pressuring-drop-out-race", "content": "Former House Speaker Nancy Pelosi praises President Biden’s work in office during the Democratic National Convention in Chicago.\nFormer House Speaker Nancy Pelosi revealed in a new interview that she still has not spoken to President Biden after being part of the Democratic pressure campaign for him to drop out of the race.\n\"Not since then, no,\" she toldThe Guardian's Politics Weekly America podcastwhen asked if she's spoken to the president. \"But I’m prayerful about it.\"\nPelosi denies being part of any pressure campaign against the president, but Biden has said thatpressure from his colleaguesled to his decision.\n\"I have the greatest respect for him. I think he’s one of the great consequential presidents of our country,\" Pelosi said in the interview posted Tuesday. \"I think his legacy had to be protected. I didn’t see that happening in the course that it was on, the election was on. My call was just to: ‘Let’s get on a better course.’ He will make the decision as to what that is. And he made that decision. But I think he has some unease because we’ve been friends for decades.\"\nPELOSI DEMURS ON IF ‘EVERYTHING IS OK’ BETWEEN HER AND BIDEN: ‘YOU’D HAVE TO ASK HIM'\nFormer House Speaker Nancy Pelosi revealed during a recent podcast that she still hasn't spoken to President Biden since he dropped out of the 2024 race.(Getty Images)\nThe former House Speaker also admitted that some in the president's corner might not have forgiven her for the role she played, but argued that a Trump victory might have been worse.\n\"You decide to win. I decided a while ago that Donald Trump will never set foot in the White House again as President of the United States or in any other capacity … So when you make a decision, you have to make every decision in favor of winning, and that is mobilization, message, money, to have that to win the election, but the most important decision of all is the candidate and the campaign of the candidate,\" she added, according to the Guardian.\nThe Guardian pressed, \"and you just felt he couldn't win?\"\n\"No, I thought his, the campaign that they were on couldn't win, he might have won, but they had to change what was happening, and he decided that change would be his stepping aside,\" she said.\nCLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE\nVice President Kamala Harris replaced President Biden as the Democratic Party's 2024 candidate in July.(Saul Loeb/AFP via Getty Images)\nPelosi was oneof several Democrats, including Senate Majority Leader Chuck Schumer, D-N.Y., who reportedly called on Biden to step down following a disastrous debate performance in June.\nAfter Biden told his Democratic colleagues he was going to remain in the race,Pelosi joined the hostsof MSNBC's \"Morning Joe,\" one of the president's favorite news programs, and suggested it wasn't a final decision.\n\"It's up to the president to decide if he is going to run. We are all encouraging him to make that decision, because time is running short,\" Pelosi told MSNBC on July 10, when asked if she would be supporting his bid for re-election.\nCLICK HERE TO GET THE FOX NEWS APP\nThe interview is viewed as a turning point in the movement to drop Biden, given Pelosi's stature in the party. Less than two weeks later, Biden was out of the race.\nHanna Panreck is an associate editor at Fox News."}, {"source": "foxnews", "title": "Charlamagne tha God says young Black man predicted Trump's podcast appearance will get him elected", "link": "https://www.foxnews.com/media/charlamagne-tha-god-says-young-black-man-predicted-trumps-podcast-appearance-get-him-elected", "content": "'Shark Tank' investor Kevin O’Leary analyzes the success of former President Trump’s interview with Logan Paul on ‘Jesse Watters Primetime.’\nCharlamagne Tha God revealed on Friday that an anonymous source told him that former President Trump's appearance on a recent podcast was going to get him elected.\nA key component of Trump’s media strategy this election has been doing interviews on podcasts to appeal to young male voters. One appearance that made numerous headlines wasTrump’s interview on the \"Flagrant\" podcast,hosted by comedian Andrew Schulz, last week.\n\"Breakfast Club\" radio show co-host Charlamagne spoke candidly with Schulz afterward on their shared \"Brilliant Idiots\" podcast, saying he heard one response so significant he had to keep the person’s name secret.\n\"A young, Black man, 20-something years old, I’m not gonna say his name. I should say his name… He comes to me this morning, he turns to me, he goes, ‘Flagrant is gonna get Trump elected,’\" Charlamagne said.\nTRUMP CALLS FOR CBS TO LOSE ITS BROADCASTING LICENSE AMID ‘60 MINUTES’ CONTROVERSY: ‘UNPRECEDENTED SCANDAL!’\nRadio host Charlamagne Tha God spoke to Andrew Schulz on \"The Brilliant Idiots\" podcast, telling him that an anonymous source argued his interview with former President Trump was so good it already decided the election.((Photo by Marcus Ingram/Getty Images))\nSchulz burst out laughing, \"The interview was fire, bro, I don’t know what to tell you.\"\nCharlamagne and Schulz went on to discuss how Trump’s off-the-cuff humor is a stark contrast with Vice President Kamala Harris, who Schulz argued is afraid of losing the advantage she believes she has.\n\"There’s nothing about the poll numbers that we’re seeing right now that should make anybody feel like she’s got this,\" Charlamagne said, and when acomparison was made to Hillary in 2016he replied, \"I keep telling people this campaign feels more Hillary-ish than it does Obama-ish- than Obama ’08-ish.\"\nDuring the interview on \"Flagrant,\" Trump had the hosts in stitches numerous times with his irreverent humor, such as when he joked that Biden has one advantage over him.\n\"He has one ability that I don't have — he sleeps,\" Trump said. \"He can sleep! This guy goes on a beach, and he lays down on one of those 6-ounce [chairs]. They weigh 6 ounces, and he can’t lift it. They're meant for children, young people, and old people to lift. They’re aluminum, you know, hollow aluminum, they weigh very little, and he can't lift.\"\nHe later went on to joke, \"Somebody convinced him helooks good in a bathing suit,and when you’re 82, typically bathing suits aren’t gonna make you look great.\"\nIN ARIZONA SPEECH, VANCE SAYS NEXT PRESIDENT MUST PUT AMERICANS FIRST, SLAMS FEMA MONEY FOR MIGRANTS\nFormer President Trump recently appeared on comedian Andrew Schulz’s \"Flagrant\" podcast.(Flagrant YouTube channel)\nOn The Breakfast Club, Charlamagne recently critiqued the Harris-Walz campaign’s messaging tactics, arguing that their commentary about global politics seems \"very out of touch to what’s going on right here in America.\"\nThis, he said, is a stark difference from Trump and his running-mate JD Vance, who are \"talking about what’s happening here at home and saying things like‘America First’and ‘Make America Great Again,’ that messaging sometimes resonates a lot more.\"\nHe then corrected himself and said, \"Not sometimes, it does resonate a lot more.\"\nCLICK HERE TO GET THE FOX NEWS APP\nAlexander Hall is an associate editor for Fox News Digital. Story tips can be sent to Alexander.hall@fox.com."}, {"source": "foxnews", "title": "Voter beware: Text scam targets you, no matter where you live", "link": "https://www.foxnews.com/tech/voter-beware-text-scam-targets-you-no-matter-where-you-live", "content": "Kurt Knutsson gives Android users some tips to stem the tide of annoying text messages from political campaigns.\nAs Election Day approaches, scammers are finding new ways to deceive voters. Several media reports are highlighting a new scam where people receive a text message falsely claiming they are not yet registered to vote. Election officials are warning Americans to be cautious of these scam messages, as more are expected to circulate in the weeks leading up to the general election.\nGET SECURITY ALERTS, EXPERT TIPS – SIGN UP FOR KURT’S NEWSLETTER – THE CYBERGUY REPORT HERE\nVoting day image(Kurt \"CyberGuy\" Knutsson)\nThe local Channel 4 affiliate WDIV in Detroit warned about a new text message wave in late August that could prevent registered voters from casting their ballot. The Philadelphia Inquirer reported a similar incident around the same time, warning Pennsylvanians to be wary of potential scam text messages targeting voters.\nA spokesperson for the Department of State said voters should expect more of these messages to be sent in the weeks leading up to the general election.\n\"Voters should be aware that opportunistic bad actors may attempt to use this campaign season to send phishing or smishing emails/texts,\" Matt Heckel, a spokesperson for the department, told the Philadelphia Inquirer.\nBoth these reports and several others refer to a text message that is linked to the site all-vote.com: \"We have you in our records as not registered to vote. Check your registration status and register in 2 minutes.\"\nA woman voting(Kurt \"CyberGuy\" Knutsson)\nDON’T FALL PREY TO THIS ELECTION SEASON’S CRAFTIEST SCAMS\nFor one, the domain all-vote.com isn’t associated with the government. Another clue is that even people who were already registered to vote in their state received this message. WDIV even interviewed a seventh-grader from Canada who said he also got the text, despite not being eligible to vote.\nA quick search on Who.Is lookup shows the domain was registered on July 10, 2024, definitely a red flag.KrebsOnSecuritymentioned that some of these texts are also linking to another domain, votewin.org, which asks for your name, address, email, date of birth and phone number when you visit.\nThey even pre-check boxes to sign you up for more notifications. The government doesn’t need all that info from you. To register to vote or to update your voter registration, all you need to do is visitvote.govand select your state or region.\nVote buttons(Kurt \"CyberGuy\" Knutsson)\nFAKE SOFTWARE FIXES FUEL MONEY-STEALING MALWARE THREAT\n1) Unsolicited contact: If you receive a message from an unknown number or an unexpected source, especially one claiming urgency (like registering to vote), it could be a scam.\n2) Suspicious links: Scammers often use fake links that appear legitimate but redirect you to phishing websites. Always hover over links or check the domain carefully. In the case of \"all-vote.com,\" if it's not a well-known or official site (like .gov for U.S. voting), it's worth being suspicious.\n3) Grammatical errors: Many scam messages contain typos, awkward phrasing or grammatical mistakes. This can be a red flag for phishing or scam attempts.\n4) Requests for personal information: Legitimate organizations typically don’t ask for sensitive information like Social Security numbers, bank details or passwords via text. Scams often do.\n5) Have strong antivirus software:The best way to safeguard yourself from malicious texts, potentially accessing your private information, is to have antivirus software installed on all your devices. This protection can also alert you to phishing emails and ransomware scams, keeping your personal information and digital assets safe.Get my picks for the best 2024 antivirus protection winners for your Windows, Mac, Android and iOS devices.\nHOW TO STOP ANNOYING ROBOCALLS\nAs Election Day gets closer, it’s essential to stay alert to scams like these. If you receive a suspicious text about your voter registration, remember to check the details carefully. Look out for unofficial domains like all-vote.com or votewin.org, which have nothing to do with the government. Always head to trusted sites like vote.gov to confirm your status. Scammers are getting creative, but knowing the signs can help you avoid getting caught up in their traps.\nDo you think the government is doing enough to protect voters from scams like these? Let us know by writing us atCyberguy.com/Contact.\nCLICK HERE TO GET THE FOX NEWS APP\nFor more of my tech tips and security alerts, subscribe to my free CyberGuy Report Newsletter by heading toCyberguy.com/Newsletter.\nAsk Kurt a question or let us know what stories you'd like us to cover.\nFollow Kurt on his social channels:\nAnswers to the most asked CyberGuy questions:\nNew from Kurt:\nCopyright 2024 CyberGuy.com. All rights reserved.\nKurt \"CyberGuy\" Knutsson is an award-winning tech journalist who has a deep love of technology, gear and gadgets that make life better with his contributions for Fox News & FOX Business beginning mornings on \"FOX & Friends.\" Got a tech question? Get Kurt’s free CyberGuy Newsletter, share your voice, a story idea or comment atCyberGuy.com."}, {"source": "foxnews", "title": "'Squad' member calls Netanyahu a 'genocidal maniac,' sparking backlash from Israeli ambassador to the UN", "link": "https://www.foxnews.com/politics/squad-member-calls-netanyahu-genocidal-maniac-sparking-backlash-from-israeli-ambassador-un", "content": "Rep. Rashida Tlaib, D-Mich., holds up a sign with the words 'war criminal' on it during Israeli Prime Minister Benjamin Netanyahu's address to the United States Congress, July 24 2024.\nDemocrat 'Squad' member Rashida Tlaib is now callingIsraeli Prime Minister Benjamin Netanyahua \"genocidal maniac,\" prompting a sharp rebuke from the country’s ambassador to the United Nations.\n\"Genocidal maniac Netanyahu is burning Palestinians alive, bombing hospitals, starving people, and killing aid workers,\" theMichigan representativewrote Monday night in a post on X.\n\"When will our country stop funding this madness? When?\" she added.\nIsraeli ambassador to the U.N. Danny Danon responded to her by writing \"The only ones who burned children alive were your buddies over at Hamas.\"\nISRAELI FORCES SEIZE DOCUMENTS THAT REVEAL HAMAS PLAN FOR MORE ELABORATE ATTACKS: REPORT\nRep. Rashida Tlaib, D-Mich., is calling Israel Prime Minister Benjamin Netanyahu, right, a \"genocidal maniac.\"(Anna Moneymaker/Getty Images/Michael Kappeler/picture alliance via Getty Images)\nTlaib is one of Netanyahu’s fiercest critics in Washington.\nLast week, she wrote on X \"The war crimes being committed by the government of Israel are being funded by our own country while families at home suffer from displacement due to hurricanes and growing poverty. Our country is obsessed with war and destruction.\"\nWhen the Israeli prime minister delivered a speech to a joint session of Congress in July,she silently protestedfor much of it, holding up a double-sided sign that read \"guilty of genocide\" on one side and \"war criminal\" on the other.\nISRAEL REVEALS HEZBOLLAH SPECIAL FORCES TERRORIST ‘BUNKER’ LOCATED UNDER HOME WITH WEAPONS, MOTORCYCLES\nRep. Rashida Tlaib silently protested Netanyahu's July 24 speech to Congress.(Getty Images)\nFox News Digital observed a member of the House sergeant-at-arms' staff speaking to Tlaib multiple times during the speech, after which she put the sign down.\nPrior to Netanyahu’s July 24 address, Tlaib released a statement saying \"Netanyahu is a war criminal committing genocide against the Palestinian people.\nIsraeli ambassador to the U.N. Danny Danon is criticizing Tlaib for her comments about Netanyahu on social media.(Lev Radin/Pacific Press/LightRocket via Getty Images)\nCLICK HERE TO GET THE FOX NEWS APP\n\"It is utterly disgraceful that leaders from both parties have invited him to address Congress. He should be arrested and sent to the International Criminal Court,\" she said at the time.\nFox News’ Alexander Hall contributed to this report.\nGreg Norman is a reporter at Fox News Digital."}, {"source": "foxnews", "title": "Harris' off-putting manner put Zelenskyy on defensive ahead of Russian invasion, new book reveals", "link": "https://www.foxnews.com/politics/harris-off-putting-manner-put-zelenskyy-defensive-ahead-russian-invasion-new-book-reveals", "content": "Former U.S. Ambassador to NATO Kurt Volker discusses growing threats from Russia and China on ‘Fox & Friends Weekend.’\nVice President Kamala Harris’history as a federal prosecutor instilled in her a direct, sometimes adversarial communication style that reportedly alienated Ukraine President Volodymyr Zelenskyy during their first private sit-down, leaving him \"disgruntled\" and defensive just days before Russian troops invaded his country.\nTheir tense sit-down was chronicled in \"War,\" the new book by Bob Woodward. In the book, Woodward details some of the most consequential foreign policy and security challengesoverseen by President Biden during his first term. Among them, Russia’s 2022 invasion and ongoing war in Ukraine.\nFox News obtained an early copy of the book, which is available in bookstores today.\nAs Woodward reports, Biden deployed Harris to the Munich Security Conference in February 2022, less than a week before Russian President Vladimir Putin's troops commenced their full-scale invasion of Ukraine – with the sole mission of convincing Zelenskyy that theRussian incursionwas imminent, based on all available U.S. intelligence and the hundreds of thousands of troops it had confirmed Russia had been amassing nearby, including some 40,000 soldiers near the Belarusian border.\nHarris was to demonstrate unified support for Ukraine from the U.S. and NATO, and to help Zelenskyy accept the fact that this was, indeed, happening.\nHowever, Woodward reports, aspects of that mission backfired – at least behind closed doors.\nPublicly, Harris delivered a winning speech, effectively reassuring the world of the U.S. commitment to Ukraine's sovereignty and Article 5. It is considered among her major achievements as vice president.\nHUNTER BIDEN LEGAL SAGA IS ‘REAL WAR’ THAT 'PREOCCUPIED' OUTGOING PRESIDENT, NEW WOODWARD BOOK CLAIMS\nVice President Kamala Harris and Ukrainian President Volodymyr Zelensky arrive for photos before meeting together at the Munich Security Conference.(Andrew Harnik/Pool/AFP via Getty Images)\nIn private, however, Zelenskyy was immediately put off by Harris’s brusque communication style and \"forceful\" demeanor during their sit-down, during which Harris and her national security adviser, Philip Gordon, wore masks and did not attempt to shake hands with their Ukrainian counterparts upon entering the room.\nThough Germany was still under COVID-19 protocols, the icy start to the meeting \"disgruntled\" Zelenskyy, Woodward said, and left the Ukrainian president feeling \"like he was about to be reprimanded\" at a frightening and vulnerable time for his nation.\n\"You need to take seriously the likelihood that any day the Russians will invade your country,\" Harris told him forcefully.\nIn Woodward's telling, things between the two did not improve from there.\nHarris, a successful former federal prosecutor and California attorney general, has been praised and criticized for her adversarial communication style – and it was one she reportedly employed during her sit-down with Zelenskyy, in attempt to convince him of the imminence of Russia's invasion.\nTRUMP MEETS UKRAINE'S ZELENSKYY AT TRUMP TOWER, SAYS RUSSIA'S WAR MUST END WITH 'FAIR DEAL'\nVice President Kamala Harris speaks to reporters at her hotel after the Munich Security Conference.(Andrew Harnik/Pool via Reuters)\n\"Look,\" Harris told him, after some tense back-and-forth, \"our teams will share more specific information with you but we are telling you that your numbers are wrong. You really face a potentially imminent invasion.\"\nRather than softening him, the meeting appeared to put Ukraine's president even more on the defensive.\nAs Woodward writes, Zelenskyy was hard-pressed to acknowledge the imminence of the invasion despite credible U.S. intelligence, in large part because it would create a \"self-fulling prophecy\" for Ukraine's nascent democracy, risking the collapse of the country's economy, and potentially, its government.\nFinally, Zelenskyy relented, looking Harris in the eye and asking directly, \"What do you want me to do?\"\nHe inquired whether the U.S. would impose sanctions, close ports to Russian ships, give Ukraine Stinger or Javelin missiles or send warplanes to his country, in order to equip them for the battles ahead.\nHarris’s answer did little to assuage him. \"The punishment can only come after the crime,\" she said of a U.S. response to Russia, Woodward noted, instead advising him to \"start thinking about things like having a succession plan in place to run the country if you're captured or killed or cannot govern.\"\nZelenskyy was urged by the U.S. to have an escape plan – one which he boldly rebuffed, choosing to remain in Kyiv in the days and weeks following Russia’s invasion.\nHe also turned down evacuation offers from both the U.S. and Turkey following the start of the war.\nThe \"fight is here,\" he would later say from Kyiv. \"I need ammunition, not a ride.\"\nBIDEN PLEDGES $8 BILLION TO UKRAINE FOLLOWING PUTIN'S PROPOSED CHANGES TO NUCLEAR RULES\nUkrainian President Volodymyr Zelenskyy speaks to reporters in front of a Patriot air defense missile system.(Jens Buettner/dpa via AP)\nCLICK HERE TO GET THE FOX NEWS APP\nHarris remarked to Gordon upon leaving the meeting that that was the last time they might ever see him again.\n\"War\" is available for purchase in stores on Oct. 15.\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.\nBreanne Deppisch is a politics reporter for Fox News Digital covering the 2024 election and other national news."}, {"source": "foxnews", "title": "Fox News Politics: Nathan Wade grilled", "link": "https://www.foxnews.com/politics/fox-news-politics-nathan-wade-grilled-house-investigators", "content": "Welcome to the Fox News’ Politics newsletter, with the latest political news from Washington, D.C. and updates from the 2024 campaign trail.\nHere's what's happening…\n-Trump says 'I don't care when you vote' in newHouse GOPad urging voters to turn out early\n-Top outside group backingSenate Republicansshowcases fundraising haul\n-Harris holds big advantage among early voters, Trump with Election Day voters:poll\nFormer Fulton County Special Prosecutor Nathan Wade left Capitol Hill on Tuesday after a marathon four-and-a-half hour grilling by House Judiciary Committee investigators.\nWade, whose legal team included former Georgia Gov. Roy Barnes, said little to reporters before, after and during his closed-door deposition. No lawmakers were seen entering or leaving the room.\n\"This is all I’m going to say – we gave our testimony, we cooperated and we are through,\" Barnes told reporters after the session…Read more\nNathan Wade and Donald Trump.(Left: (Photo by Brynn Anderson-Pool/Getty Images), Right: (Photo by Mario Tama/Getty Images))\nMICROMANAGER-IN-CHIEF?: Netanyahu states that his regime, not the US, will decide how to retaliate against Iran…Read more\nCHECK THE TAPE:Speaker Johnson accuses CBS of 'selectively editing' interview on heels of VP Harris '60 Minutes' controversy…Read more\n'I'M PRAYERFUL':Nancy Pelosi admits she still hasn't spoken to President Biden after pressuring him to drop out of the race…Read more\n'BIGGEST CHALLENGE':The biggest challenge right now is fuel': Rep. Greg Steube of Florida talks hurricane aftermath…Read more\nWHO'S MORE ACCESSIBLE?:Trump-Vance ticket has done combined 78 interviews since August compared to 42 for Harris-Walz…Read more\nBLUE ALERT:Popular PA Democratic mayor warns Trump is ‘out-messaging’ Harris: 'I get more from Colbert'…Read more\n'PARTY OF COMMON SENSE':Trump says GOP is 'party of common sense' during contentious Bloomberg interview…Read more\nBIDENS ON THE TRAIL:President and first lady campaign in the biggest of the battlegrounds…Read more\nEV TROUBLES:Harris support for EVs could tank campaign in critical swing state, expert says…Read more\n'AT LEAST AFFORD GROCERIES':'I was much better off': These voters back Trump in top battleground county…Read more\nCHARGED UP:'Ruining our car industry': Biden-Harris EV regs prove flashpoint in Michigan Senate debate…Read more\nCUT SHORT:Trump cuts Pennsylvania town hall short over medical emergencies in crowd…Read more\nSPARKS FLY:CNN anchor and Rep. Waltz clash over Harris ‘socialist’ label, networks likening Trump to Hitler…Read more\n'THIS IS THE PRICE OF LAWFARE':Classified docs case dismissal means ‘greatest' legal 'threat’ to Trump is ‘gone’…Read more\nMORE THAN A 'HANDFUL?':New report warns bloodthirsty Venezuelan gang's footprint will remain in US ‘for decades'…Read more\nJUDGE RULES:Georgia judge rules election officials must certify vote counts, even if they suspect fraud…Read more\n'COLLECTIVE FAILURE':Outlet deletes review of Oct. 7 doc after backlash for complaining that film depicts Hamas too negatively…Read more\nANTISEMITISM ON CAMPUS:Hamilton College student admits to posting 'antisemitic remarks' on campus, New York State Police say…Read more\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more onFoxNews.com.\nThis article was written by Fox News staff."}, {"source": "foxnews", "title": "Fox News Politics: Who is to blame for the border?", "link": "https://www.foxnews.com/politics/fox-news-politics-border-properly-secured", "content": "Welcome to the Fox News’ Politics newsletter, with the latest political news from Washington, D.C. and updates from the 2024 campaign trail.\nHere's what's happening…\n-VP Kamala Harris to sit down with chief political anchorBret Baierfor first formal Fox News interview\n-Biden warned Iran thatkilling Trumpwould be an ‘act of war’\n-Trump camp teases Election Day transportation options for voters impacted byHurricanesHelene, Milton\nFormer President Bill Clintonsaid to a group of churchgoers Sunday that Georgia nursing student Laken Riley's murder would not have happened if the alleged killer, an illegal immigrant, was properly vetted.\nWhile campaigning for Vice President Kamala Harris in the Peach State, Clinton accused Harris' rival, former President Donald Trump, of tanking negotiations over a bipartisan border compromise in Congress because he wanted it to be a campaign issue.\nHe seemed to suggest that Riley's death could have been avoided if Congress was able to pass a compromise – despite the alleged killer having already been vetted…Read more\nFormer President Bill Clinton's speech in Columbus, Ga. on Sunday heavily featured the issue of the border.(Getty Images)\nSHOOTING BLANKS:Kamala Harris claims she's got a gun, but 2nd Amendment supporters say: good luck getting yours…Read more\nCOLUMBUS DAY FLASHBACK: Harris excoriated European explorers for 'wave of devastation' to Native peoples…Read more\nTECH CRUNCH:AI sector frustrated by Congress' slow pace keeping up with advanced tech…Read more\n'LISTEN TO YOUR QUESTION':NBC News' Kristen Welker presses House Speaker Mike Johnson on Trump's cholesterol levels…Read more\nFALSE NARRATIVE?:Who is Vem Miller, man arrested outside Trump Coachella rally? 4 things to know…Read more\nWHO'S MORE ACCESSIBLE?: Trump-Vance ticket has done a combined 75 interviews since August compared to 39 for Harris-Walz…Read more\n'LITTLE' KEYSTONE:Trends are good in the swing county GOP chair calls ‘Little Pennsylvania’: It’ll ‘be a repeat of ‘16’…Read more\n‘THE LEFT HAS PERFECTED THIS’: Conservatives take page from Obama's playbook in battleground Wisconsin…Read more\nHEALTHY AMERICANS:Harris goads Trump to release medical records after she gets clean bill of health from personal physician…Read more\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more onFoxNews.com.\nThis article was written by Fox News staff."}, {"source": "foxnews", "title": "Fox News Politics: 'Brothers' for Kamala", "link": "https://www.foxnews.com/politics/fox-news-politics-brothers-kamala", "content": "Welcome to the Fox News’ Politics newsletter, with the latest political news from Washington, D.C. and updates from the 2024 campaign trail.\nHere's what's happening…\n- Vladimir Putin meets with Iranian President Pezeshkian to celebrate'very close'relationship\n- Top Republican demands answers as billions inFEMA reliefare still going to COVID: 'Legitimate concern'\n-Doug Emhoffdoesn't deny report he slapped ex-girlfriend outside overseas movie event\nDuring a pre-campaign-rally stop in Pittsburgh on Thursday, former President Barack Obama appeared to admonish Black Americans who have not been as fervent in their support for Vice President Kamala Harris’ presidential bid as they were for his in 2008 and 2012.\n\"We have not yet seen the same kinds of energy and turnout in all corners of our neighborhoods and communities as we saw when I was running,\" Obama said during a stop at a campaign office.\n\"Now, I also want to say that that seems to be more pronounced with the brothers. So if you don't mind -- just for a second, I've got to speak to y’all and say that when you have a choice that is this clean: When on the one hand, you have somebody who grew up like you, went to college with you understands the struggles [and the] pain and joy that comes from those experiences…\"\n…Read more\nFormer US President Barack Obama speaks during a Democratic National Committee (DNC) rally in Philadelphia, Pennsylvania, US, on Saturday, Nov. 5, 2022.(Michelle Gustafson/Bloomberg via Getty Images)\n'REALLY OUTDONE YOURSELVES':Politico says Harris is running on a 'dream economy' but voters aren't noticing…Read more\n'CRUSHING GUILT': Hunter Biden legal saga is ‘real war’ that 'preoccupied' outgoing president, new Woodward book claims…Read more\n'SERIOUS RISK':Biden admin pushed to reveal full report on migrants entering US, boarding flights without ID …Read more\nTIME RUNNING OUT:US has helped tiny fraction of its citizens evacuate war-torn Lebanon…Read more\n'NONSENSE':Lead counsel hits new Dem effort to 'delegitimize' Supreme Court amid senator's report on Kavanaugh probe…Read more\n'SINGLE ISSUE VOTERS':Vaping advocate warns Dem crackdown on 'common sense' tobacco alternatives could backfire in swing states…Read more\nIn this Dec. 20, 2018 file photo, Juul products are displayed at a smoke shop in New York.(AP Photo/Seth Wenig, File)\nWHO'S MORE ACCESSIBLE?Trump-Vance ticket has done a combined 71 interviews since August to just 37 for Harris-Walz…Read more\nUNDERMINING DEMOCRACY?: Dems launched an onslaught of schemes slammed as tactics to undermine democracy ahead of high-stakes election…Read more\nOBAMA VS. TRUMP:Obama, stumping for Harris in key battleground, charges Trump 'will makes problems worse'…Read more\nGEORGIA ON THE LINE: Why this one Peach State county could be 'key' to presidency…Read more\nFox News Digital spoke with voters in Atlanta about who they think will win their swing state between former President Trump and Vice President Harris(Getty Images)\nTOWN HALL:Harris makes pitch to Latino voters at Univision town hall: Top 5 moments…Read more\n'OPERATION AURORA':Trump to announce 'Operation Aurora' to target Tren de Aragua gang in Colorado rally…Read more\nPOLITICAL STORM:Milton's gone, but the political storm keeps raging over federal government's hurricane efforts…Read more\nDOUBLE WHAMMY:As Hurricane Milton hits Florida, so do more illegal immigrants…Read more\nMARYLAND SENATE: Alsobrooks backs court-packing as Hogan fights GOP, McConnell, Trump associations…Read more\n'DO YOUR JOB!':Jewish organization blasts colleges in billboard ad near San Diego State University to combat antisemitism…Read more\nThe Chabad House near San Diego State University has a new menorah standing taller than the previous one that had been vandalized three times in two years.(Chalom Boudjnah/Chabad House at SDSU )\nLIGHT IT UP:Blue state CEO sued over pro-Trump sign nets 'epic win for free speech'…Read more\nDEMOCRACY '24:Alaska, Colorado, and Massachusetts begin absentee voting…Read more\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more onFoxNews.com.\nThis article was written by Fox News staff."}, {"source": "foxnews", "title": "As a cautious Kamala loses momentum, Democrats are panicking over a Trump win", "link": "https://www.foxnews.com/politics/cautious-kamala-loses-momentum-democrats-panicking-over-trump-win", "content": "Fox News media analyst challenges ex-Clinton adviser Mark Penn's call for a full internal investigation into the ABC News Presidential Debate.\nTheKamala Harriscampaign rocket, which soared to dazzling heights when she got into the race, is losing altitude.\nDespite raising a billion dollars, despite overwhelmingly positive coverage by the mainstream media, she has failed to deliver a compelling message and is especially struggling to win over Black and Latino voters. There’s no question that many Democrats, who grew accustomed to reading stories about who’ll be in the Harris Cabinet, are panicking.\nNow you could look at the glass as half-full and say it’s remarkable that a relatively unpopular vice president, in a short period of time, is running neck and neck withDonald Trump.She is tied nationally in a new NBC College poll. But that’s a drop of five points for Harris since the last survey in September.\nTrump is the ultimate Teflon candidate. The press may jump on him for refusing to release his medical records (as Harris just did) but demanding she take a cognitive test; for using incendiary language against illegal immigrants, or for vowing to protect women when it’s his Supreme Court justices who overturned Roe.\nNOW THAT KAMALA HARRIS IS DOING INTERVIEWS, PEOPLE ARE REMINDED THEY ‘DON’T LIKE HER’: LISA BOOTHE\nThe Harris campaign's hype train appears to be screeching to a grinding halt – and regardless of whether they'll admit it, Democratic intelligentsia are taking notice.(BRENDAN SMIALOWSKI/AFP via Getty Images)\nIt doesn’t matter. MAGA loyalists can’t stand the media, and they’re not going to change their minds at this late date. He has the advantage of having held the job. They remember Trump’s presidency with growing fondness, particularly for a strong economy and greater limits at the border, and brush aside any negative developments, especially Jan. 6.\nHarris has certainly made policy proposals and done a bunch of softball interviews. But she made a big mistake on \"The View,\" saying she couldn’t think of a single thing where she’d differ fromJoe Biden.It was not intended as a gotcha question.\nHow can she grab the mantle of the change candidate and, with that sentence, cast herself as Biden 2.0?\nKAMALA 2.0’S CHALLENGE? MAKING MORE NEWS, AND NOT JUST WITH ULTRA-FRIENDLY HOSTS\nIf she feels loyalty to Joe, it’s misguided. As a veteran pol, he would understand if she said he did a good job but here’s several areas where I disagree with him and would do things differently–no word salad allowed.\nAxios and others are reporting tension between the Harris and Biden camps – she’s replaced the president’s top strategists and spokesmen – precisely the kind of leaks that mark a sputtering campaign.\nWhen people complain that they don’t really know Kamala, they’re really saying they’re not yet prepared to trust her with the nuclear codes. She still has to pass the commander-in-chief test. But she also has to seem warm and approachable. That’s a daunting challenge in a country that, unlike much of the world, has never elected a female president.\nKamala Harris' last-minute media blitz would be better spent on enemy territory than on cracking beers open with Stephen Colbert.(Screenshot/CBS)\nHere’s someBritish invectivefrom Andrew Sullivanon his Substack:\n\"The more I listened to her in these interviews, the more worried I became that she doesn’t actually believe in anything…\n\"Her team either fears or knows she may not be up to it. And this is bleeding obvious. A presidential campaign where you rarely face the press, never deal with a hostile interview, and never hold a presser is a campaign defined by fear. You can smell it from miles away.\"\nAndrew, by the way, is voting for Harris, mainly because he’ll do anything to keep Trump out of theWhite House.\nKamala keeps talking about being the underdog, but she’s run a very cautious campaign. The anxiety about making a mistake should be outweighed by the need to make news, at a time when Trump is back to dominating the news. Many days go by in which she’s a minor TV presence compared to the ratings-boosting Trump.\nIt’s smart that she’s now agreed to several network town halls, but she should have been doing these from the start, rather than reciting the same stump speech at rallies. Drinking beer with Stephen Colbert doesn’t quite cut it.\nWHY VANCE EASILY BEAT WALZ IN DEBATE, SOFTENING HIS IMAGE IN THE PROCESS\nAnd who would have thought that the woman of color would be lagging behind the usual Democratic margins among Blacks – particularly Black men –and Latinos?\nThings reached the point where Barack Obama had to scold Black men for sexism, accusing them of not being comfortable with voting for a woman.\nThe battleground polls are tight, so obviously Harris can still win. But she basically needs to camp outin Pennsylvania,Michigan and Wisconsin rather than trying to pick off these Sunbelt states.\nThe Harris campaign, if it hopes to take things all the way, needs to remain laser-focused on campaigning in the Rust Belt – rather than the usually-competitive Sun Belt, states that former President Trump seems poised to easily run away with.(AP Photo/David Yeazell)\nIn fact, if she had put aside any personal friction and picked Josh Shapiro, she’d probably have more of an edge in his state. Instead, she went withTim Walz,who’s not helping the ticket much no matter how many pheasants he hunts. He has, however, done well in two straight interviews with \"Fox News Sunday.\"\nA major step forward: Harris agreeing yesterday to an interview with Fox anchor Bret Baier, on Wednesday in Pennsylvania. Some headlines are calling this a risky move, but Bret has vast experience with such interviews and will absolutely be fair. The upside for her: reaching the largest audience by far in cable news.\nBret said on the air that he believes there’s \"a sense that they have inside the campaign, their strategy has to change, they’ve got to change. They’re losing Black males… I think that the campaign realizes they have to do more outreach.\"\nSUBSCRIBE TO HOWIE'S MEDIA BUZZMETER PODCAST, A RIFF ON THE DAY'S HOTTEST STORIES\nMaybe this is all too much to lay on Kamala’s shoulders. Maybe she’s doing the best she can against a former president whose message is clear and simple: Stop illegal immigration, mass deportations, combat inflation, end wars in theMiddle East.And an incumbent is always subject to the counter-charge: Well, why haven’t you done it already?\nCLICK HERE TO GET THE FOX NEWS APP\nThe vice president simply hasn’t been able to generate the excitement that surrounded her initial campaign launch. Three weeks is a long time in politics, but whether Harris can reenergize her candidacy remains an open question.\nHoward Kurtz is the host of FOX News Channel'sMediaBuzz(Sundays 11 a.m.-12 p.m. ET). Based in Washington, D.C., he joined the network in July 2013 and regularly appears onSpecial Report with Bret Baierand other programs."}, {"source": "foxnews", "title": "Trump counters Harris media blitz by ripping Bob Woodward, Howard Stern and her hurricane briefing", "link": "https://www.foxnews.com/politics/trump-counters-harris-media-blitz-ripping-bob-woodward-howard-stern-hurricane-briefing", "content": "Panelists Kellyanne Conway, Howard Kurtz and Patrick Murphy react to Vice President Kamala Harris’ recent media interviews on ‘The Story.’\nOn one point, at least, the Kremlin has sided with Bob Woodwardagainst former President Donald Trump.\nWoodward is coming out with a new book, and among its headline-making disclosures is his report on what happened when the pandemic struck, when the death toll was soaring and people could not get home testing kits for COVID-19.\nFROM KISSY-FACE SITDOWN ON ‘THE VIEW’ TO A TOUGHER GRILLING ON ‘60 MINUTES,’ KAMALA HARRIS IS MAKING NEWS\nTrump, at that point in 2020, secretly sentVladimir Putina number of Abbott Point of Care COVID test machines \"for his personal use.\"\nThe Trump campaign said Woodward’s book, an advance copy of which was obtained by CNN, consisted entirely of made-up stories.\nHowever, Kremlin spokesman Dmitri Peskov confirmed the receipt of theCOVID machines.\nFormer President Donald Trump, left, and investigative journalist Bob Woodward.(Getty Images)\n\"As for the tests, when the pandemic began, countries did not have enough equipment,\" Peskov said. \"And many countries then exchanged such gestures of support and sent each other shipments of various equipment they had.\"\nIn fact, during the spring of 2020, Russia sent the Trump administration 60 tons of medical equipment.\nWoodward also quotes the Russian dictator as telling Trump, \"I don’t want you to tell anybody because people will get mad at you, not me. They don’t care about me.\"\nKAMALA 2.0’S CHALLENGE? MAKING MORE NEWS, AND NOT JUST WITH ULTRA-FRIENDLY HOSTS\nHowever, Peskov disputed another assertion by Woodward, that Trump has stayed in touch with Putin since he left the White House, with as many as seven calls between them. \"As for the calls, that's a lie,\" Peskov said.\nIn the book \"War,\" however, the Washington Post sleuth recounts a scene where Trump tells a top aide to leave the room so \"he could have what he said was a private phone call with Russian President Vladimir Putin.\" Trump officials now say they are not aware of any such conversations.\nThe former president granted Woodward 18 taped interviews for his previous book, but they had a falling out after the veteran reporter wrote that Trump was unfit for office and was sued by his subject for releasing the recordings.\nRussian President Vladimir Putin holds a meeting with the acting governor of Kaliningrad Region at the Novo-Ogaryovo state residence, outside of Moscow, on Aug. 14, 2024.(Gavriil Grigorov/POOL/AFP via Getty Images)\nI know Woodward’s work extremely well, and while any journalist can be misled by sources, he does not make things up.\nOther parts of the book dealwith President Bidenconfronting Putin about the coming invasion of Ukraine, had Vice President Kamala Harris warn a skeptical Volodomyr Zelenskyy, and – with officials assuming a 50% chance that he might use a tactical nuclear weapon against the Ukrainians, called the Kremlin boss the \"epitome of evil.\"\nThe president repeatedlycursed out Israeli Prime Minister Benjamin \"Bibi\" Netanyahu, calling him an \"SOB\" and, later, a \"f---ing liar\" after the Israeli prime minister invaded the crowded area called Rafah despite American pressure.\nWHY VANCE EASILY BEAT WALZ IN DEBATE, SOFTENING HIS IMAGE IN THE PROCESS\nIn the statement from Trump’s spokesman, which sounds like it was dictated by the boss, Woodward is described as \"a truly demented and deranged man who suffers from a debilitating case of Trump Derangement Syndrome. Woodward is an angry, little man and is clearly upset because President Trump is successfully suing him because of the unauthorized publishing of recordings he made previously. President Trump gave him absolutely no access for this trash book that either belongs in the bargain bin of the fiction section of a discount bookstore or used as toilet tissue. Woodward is a total sleazebag who has lost it mentally, and he’s slow, lethargic, incompetent and overall a boring person with no personality.\"\nWhy stop there?\nTrump, who prides himself on being a counter-puncher, wastes little time before swinging away.\nVice President Kamala Harris poses during the Unite for America live-streaming rally in Farmington Hills, Michigan, on Sept. 19, 2024.(SAUL LOEB/AFP via Getty Images)\nAfter Harris’ friendly radio interview with Howard Stern, who said it would be insanity to vote for Trump, a post appeared on Truth Social.\n\"BETA MALE Howard Stern made a fool of himself on his low-rated radio show when he ‘interviewed’ Lyin’ Kamala Harris, and hit her with so many SOFTBALL questions that even she was embarrassed.\n\"He looked like a real fool, working so hard to make a totally incompetent and ill-equipped person look as good as possible, which wasn’t very good. I dropped Howard a long time ago, like most others, and have since been credited with very good judgment!\"\nTrump and Stern were, of course, once New York pals, and Trump attended his wedding.\nTrump also had campaign manager Chris LaCivita take a swipe at Fox News for covering (along with other networks) a government briefing, featuring both Biden and Harris, on Hurricane Milton as the monster storm was heading toward Florida.\n\"@FoxNews ⁩just as bad as every other ‘cable news’ network …running literally propaganda and @KamalaHarris ⁩TV ads disguised as a news conference,\" Chris LaCivita posted on X.\nCLICK HERE TO GET THE FOX NEWS APP\nOf course, there’s a political benefit for Harris showing that she and FEMA are working hard to prepare for the Florida storm, just as there is when Florida Gov. Ron DeSantis holds a presser on the Category 5 threat.\nHowever, with Harris' media blitz finally making some news after weeks in which Trump has dominated the campaign coverage, this reflects his determination to insert himself into every story that surfaces, no matter how negative.\nHoward Kurtz is the host of FOX News Channel'sMediaBuzz(Sundays 11 a.m.-12 p.m. ET). Based in Washington, D.C., he joined the network in July 2013 and regularly appears onSpecial Report with Bret Baierand other programs."}]