[{"title": "Trump campaign hints at Election Day transportation options for voters impacted by Hurricanes Helene, Milton", "link": "https://www.foxnews.com/politics/trump-campaign-hints-election-day-transportation-options-voters-impacted-hurricanes-helene-milton", "content": "Trump 2024 National Press Secretary Karoline Leavitt discussed Trump and Harris' dueling PA events, the National Border Patrol Council's endorsement, how hurricane devastation could impact voters and Harris' 'opportunity agenda' for Black men.\nFormer President Trump's campaign hinted atElection Daytransportation options for those impacted by Hurricane Helene and Hurricane Milton in the southeastern region of the United States.\"As President Trump said when we were on the ground in Georgia surveying the damage – may I add he went there before Kamala Harris or Joe Biden did – he said we care most about lives, protecting lives, saving people's livelihoods. Their businesses were destroyed, their homes were destroyed.\" Trump Campaign national press secretary Karoline Leavitt said Monday on Fox News’ \"Fox and Friends First.\"\n\"With that said, it's very important thatvoters are not disenfranchised, and our campaign leadership sent out a letter to state and local officials on the ground in North Carolina saying, ‘You need to provide as many accessible voting locations as possible on the ground.' Our campaign is reviewing how we can possibly provide transportation for voters who need to get to the polls and ensuring they have access to the ballot box,\" Leavitt added. \"They have faced this destruction through no fault of their own. And this is Trump country. This is western North Carolina. These are our people. We’re focused on taking care of them and making sure that their right to vote still remains even in the wake of this disaster.\"\nFox News Digital reached out to the Trump campaign and the Republican National Committee (RNC) for more information. The Washington Examiner reported last week that there are nearly 1.3 million registered voters across the 25 countries in western North Carolina designated a federal disaster area after Hurricane Helene. Trump carried North Carolina in the 2020 election by merely 75,000 votes.\nHARRIS CAMPAIGN DEPLOYS BILL CLINTON TO KEY STATES 22 DAYS FROM ELECTION DAY\nDebris is seen in front of a home with a Trump 2024 campaign sign in Lake Lure, North Carolina, Oct. 2, 2024, after the passage of Hurricane Helene.(Allison Joyce/AFP via Getty Images)\nIn an appearance on Fox News' \"The Ingraham Angle\" last week, RNC co-chair Lara Trump said the committee sent out a memorandum to Democratic North Carolina Gov.Roy Cooperand the North Carolina General Assembly that provided 10 recommendations on ensuring voter access after the disaster.\n\"We don't want people who have gone through a horrific tragedy like a hurricane who have really lost so much already to lose their ability to vote in this election,\" Lara Trump said.\nA view from Team Trump Bus Tour featuring House Republican Conference Chair Rep. Elise Stefanik, Hogan Gidley, Kash Patel, Chad Wolf, Abel Maldonado and Brooke Rollins in Charlotte, North Carolina on Oct. 10, 2024.(Peter Zay/Anadolu via Getty Images)\nNorth Carolina State Board of Electionsofficials announced that 75 of the 80 early voting sites planned across the 25 counties that fall within the federal diaster area of western North Carolina will reopen on Thursday, when early voting is set to begin in the Tar Heel State.\n'CAN'T WAIT TILL THE LAST MINUTE': NC CONGRESSMAN RAISES ALARM ON VOTER ACCESS IN AREAS HARD HIT BY HELENE\n\"This is absolutely outstanding that our county boards of elections have pulled this off in western North Carolina, given the devastation and destruction left by Helene,\" State Board Executive Director Karen Brinson Bell said at a press conference last week, according to the Carolina Journal. \"We will be ready even in western North Carolina thanks to the extremely hard work of county election officials across the state and dedicated state board officials as well.\"\nThe state election officials are still coordinating with North Carolina Emergency Management and FEMA to secure portable restrooms, generators and trailers and other support for the 540 polling places located within the 25-county area of devastation ahead of Election Day on Nov. 5.\nPeople walk past a destroyed church in the aftermath of Hurricane Helene flooding on Oct. 6, 2024, in Swannanoa, North Carolina.(Mario Tama/Getty Images)\nThe state legislature approved $5 million in emergency funding for the State Board of Elections to deal with the storm’s effects, and state lawmakers also expanded emergency measures put in place by the election board that allow counties to modify early voting days and locations.\nOn Friday, the Buncombe County Board of Elections approved new times and locations for early voting.\nRep. Chuck Edwards, R-N.C., sounded the alarm on voter access in an interview with Fox News Digital last week, expressing concern after his district was one of those badly impacted by Hurricane Helene.\nCLICK HERE TO GET THE FOX NEWS APP\n\"Folks are still in the process of putting their lives together, desperately trying to get their power back on, trying to get in touch with their loved ones, trying to dig out from the debris and not really thinking that there's an election coming up here in three weeks or so,\" Edwards said.\nFox News' Elizabeth Elkind and Matteo Cina contributed to this report.\nDanielle Wallace is a breaking news and politics reporter at Fox News Digital. Story tips can be sent to danielle.wallace@fox.com and on X:@danimwallace."}, {"title": "CNN data reporter predicts Trump will win ‘historic’ number of Black and Hispanic voters", "link": "https://www.foxnews.com/media/cnn-data-reporter-predicts-trump-win-historic-number-black-hispanic-voters", "content": "CNN data reporter Harry Enten revealed that former President Donald Trump is expected to garner a \"historic\" number of Black and Hispanic voters in November.\nCNN data reporter Harry Entenwarned on Sunday that former President Trump is predicted to win a \"historic\" number of Black and Hispanic voters in the November election.\nDuring an appearance on \"Inside Politics,\" Enten revealed the potentially bad news for Democrats and also noted that Republicans are outpacing Democrats in party identification and registration for the first time in almost 40 years.\n\"At this particular hour, if you believe the polling, Donald Trump’s going to put up the best performance with Black voters since Richard Nixon in the 1960s,\" Enten said.\nA New York Times/Siena College pollreleased on Sunday suggested that Vice President Kamala Harris holds 78% percent of the Black vote. Hillary Clinton won the voting block with 92% in 2016, and President Biden won approximately 90% in 2020.\nTRUMP, HARRIS LOCKED IN DEAD HEAT IN 7 BATTLEGROUND STATES, POLL FINDS: 'COULD NOT BE CLOSER'\nFormer President Trump speaks to supporters during a campaign event at Saginaw Valley State University on Oct. 3, 2024, in Michigan.(Scott Olson/Getty Images)\nEnten also told a CNN panel on Sunday that Trump is expected to put up the \"best performance\" for a Republican when it comes to Hispanic voters since former President George W. Bush in 2004.\n\"The GOP leads by a point in party identification right now,\" he said. \"The average when the Republican Party loses is the Democrats ahead by 8. When the Republican Party wins, the average party ID advantage for Democrats is 3. Republicans right now, Manu, are doing even better than the average when they win,\" Enten added.\nHe noted that the party registration and party ID data \"points in a good direction\" for Trump.\nHowever, Enten questioned whether Trump’s performance among minority groups could be erased by Harris’ support among college-educated White voters.\nPOLL SHOWS HARRIS TAKING A SLIM LEAD OVER TRUMP THANKS TO SUPPORT FROM A SURPRISING GROUP\nCNN data reporter Harry Enten predicted that Trump may win a historic number of Black and Hispanic voters.(CNN/Screenshot)\n\"The question ultimately is—is that enough to offset the strength that Kamala Harris has with White voters with a college degree? At this particular moment, she has the strongest margin with them than any Democrat going back since recorded history with polling, I guess since 1948, 1952, wherever you want to put it,\" he said.\nEnten calculated that Harris is winning the demographic by 18 points.\nAn NBC News surveyof registered voters released on Sunday found that voters are virtually evenly split between the two candidates.\nCLICK HERE TO GET THE FOX NEWS APP\nWhen the poll, conducted Oct. 4-8, asked respondents who they would choose, Trump and Harris each earned 48% in a hypothetical one-on-one matchup.\nWhen third-party figures were included in the mix, the overall result was 47% support for Trump versus 46% for Harris.\nNikolas Lanum is an associate editor for Fox News Digital."}, {"title": "Bill Clinton suggests Laken Riley would still be alive if border 'properly' secured, hitting Republicans", "link": "https://www.foxnews.com/politics/bill-clinton-suggests-laken-riley-would-still-alive-border-properly-secured-hitting-republicans", "content": "Former President Bill Clinton discusses migrant crime in Fort Valley, Georgia.\nFormer President Bill Clintonsaid in a speech Sunday that Georgia nursing student Laken Riley's murder would not have happened if the alleged killer, an illegal immigrant, was properly vetted.\nWhile campaigning for Vice President Kamala Harris in the Peach State, Clinton accused her rival, former President Trump, of tanking negotiations over a bipartisan border compromise in Congress because he wanted it to be a campaign issue.\nHe seemed to suggest that Riley's death could have been avoided if Congress was able to pass a compromise – despite the alleged killer having already been vetted.\n\"She's the only candidate who has actually endorsed a bill that would hold down immigration any given year to a certain point and then made sure we gave people a decent place to live, didn't divide people from their children. And we did total vetting before people got in. Now, Trump killed the bill,\" Clinton said.\nGEORGIA GOP CHAIR SHARES 2-PRONGED ELECTION STRATEGY AS TRUMP WORKS TO WIN BACK PEACH STATE\nFormer President Bill Clinton's speech in Columbus, Georgia, heavily featured the issue of the border.(Getty Images)\n\"You had a case in Georgia not very long ago, didn't you? They made an ad about it, a young woman who had been killed by an immigrant. Yeah, well, if they'd all been properly vetted that probably wouldn't have happened.\"\n\"And America isn't having enough babies to keep our populations up, so we need immigrants that have been vetted to do work – there wouldn't be a problem,\" he added.\nCustoms and Border Patrol (CBP), meanwhile, previously publicly confirmed that people who are encountered trying to cross the border illegally are vetted and screened.\nThe alleged killer was encountered by CBP on Sept. 8, 2022, after entering near El Paso, Texas, and was \"paroled and released for further processing.,\" Fox News Digital was previously told.\nThe bipartisan border deal also only failed earlier this year, years after the Venezuelan national accused of killing Riley entered the country, still under the Biden administration's watch.\nClinton later praised the current administration’s handling of the border and illegal immigration during a campaign stopin Georgiaon Monday.\n\"For the last three years, the Biden-Harris administration has done increasingly tough things, trying to control the border. And illegal crossings have gone down every year for three years. Our friends in the other party don't want to talk about that,\" Clinton said.\nTRUMP VS HARRIS ROUND 2? VOTERS IN KEY GA COUNTY REVEAL IF THEY WANT SECOND DEBATE\nIt is notable that the former president’s speech largely focused on the border in Georgia, a state President Bidenwon byless than 1% in 2020.\nThe issue of illegal crossings at the border has become a political lightening rod in this election cycle. Democrats in tight races – both for the presidency and congressional and local positions – are emphasizing their support for tougher border security measures as Americans across the country have seen their area infrastructures strained by a deluge of people seeking shelter in the U.S.\nVice President Kamala Harris speaks during a campaign event at East Carolina University, Sunday, Oct. 13, 2024, in Greenville, North Carolina.(AP Photo/David Yeazell)\nHowever, Republicans have long criticized Democrats’ handling of border security, citing the record number of border crossings since Biden took office. They have continued to do so during the campaign by arguing Harris has failed to live up to her informal \"border czar\" title.\nDespite several instances of high-profileuse in the media, Clinton accused Republicans of bestowing the title on Harris – which he dismissed as inaccurate.\n\"They want to attack Kamala Harris and blame her for anything they managed to keep from happening. Like they claim she was the ‘border czar,’ that's not what her jobs are,\" Clinton said.\n\"Her job was to go down to these other countries that were sending us a lot of people and trying to get them, to enroll them in a legal process while they were still in the country so they wouldn't be illegally trafficked, show up our border, had to be cared for on one side of it or another, and then we'd run the risk of having people get in here who weren't properly vetted. That's what she tried to do.\"\nGEORGIA DEMS CHAIR REVEALS MESSAGE TO UNDECIDED GOP VOTERS AS HARRIS WORKS TO BUILD BROAD BASE\nFormer President Bill Clinton also accused former President Trump of not actually wanting to fix the border.\nHe also accused former President Trump of working to derail the bipartisan border compromise that failed in the Senate, and which House Speaker Mike Johnson, R-La., deemed \"dead on arrival\" in the House.\nCLICK HERE TO GET THE FOX NEWS APP\n\"He said, ‘Oh my God, we can't fix the border. What am I going to do for TV ads? Who am I going to demonize every day? I don't get into politics to solve problems. I get in it to create problems and blame other people for doing,’\" Clinton said.\nFox News Digital reached out to the Trump campaign for a response.\nThe former president is on a campaign swing through rural America on behalf of Harris' 2024 bid.\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com"}, {"title": "Trump ally Tim Scott mulls bid for top role at Senate campaign arm", "link": "https://www.foxnews.com/politics/trump-ally-tim-scott-mulls-bid-top-role-senate-campaign-arm", "content": "GOP Senate nominee in Pennsylvania, Dave McCormick, tells Fox News Digital that while he strongly supports former President Trump, he's also ‘shown my independence.’\nSen. Tim Scott, R-S.C., is considering running for the top role at the National Republican Senatorial Committee (NRSC) for the next election cycle.\nA spokesperson for Scott confirmed to Fox News Digital in a statement that the senator is looking into running for the position.\n\"The Senator is grateful for the encouragement he has received from colleagues to run for chair of the NRSC,\" said Scott spokesperson Nathan Brand. \"He is working tirelessly to send Donald Trump back to the White House and take the U.S. Senate, then looks forward to growing the Republican majority in 2026.\"\n'DON'T EVEN KNOW WHO HE IS': WISCONSINITES TALK HARRIS' MIDWESTERN RUNNING MATE, TIM WALZ\nSen. Tim Scott waves as he sits with former President Trump, during a Fox News town hall on Feb. 20, 2024, in Greenville, South Carolina.(Justin Sullivan/Getty Images)\nSens. Thom Tillis, R-N.C., John Cornyn, R-Texas, and Susan Collins, R-Maine, are up for re-election in 2026.\nWith North Carolina's recentpolling and electoral moves toward Democrats, Tillis' seat could become more expensive to defend for Republicans.\nLEAD COUNSEL HITS NEW DEM EFFORT TO 'DELEGITIMIZE' SUPREME COURT AMID SENATOR'S REPORT ON KAVANAUGH PROBE\nSen. Thom Tillis departs from a luncheon with Senate Republicans at the U.S. Capitol on June 1, 2023.(Anna Moneymaker/Getty Images)\nAs for Cornyn, hecould face primary challengesfrom other Republicans who have criticized him. Texas Attorney General Ken Paxton hinted at potentially running against the senator in asocial media postearlier this year.\nCollins notably survived her last re-election race, pulling off a shock split-ticket victory despite running alongside Trump. Her seat will likely be seen as a top pickup opportunity for Democrats.\nALSOBROOKS BACKS COURT-PACKING AS HOGAN FIGHTS GOP, MCCONNELL, TRUMP ASSOCIATIONS\nThe U.S. Capitol(Celal Gunes/Anadolu Agency via Getty Images)\nThere are also potential opportunities for Republicans to challenge Democrats in 2026, with Sens. Jon Ossof, D-Ga., and Gary Peters, D-Mich.\nScott is currently traveling to swing states ahead of the November election and campaigning to ensure Republicans regain the Senate majority in 2025. He has traveled to both Nevada and Wisconsin and is headed soon to Michigan, Ohio and Pennsylvania.\nFOR WISCONSIN DEMS, A 2024 WIN IN THE BATTLEGROUND STATE IS YEARS IN THE MAKING\nSen. Tim Scott speaks alongside former President Trump during a campaign event in Concord, New Hampshire, on Jan. 19, 2024.(Al Drago/Bloomberg via Getty Images)\nA super PAC aligned with the South Carolina Republican is additionally spending seven figures in battleground states in order to further help the GOP. Scott has helped raise six figures for the 2024 Senate campaigns, according to his team.\nCLICK HERE TO GET THE FOX NEWS APP\nIf Republicans retake the majority in the Senate, Scott would notably be poised to become chairman of the Banking Committee.\nHis team noted Scott is one of the best party fundraisers today, with both major dollar contributions and small dollar donations.\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.\nJulia Johnson is a politics writer for Fox News Digital and Fox Business, leading coverage of the U.S. Senate. She was previously a politics reporter at the Washington Examiner.\nFollow Julia's reporting on X at@JuliaaJohnson_and send tips toJulia.Johnson@fox.com."}, {"title": "'Did not expect that': GOP Rep Luna speaks out after meeting with Biden on hurricane response", "link": "https://www.foxnews.com/politics/did-not-expect-that-gop-rep-luna-speaks-out-after-meeting-biden-hurricane-response", "content": "Sean and Tana Anderson, co-owners of Crescent Beach Market, tell Fox News about the lingering devastation after being slammed by Hurricanes Helene and Milton.\nIt’s not every day that a member of the ultra-conservative House Freedom Caucus sits down to meet with the Democratic commander in chief, but national crises have a way of creating strange bedfellows.\nRep. Anna Paulina Luna, R-Fla., told Fox News Digital she was not expecting a call late last week when her phone screen flashed with an unknown Washington, D.C.-based government number. When she answered, it was President Biden’s voice on the line.\n\"Well, I did not expect that. So I talked to him on the phone for about 10 minutes. First thing that he asked me was, what did I need for my constituents, and how did I fare with the storm. And then [we] moved forward into talking about the issues that we're having with FEMA,\" Luna said.\nThe first-term Republican, whose district was hit hard by Hurricane Milton last week, said she also met with Biden when hesurveyed storm damage in Floridaover the weekend.\nPOLITICAL STORM: ON TRUMP ‘ONSLAUGHT OF LIES,’ BIDEN URGES FORMER PRESIDENT TO ‘GET A LIFE MAN’\nRep. Anna Paulina Luna shared measured praise for President Biden in his handling of Hurricane Milton so far.(Getty Images)\nThe pair met for an \"extensive\" discussion on a number of disaster aid reforms, Luna said.\nIt’s not uncommon to see political foes work together after a natural disaster, but the congresswoman’s praise for Biden is a stark contrast from her fierce criticism of his administration – which she herself noted to Fox News Digital – includingspearheading effortsto hold members of his Cabinet in inherent contempt of Congress.\n\"I have obviously been very critical of President Biden in the past, but I will say that him stepping in and taking control of the situation to assist for the right reasons was very honestly kind of shocking for me,\" Luna said.\nHURRICANE MILTON CARVES DEADLY PATH THROUGH FLORIDA, MILLIONS WITHOUT POWER\n\"Obviously, you know, we're still going to be holding FEMA accountable... But as far as I am seeing, FEMA has been very helpful, and I've been in direct communication with them. And they're absolutely going to assist, because President Biden has told them to do so.\"\nAsked about their in-person conversation, Luna said they talked about the situation in Georgia and North Carolina after Helene battered the American Southeast, as well as Florida’s recovery after both storms.\n\"The one thing that I really wanted to hammer home was obviously, you know, FEMA getting debris cleared and really not holding the cities accountable for not being able to move debris in time,\" Luna said. \"So we sorted that out.\"\nBiden surveyed damage from Hurricane Milton in Florida over the weekend.(Getty Images)\nShe also advocated for reforming the National Flood Insurance Program, which Luna said has been largely unchanged since its inception in the 1960s.\nIn both of their conversations, Luna said Biden agreed with her that FEMA’s $750 upfront payment to disaster survivors was inadequate.\n\"He said it was a ‘bunch of malarkey,’ which is 100% true, and that $750 was not enough,\" Luna said.\nFox News Digital reached out to the White House for further comment.\nCATEGORY 3 MILTON BEARS DOWN ON FLORIDA\nHer measured response to federal relief efforts is notable, given the torrent of GOP-led criticism of the administration’s response efforts.\nIt’s worth noting that Biden also saw praise from the Republican governors of South Carolina, Tennessee and Virginia after the storms.\nOn the federal level, Luna is among the bipartisan chorus of lawmakers calling for Congress to return for an early emergency session to deal with disaster relief – something Biden has also voiced.\nLuna is known for being one of the Biden administrations's most outspoken critics in Congress. She is pictured here leading an effort to hold Attorney General Garland in inherent contempt.(Getty Images)\nBut Speaker Mike Johnson, R-La., has signaled on multiple occasions that he’s unlikely to convene the House before their scheduled return the week after Election Day.\nCLICK HERE TO GET THE FOX NEWS APP\nJohnson, who has criticized the Biden administration’s response, argued that the $20 billion that Congress freed up for FEMA last month would be enough to meet immediate needs, and that lawmakers could do little until a formal damage assessment and cost estimate was provided.\nRep. Chuck Edwards, R-N.C., whose district was among the hardest hit by Helene, echoed Johnson in aninterview Friday.\n\"I believe that what we're seeing right now with the calls to come back into session to pass funds is more of a distraction from the administration for their inept reaction to getting folks here to help western North Carolina,\" Edwards said.\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com"}, {"title": "Harris plays mashup of Trump’s 'enemy within' comments at Erie rally, shortly after crowd chants 'lock him up'", "link": "https://www.foxnews.com/politics/harris-plays-mashup-trumps-enemy-within-comments-erie-rally-after-crowd-chants-lock-him-up", "content": "Fox News correspondent Mark Meredith has the latest on the close polling in the presidential race on 'Special Report.'\nVice President Kamala Harris’ criticisms of former President Trump and her drawing of connections between his agenda and that of the conservative Project 2025 initiative spurred chants at anErie, Pennsylvania, rallyreminiscent of the 2016 White House race.\nShortly after the crowd erupted in \"lock him up\" retorts – similar to Trump rallygoers' reaction to Hillary Clinton’s mishandling of classified communications during the 2016 cycle – Harris played a mashup of clips in which Trump warned of dangers from \"the enemy within.\"\n\"The worst people are the enemies from within... those people are more dangerous; the enemy within; than Russia and China. These people should be put in jail the way they talk about our judges and our justices,\" Trump collectively stated in some of the television clips played.\n\"You heard his words,\"Harris saidafter the montage. \"He's talking about the enemy within, Pennsylvania. He's talking about the enemy within our country, Pennsylvania. He's talking about how he considers anyone who doesn't support him or who will not bend to his will, an enemy of our country. It's a serious issue,\" she said.\nTRENDS ARE GOOD IN SWING COUNTY GOP CHAIR CALLS ‘LITTLE PENNSYLVANIA,’ PREDICTS REPEAT OF 2016\nDemocratic presidential nominee Vice President Kamala Harris speaks during a church service at Koinonia Christian Center in Greenville, N.C., Sunday, Oct. 13, 2024.(AP Photo/Susan Walsh)\nIn recent comments on the matter to Fox Business' Maria Bartiromo, Trump spoke about such \"enemies,\" and quipped that while China and Russia are \"dangerous\" at times to deal with, \"the thing that's tougher to handle are these lunatics that we have inside like Adam Schiff.\"\nSchiff, a congressman from Burbank, Calif., is currently the Democratic nominee for U.S. Senate against Republican retired MLB star Steve Garvey.\nIn Erie, Harris said Trump opened the door to using the military to \"go after\" groups, hypothesizing that they might include journalists critical of him, election officials he clashes with or judges that rule against his will.\nThe Democratic nominee said that, therefore, voting for Trump would be a \"huge risk for America\" and that her GOP opponent is \"increasingly unstable and unhinged.\"\nReached for comment, the Trump campaign rejected her warnings, expressing that it was the\"Harris-Bidenadministration that weaponized our justice system to go after President Trump with trumped-up charges in an effort to silence their political rivals.\"\n\"If Kamala wants to cry about ‘unchecked’ abuse of power, she should look in the mirror,\" said Pennsylvania Team Trump spokesman Kush Desai.\nPA TOWN ROILED BY TALK OF MIGRANT HOUSING IN CIVIL-WAR-ERA ORPHANAGE BUILDING\nMeanwhile, Harris’ preceding comments about the Supreme Court’s presidential immunity ruling in Trump’s favor led to the aforementioned \"lock him up\" chants.\nHarris appeared to sidestep any agreement with such expression, telling the crowd, \"hold on, hold on,\" and advising that they make their voice heard instead at the ballot box.\n\"The courts will handle that. Let's handle November, shall we?\" Harris said.\n\"Look, anybody who said they would terminate the Constitution of the United States should never again stand behind the seal of the President of the United States – never again.\"\nCLICK HERE TO GET THE FOX NEWS APP\nPrior to the rally, Harris stopped at a local business, and was greeted upon arrival in Pennsylvania’s only beachfront city by Democratic Mayor Joe Schember and State Rep. Ryan Bizzarro, D-Erie, according to reports.\nSen. John Fetterman, D-Pa., offered the warm-up speech, and the Democratic nominee was ultimately introduced by Karen Kalivoda, a retired civil servant and Erie native.\nOn the other end of the Commonwealth, Trump was participating in a Pennsylvania town hall hosted by South Dakota Gov. Kristi Noem at an exposition center near King of Prussia.\nCharles Creitz is a reporter for Fox News Digital.\nHe joined Fox News in 2013 as a writer and production assistant.\nCharles coversmedia,politicsand culture for Fox News Digital.\nCharles is a Pennsylvania native and graduated from Temple University with a B.A. in Broadcast Journalism. Story tips can be sent to charles.creitz@fox.com."}, {"title": "Residents explain why they fled the Bay Area: Homelessness was 'just getting out of hand'", "link": "https://www.foxnews.com/media/residents-explain-why-fled-bay-area-homelessness-just-getting-out-hand", "content": "Former President Trump criticized California Gov. Gavin Newsom and Vice President Kamala Harris at a rally in Coachella Valley, Cali., Saturday.\nFormer residents report having found better quality and cost of living outside the Bay Area, where homelessness and housing prices have skyrocketed.\n\"It's a challenging place to live — the most expensive metro area in the country for consumer prices and buying a home. In a recent poll of Bay Area residents, nearly half said they were considering leaving in the next few years,\" the East Bay Timesreported.\nOne family who left the Bay Area to live in Idaho said that homelessness had become a problem.\n\"Thehomeless situationin downtown Martinez was just getting out of hand,\" Ken Freeze told the Times.\n(Nearly half of Bay Area residents considered leaving the city due to rising costs and costs of living, according to a report.)\n\"Beautiful Marina Park was just littered with needles. People didn't want to take their families down there,\" he added.\nMASK MANDATES RETURN FOR HEALTH CARE FACILITIES IN DEEP BLUE STATE\nIn 2005, Freeze and his wife bought several acres of land in Placerville, California, with plans to retire.\n\"But by the time retirement rolled around, the state had changed too much for them,\" the Times reported.\nPer the Times, \"They decided to swap out the foothills of the Sierra Nevada for the foothills in Idaho, and move to Meridian, a fast-growing suburb of Boise. They'd first traveled there in August 2017 for the total solar eclipse, and were struck by the good condition of the roads and how affordable the homes were.\"\nBut the Freezes weren't the only ones attracted to the area.\nGov. Gavin Newsom is trying to crack down on homelessness, cleaning up trash and threatening to strip municipalities of funding if they do not take action against the issue.(AP Photo/Steven Senne)\n\"In the short time we've been here, areas that when we first moved here were just open fields are now apartment complexes and buildings,\" Freeze told the East Bay Times. \"I'd just like to see them pull back the reins a little bit and let the infrastructure take a breath.\"\nWHY TRUMP IS HEADED INTO 'THE BELLY OF THE BEAST': THE STRATEGY BEHIND HIS BLUE STATE STOPS\nAnother Bay Area couple felt the housing squeeze and saw prices elsewhere \"too good to pass up.\"\nThey found a house in Phoenix they loved and \"now pay less for their mortgage than they did for their one-bedroom in San Bruno.\"\nAs the Times reported, \"It came with a pool, palm trees and a view of the mountains. 'You can't get all that in California anymore, unless you're Elon Musk,' [Jared] Troutman joked.\"\nA family from Oakland moved to the South due to the area feeling like a \"third-world country.\"\n\"I didn't want to wait until everything got worse than it already was,\" Mary Ezell-Wallas said.\nOakland Homeless encampment(Getty Images)\n\"Living in Oakland was stressful every day and night,\" she said.\nCLICK HERE TO GET THE FOX NEWS APP\nShe explained further, \"It's so much better down here.\"\nEzell Wallace, a resident of Oakland for nearly four decades, ran a beauty parlor in the 90s. She said Oakland had good shopping downtown back then.\n\"We could get anything we wanted real fast,\" Ezell-Wallace said.\nShe added, \"I thought Oakland was one of the greatest places there was.\"\nJoshua Q. Nelson is a reporter for Fox News Digital.\nJoshua focuses on politics, education policy ranging from the local to the federal level, and the parental uprising in education.\nJoining Fox News Digital in 2019, he previously graduated from Syracuse University with a degree in Political Science and is an alum of the National Journalism Center and the Heritage Foundation's Young Leaders Program.\nStory tips can be sent to joshua.nelson@fox.com and Joshua can be followed onTwitterandLinkedIn."}, {"title": "Tim Walz boasts about having support of Dick Cheney, Bernie Sanders, Taylor Swift during Wisconsin rally", "link": "https://www.foxnews.com/politics/tim-walz-boasts-about-having-support-dick-cheney-bernie-sanders-taylor-swift-during-wisconsin-rally", "content": "The rally comes just three weeks before the U.S. Presidential Elections.\nMinnesota Gov. Tim Walz held a rally in Green Bay, Wisconsin, on Monday to shore up support just three weeks before thepresidential election.\nWhile warning the crowd about what he said is at stake ifformer President Trumpwere to take back the White House, the vice presidential candidate bragged about the unorthodox trio of supporters backing the Harris-Walz ticket.\n\"The road to theSuper Bowl,the road to control of the Senate, and the road to the White House, goes right through the NFC North, Michigan, Wisconsin and Minnesota. Look, you had a Lions fan, a Packers fan and a Vikings fan up here,\" Walz said, referring to Michigan Gov. Gretchen Whitmer, Wisconsin Gov. Tony Ivers, and himself. \"The only thing more amazing is we got Bernie Sanders, Dick Cheney and Taylor Swift on the same ticket.\"\nCheney, who was vice president to former President George W. Bush, was vilified by Democrats for his hawkish defense of the Iraq War. But last month, Cheney made the stunning announcement that he planned to vote for Kamala Harris as president.\nTRUMP ALLY TIM SCOTT MULLS BID FOR TOP ROLE AT SENATE CAMPAIGN ARM\nDemocratic vice presidential nominee Minnesota Gov. Tim Walz speaks at a campaign event on Monday, Oct. 14, 2024, in Green Bay, Wis.(AP Photo/Jeffrey Phelps)\nTaylor Swift also announced her endorsement of Harris last month, just minutes after the presidential debate between the two candidates.\nWalz used his speech in Green Bay on Monday to hash out a list of grievances against Trump and his running mate JD Vance, who he debated earlier this month.\nTaylor Swift arrives before the start of an NFL football game between the Kansas City Chiefs and the New Orleans Saints on Monday, Oct. 7, 2024, in Kansas City, Mo.(AP Photo/Charlie Riedel)\nTRENDS ARE GOOD IN THE SWING COUNTY GOP CHAIR CALLS ‘LITTLE PENNSYLVANIA’: IT'LL ‘BE A REPEAT OF ’16'\nWalz attacked Trump’s mental acuity and age, alleging that the former commander-in-chief has \"been forgetting things.\"\n\"He’s confused. He’s a nearly 80-year-old man. He’s ranting and rambling until people get bored and leave his rallies,\" Walz said.\nTim Walz slammed Donald Trump for his age.(Reuters)\nWalz appealed to men who were on the fence about who they planned to vote for.\n\"I’m going to make a message to the guys here. You got any women you love in your life? Your wives, your daughters, your mothers, and friends? Let’s not forget their lives are literally at stake in this election,\" Walz said, invoking Trump’s appointment of threeSupreme Court Justiceswho were instrumentally in overturning Roe v. Wade.\n\"He brags about it. He’s glad my daughter Hope now has fewer rights than her mother had,\" Walz said. \"That’s what he’s bragging about.\"\nCLICK HERE TO GET THE FOX NEWS APP\nWalz ended his speech by imploring the crowd to vote for Harris, likening them to the \"underdogs.\"\n\"For Christ’s sake, I’m a Vikings fan,\" Walz quipped. \"We’re always the underdogs.\"\nBradford Betz is a Fox News Digital breaking reporter covering crime,political issues,and much more."}, {"title": "User’s manual on what House races to watch on Election Night", "link": "https://www.foxnews.com/politics/users-manual-what-house-races-watch-election-night", "content": "Fox News senior congressional correspondent Chad Pergram breaks down the battle for control of the House on ‘Fox News @ Night.’\nIt’s pretty clear which states to watch to know whether Democrats or Republicans willcontrol the Senate. Contests in Ohio, Montana, Michigan, Arizona, Nevada, Wisconsin and Pennsylvania are all battlegrounds. But it’s a different story to understanding which might control the House.\nThe path to power isn’t direct in the House.\nA patchwork of districts – hopscotching from northern Maine to the tundra of Alaska – might decide the House majority.\nSo on election night, let me decode the signs to interpret which party may serve inthe House majorityin 2025.\nREPORTER'S NOTEBOOK: WITH NO GOVERNMENT SHUTDOWN, IT FEELS LIKE CHRISTMAS IN SEPTEMBER\nPresident Biden delivers his State of the Union address in the House Chamber of the U.S. Capitol on Thursday, March 7, 2024.(Tom Williams/CQ-Roll Call, Inc via Getty Images)\nIt’s about the math.\nLet’s begin with the current breakdown in the House.\nThere are presently 432 House members. 220 Republicans and 212 Democrats. There are three vacancies.\nLate Reps. Sheila Jackson Lee, D-Tex., and Bill Pascrell, D-N.J., died. Former Rep. Mike Gallagher, R-Wisc., resigned. None of theseare swing districts. So, if the House were at full membership with 435 seats, the breakdown would be 221 Republicans to 214 Democrats. The margin is seven. But Democrats only need a net gain of four seats to capture control. Also, note that some districts have morphed – especially in North Carolina – due to redistricting. In fact, Republicans could gain several seats there alone.\nSo here’s the charge for Democrats: hold seats they currently have – and pluck off a handful of seats as they skip around the map. Also, make up the difference from what they will likely lose in the Tar Heel State. This is not a comprehensive list. But it will provide a general feel for the evening.\nHere’s an early race to watch which could give a you a clue as to the direction of the House: Maine’s 2nd District.\nA patchwork of districts – hopscotching from northern Maine to the tundra of Alaska – might decide the House majority.(Aaron Schwartz/Middle East Images/AFP via Getty Images)\nRep. Jared Golden, D-Maine, faces Republican challenger andformer NASCAR driverAustin Theriault. This is a massive, rugged, rural district which stretches north to the Canadian border. Golden is one of the most moderate – and vulnerable Democrats in the House. Former President Trump won the singular electoral vote by carrying this district in 2020. Maine employs a proportional system to divide its electoral votes.\nIf Golden holds this seat, that could serve as an early canary in the coal mine indicating that Democrats are in good shape. But if Theriault prevails, that might signal the House could drift the other direction.\nTRUMP CAMPAIGN HINTS AT ELECTION DAY TRANSPORTATION OPTIONS FOR VOTERS IMPACTED BY HURRICANES HELENE, MILTON\nPolitical analysts believethat Democrats lostthe House in New York in 2022. That’s ironic because the former chairman of the Democrats reelection efforts two years ago, former Rep. Sean Patrick Maloney, D-N.Y., hailed from New York. House Minority Leader Hakeem Jeffries, D-N.Y., is from Brooklyn. That’s to say nothing of Senate Majority Leader Chuck Schumer, D-N.Y.\nEmpire State Democrats have an opportunity to make significant inroads if they perform well in House races this year. The fact that it’s a presidential election could also bolster Democratic performance in New York. Democrats already won back the seat occupied by formerRep. George Santos, R-N.Y., - who was expelled. But Democrats are angling to defeat freshman Reps. Anthony D’Esposito, R-N.Y., Mike Lawler, R-N.Y., Marc Molinaro, R-N.Y., and Nick LaLota, R-N.Y. A clean sweep in the early returns sends a message that Democrats are performing substantially well on the evening of November 5. Democrats will be disappointed if they don’t capture at least three of these seats.\nVirginia is also a place where both parties have pickup opportunities. A sweep by either side could reveal the overall direction of the night.\nFreshman Rep. Jen Kiggans, R-Va., faces Democratic challenger Missy Cotter Smasal in the Tidewater area. Rep. Abigail Spanberger, D-Va., is retiring to run for governor next year. Democrat Eugene Vindman faces Republican Derrick Anderson to succeed Spanberger. The parties could split these races, making Virginia a wash.\nRep. Jen Kiggans, R-Va., attends a press conference with Republican leadership on Capitol Hill on September 18, 2024, in Washington, D.C.(Win McNamee/Getty Images)\nVeteran Rep. Marcy Kaptur, D-Ohio and freshman Rep. Emilia Sykes, D-Ohio, are bothdefending battleground districtsin a state which should go overwhelmingly for Mr. Trump. The fact that Republican Vice Presidential nominee and Sen. JD Vance, R-Ohio, hails from the Buckeye State could influence voter turnout. It’s a boon if Republicans are able to topple either Kaptur or Sykes. And Republicans could be looking at a grand slam if both Democrats lose. However, Kaptur is the longest-tenured woman in House history. Republicans have been trying to defeat her for years. It’s far from clear that they can do so this year.\nDemocrats also have a shot at winning a redrawn seat in Alabama. A federal court decided that Alabama violated the Voting Rights Act by packing Black voters into a single majority Black district. The court ruled that Alabama must retool its Congressional maps, making what was once a Republican district into one favoring Democrats. Shomari Figures hopes to capture that district for the Democrats.\nIn Iowa, Democrats are eyeing two seats – although winning either may be a stretch. One seat pits Democrat Lanon Baccam against Rep. Zach Nunn, R-Iowa. Democrats also hope Christina Bohannan can unseat sophomore Rep. Mariannette Miller-Meeks, R-Iowa. Miller-Meeks squeaked out a victory in 2020 by just six votes. But Miller-Meeks won by seven points in 2022. Democrats would be fortunate to knock off either Nunn or Miller-Meeks. But they definitely believe Bohannan has a bona fide shot at toppling Miller-Meeks.\nIn Colorado, Rep. Yadira Caraveo D-Colo., won her first term by about 2,000 votes. She’s up against Republican challenger Gabe Evans. But it’s believed a strong showing at the top of the ticket in blue Colorado could help Caraveo.\nTRUMP ALLY TIM SCOTT MULLS BID FOR TOP ROLE AT SENATE CAMPAIGN ARM\nIn New Mexico, Freshman Rep. Gabe Vasquez, D-N.M. is in a rematch with former Rep. Yvette Harrell, R-N.M. This district is one of the swingiest in the country and bears watching. Former Rep. Xochitl Torres Small, D-N.M.,flipped this districtin 2018 after former Rep. Steve Pearce, R-N.M., ran for governor. Harrell then defeated Torres Small in 2020. However, Vasquez flipped the district back to the Democrats in 2022. Harrell hopes to return the favor this fall.\nBesides New York, California is where Democrats also hope to make up significant ground. It doesn’t hurt that the Democratic nominee for President used to represent the Golden State in the Senate and served as its attorney general. Moreover, a Senate race could boost Democratic turnout. Rep. Adam Schiff, D-Calif., is running against former Los Angeles Dodgers and San Diego Padres star Steve Garvey.\nDemocrats hope to unseat Reps. John Duarte, R-Calif., David Valadao, R-Calif., Mike Garcia, R-Calif., Ken Calvert, R-Calif., and Michelle Steel, R-Calif. They each represent battleground districts. Duarte won his race in an upset last cycle by fewer than 600 votes. Democrats unseated Valadao in 2018. But he returned to Congress in 2020.\nAlso, three other races could indicate whether it’s a Democratic or Republican night.\nIn Oregon, Freshman Rep. Lori Chavez-Deremer, R-Ore., runs against Democrat Janelle Bynum. Bynum has defeated Chavez-Deremer in previous contests for the statehouse. If Chavez-Deremer holds on, that could flash as a positive sign for the GOP.\nJanelle Bynum is a Democrat running for Congress in Oregon.(Janelle Bynum for Congress)\nMeantime, Freshman Rep. Marie Gluesenkamp Perez, D-Wash., was the biggest upset of the last election cycle. She eked out a victory over Republican Joe Kent by about 2,000 votes. Gluesenkamp Perez and Kent face off again. The district was Republican prior to last cycle. But it’s believed Kent veered too far toward the right, courting former President Trump and pro-MAGA forces. This race could be a bellwether to distill just how well the MAGA message resonates.\nFinally, control of the House could hinge on Alaska.\nRep. Mary Peltola, D-Alaska, won this at-large seat after Rep. Don Young, R-Alaska died in 2022. Young represented the state in the House for nearly half a century. However, Peltola has never been on the ballot at the same time as former President Trump. Mr. Trump defeated President Biden by ten points here in 2020.\nCLICK HERE TO GET THE FOX NEWS APP\nIf Peltola prevails, that victory on solid GOP turf could go a long way toward Democrats flipping the House.\nBut, because so many of these races might be tight, it may be impossible to divine which party controls the House for a while. Two years ago, it took until mid-November.\nChad Pergram currently serves as a senior congressional correspondent for FOX News Channel (FNC). He joined the network in September 2007 and is based out of Washington, D.C."}, {"title": "'Did not expect that': GOP Rep Luna speaks out after meeting with Biden on hurricane response", "link": "https://www.foxnews.com/politics/did-not-expect-that-gop-rep-luna-speaks-out-after-meeting-biden-hurricane-response", "content": "Sean and Tana Anderson, co-owners of Crescent Beach Market, tell Fox News about the lingering devastation after being slammed by Hurricanes Helene and Milton.\nIt’s not every day that a member of the ultra-conservative House Freedom Caucus sits down to meet with the Democratic commander in chief, but national crises have a way of creating strange bedfellows.\nRep. Anna Paulina Luna, R-Fla., told Fox News Digital she was not expecting a call late last week when her phone screen flashed with an unknown Washington, D.C.-based government number. When she answered, it was President Biden’s voice on the line.\n\"Well, I did not expect that. So I talked to him on the phone for about 10 minutes. First thing that he asked me was, what did I need for my constituents, and how did I fare with the storm. And then [we] moved forward into talking about the issues that we're having with FEMA,\" Luna said.\nThe first-term Republican, whose district was hit hard by Hurricane Milton last week, said she also met with Biden when hesurveyed storm damage in Floridaover the weekend.\nPOLITICAL STORM: ON TRUMP ‘ONSLAUGHT OF LIES,’ BIDEN URGES FORMER PRESIDENT TO ‘GET A LIFE MAN’\nRep. Anna Paulina Luna shared measured praise for President Biden in his handling of Hurricane Milton so far.(Getty Images)\nThe pair met for an \"extensive\" discussion on a number of disaster aid reforms, Luna said.\nIt’s not uncommon to see political foes work together after a natural disaster, but the congresswoman’s praise for Biden is a stark contrast from her fierce criticism of his administration – which she herself noted to Fox News Digital – includingspearheading effortsto hold members of his Cabinet in inherent contempt of Congress.\n\"I have obviously been very critical of President Biden in the past, but I will say that him stepping in and taking control of the situation to assist for the right reasons was very honestly kind of shocking for me,\" Luna said.\nHURRICANE MILTON CARVES DEADLY PATH THROUGH FLORIDA, MILLIONS WITHOUT POWER\n\"Obviously, you know, we're still going to be holding FEMA accountable... But as far as I am seeing, FEMA has been very helpful, and I've been in direct communication with them. And they're absolutely going to assist, because President Biden has told them to do so.\"\nAsked about their in-person conversation, Luna said they talked about the situation in Georgia and North Carolina after Helene battered the American Southeast, as well as Florida’s recovery after both storms.\n\"The one thing that I really wanted to hammer home was obviously, you know, FEMA getting debris cleared and really not holding the cities accountable for not being able to move debris in time,\" Luna said. \"So we sorted that out.\"\nBiden surveyed damage from Hurricane Milton in Florida over the weekend.(Getty Images)\nShe also advocated for reforming the National Flood Insurance Program, which Luna said has been largely unchanged since its inception in the 1960s.\nIn both of their conversations, Luna said Biden agreed with her that FEMA’s $750 upfront payment to disaster survivors was inadequate.\n\"He said it was a ‘bunch of malarkey,’ which is 100% true, and that $750 was not enough,\" Luna said.\nFox News Digital reached out to the White House for further comment.\nCATEGORY 3 MILTON BEARS DOWN ON FLORIDA\nHer measured response to federal relief efforts is notable, given the torrent of GOP-led criticism of the administration’s response efforts.\nIt’s worth noting that Biden also saw praise from the Republican governors of South Carolina, Tennessee and Virginia after the storms.\nOn the federal level, Luna is among the bipartisan chorus of lawmakers calling for Congress to return for an early emergency session to deal with disaster relief – something Biden has also voiced.\nLuna is known for being one of the Biden administrations's most outspoken critics in Congress. She is pictured here leading an effort to hold Attorney General Garland in inherent contempt.(Getty Images)\nBut Speaker Mike Johnson, R-La., has signaled on multiple occasions that he’s unlikely to convene the House before their scheduled return the week after Election Day.\nCLICK HERE TO GET THE FOX NEWS APP\nJohnson, who has criticized the Biden administration’s response, argued that the $20 billion that Congress freed up for FEMA last month would be enough to meet immediate needs, and that lawmakers could do little until a formal damage assessment and cost estimate was provided.\nRep. Chuck Edwards, R-N.C., whose district was among the hardest hit by Helene, echoed Johnson in aninterview Friday.\n\"I believe that what we're seeing right now with the calls to come back into session to pass funds is more of a distraction from the administration for their inept reaction to getting folks here to help western North Carolina,\" Edwards said.\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com"}, {"title": "Trump ally Tim Scott mulls bid for top role at Senate campaign arm", "link": "https://www.foxnews.com/politics/trump-ally-tim-scott-mulls-bid-top-role-senate-campaign-arm", "content": "GOP Senate nominee in Pennsylvania, Dave McCormick, tells Fox News Digital that while he strongly supports former President Trump, he's also ‘shown my independence.’\nSen. Tim Scott, R-S.C., is considering running for the top role at the National Republican Senatorial Committee (NRSC) for the next election cycle.\nA spokesperson for Scott confirmed to Fox News Digital in a statement that the senator is looking into running for the position.\n\"The Senator is grateful for the encouragement he has received from colleagues to run for chair of the NRSC,\" said Scott spokesperson Nathan Brand. \"He is working tirelessly to send Donald Trump back to the White House and take the U.S. Senate, then looks forward to growing the Republican majority in 2026.\"\n'DON'T EVEN KNOW WHO HE IS': WISCONSINITES TALK HARRIS' MIDWESTERN RUNNING MATE, TIM WALZ\nSen. Tim Scott waves as he sits with former President Trump, during a Fox News town hall on Feb. 20, 2024, in Greenville, South Carolina.(Justin Sullivan/Getty Images)\nSens. Thom Tillis, R-N.C., John Cornyn, R-Texas, and Susan Collins, R-Maine, are up for re-election in 2026.\nWith North Carolina's recentpolling and electoral moves toward Democrats, Tillis' seat could become more expensive to defend for Republicans.\nLEAD COUNSEL HITS NEW DEM EFFORT TO 'DELEGITIMIZE' SUPREME COURT AMID SENATOR'S REPORT ON KAVANAUGH PROBE\nSen. Thom Tillis departs from a luncheon with Senate Republicans at the U.S. Capitol on June 1, 2023.(Anna Moneymaker/Getty Images)\nAs for Cornyn, hecould face primary challengesfrom other Republicans who have criticized him. Texas Attorney General Ken Paxton hinted at potentially running against the senator in asocial media postearlier this year.\nCollins notably survived her last re-election race, pulling off a shock split-ticket victory despite running alongside Trump. Her seat will likely be seen as a top pickup opportunity for Democrats.\nALSOBROOKS BACKS COURT-PACKING AS HOGAN FIGHTS GOP, MCCONNELL, TRUMP ASSOCIATIONS\nThe U.S. Capitol(Celal Gunes/Anadolu Agency via Getty Images)\nThere are also potential opportunities for Republicans to challenge Democrats in 2026, with Sens. Jon Ossof, D-Ga., and Gary Peters, D-Mich.\nScott is currently traveling to swing states ahead of the November election and campaigning to ensure Republicans regain the Senate majority in 2025. He has traveled to both Nevada and Wisconsin and is headed soon to Michigan, Ohio and Pennsylvania.\nFOR WISCONSIN DEMS, A 2024 WIN IN THE BATTLEGROUND STATE IS YEARS IN THE MAKING\nSen. Tim Scott speaks alongside former President Trump during a campaign event in Concord, New Hampshire, on Jan. 19, 2024.(Al Drago/Bloomberg via Getty Images)\nA super PAC aligned with the South Carolina Republican is additionally spending seven figures in battleground states in order to further help the GOP. Scott has helped raise six figures for the 2024 Senate campaigns, according to his team.\nCLICK HERE TO GET THE FOX NEWS APP\nIf Republicans retake the majority in the Senate, Scott would notably be poised to become chairman of the Banking Committee.\nHis team noted Scott is one of the best party fundraisers today, with both major dollar contributions and small dollar donations.\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.\nJulia Johnson is a politics writer for Fox News Digital and Fox Business, leading coverage of the U.S. Senate. She was previously a politics reporter at the Washington Examiner.\nFollow Julia's reporting on X at@JuliaaJohnson_and send tips toJulia.Johnson@fox.com."}, {"title": "Top House committee launches probe into Biden admin 'priorities' on FEMA hurricane relief, migrant spending", "link": "https://www.foxnews.com/politics/top-house-committee-probing-biden-admin-priorities-disaster-relief-amid-migrant-spending", "content": "Fox News contributors Mollie Hemingway and Leslie Marshall discuss the Biden administration’s response to Hurricane Milton on ‘Media Buzz.’\nFIRST ON FOX: Republicans on theHouse Homeland Security Committeeare investigating the Department of Homeland Security's \"priorities\" for its request for funding from Congress, amid an ongoing controversy over spending on illegal migrants and disaster relief.\n\"The Committee on Homeland Security…is investigating [DHS’] prioritization of its ability to adequately respond to natural disasters,\" lawmakers on the committee said in a letter to DHS Secretary Alejandro Mayorkas.\nThe letter comes after Mayorkas, amid hurricanes in North Carolina and Florida, warned that theFederal Emergency Management Agency (FEMA)does not have stable funding for the hurricane season, although he stressed that they do have enough for immediate needs. The administration has urged Congress to pass a supplemental spending bill.\nMAYORKAS DOUBLES DOWN, HAMMERS ‘PERNICIOUS’ MISINFORMATION AMID FEMA CRITICISM\nHomeland Security Secretary Alejandro Mayorkas speaks Tuesday, Oct. 1, 2024 during a briefing at the White House in Washington, D.C.(AP Photo/Mark Schiefelbein)\n\"We have the immediate needs right now. On a continuing resolution, we have funds, but that is not a stable source of supply, if you will,\" he said earlier this month. \"This is a multibillion-dollar, multiyear recovery.\nAmid those calls for more funding for the Disaster Relief Fund (DRF), conservatives have pointed to grants administered by FEMA for non-profits and local communities receiving illegal immigrants during the historic border crisis. The funding this year consists of $650 million, using funding moved over from Customs and Border Protection.\nThe roof of the Tropicana Field is damaged the morning after Hurricane Milton hit the region on Thursday, Oct. 10, 2024 in St. Petersburg, Florida.(AP Photo/Mike Carlson)\nDHS has noted repeatedlythat that funding is congressionally appropriated and is a separate funding channel from the Disaster Relief Fund, which has not been affected by the funding for migrants. It has pushed back against some claims by conservatives that disaster money has been taken andused on migrants.\nSENATORS FEAR FEMA ‘ENTANGLEMENT’ WITH BORDER CRISIS COULD HURT DISASTER RESPONSE MISSION\n\"These claims are completely false,\" a DHS spokesperson previously told Fox News Digital. \"As Secretary Mayorkas said, FEMA has the necessary resources to meet the immediate needs associated with Hurricane Helene and other disasters. The Shelter and Services Program (SSP) is a completely separate, appropriated grant program that was authorized and funded by Congress and is not associated in any way with FEMA’s disaster-related authorities or funding streams.\"\nThe Republican lawmakers acknowledge that the funding streams are separate but note that Congress has met or exceeded budget requests for disaster relief with $61.2 billion for the DRF in FY 23 and FY 24.\n\"The Committee, however, is troubled that the Department and FEMA may not have properly apprised Congress of its need for additional disaster relief funds while simultaneously requesting large sums of monies to fund FEMA’s Shelter and Services Program (SSP), a grant program to fund nonfederal entities for shelter and services provided to migrants encountered by the Department, including illegal aliens,\" they say.\nThe lawmakers say that FEMA has disbursed more than $1.4 billion through both the SSP and a previous Emergency Food and Shelter Program for humanitarian aid. (EFSP-H).\nCLICK HERE FOR MORE COVERAGE OF THE BORDER SECURITY CRISIS\n\"Meanwhile, $344 million, an only slightly greater amount, has been spent on federal assistance for the communities impacted by Hurricane Helene,\" they say.\n\"While the Committee understands that there is no intermingling of funds between the DRF and SSP, the Department’s priorities for limited resources provided by taxpayers to the Department should first and foremost serve Americans,\" they add.\nThe committee is seeking all documents and communications from FEMA and DHS on funding for SSP and EFSP-H, as well as the DRF, and anything identifying those entities that have received grants.\nCLICK HERE TO GET THE FOX NEWS APP\nIt is the latest Republican grilling on the matter.A group of GOP senatorslast week wrote to the administration asking if a \"continued entanglement in DHS’s efforts to respond to the border crisis could impact its readiness and emergency response mission.\"\nThey also say that budget requests to Congress asked it to continue funding FEMA’s border-related work. \"FEMA’s efforts responding to the border crisis could have been much more limited if your Administration would have instead used your authorities to secure the border.\"\nAdam Shaw is a politics reporter for Fox News Digital, primarily covering immigration and border security.\nHe can be reached atadam.shaw2@fox.comor onTwitter."}, {"title": "Harris' media blitz was a 'massive missed opportunity' to disrupt razor-thin race: MSNBC column", "link": "https://www.foxnews.com/media/harris-media-blitz-massive-missed-opportunity-disrupt-razor-thin-race-msnbc-op-ed-says", "content": "CNN data reporter Harry Enten revealed that former President Donald Trump is expected to garner a \"historic\" number of Black and Hispanic voters in November.\nVice President Kamala Harris'recent media blitz was a \"massive missed opportunity\" to shift the trajectory of the razor-thin race, a column published Monday for MSNBC argued.\nHarris sat down for several interviews last week, after facing weeks of scrutiny from voters and the press calling on her tobe more transparentabout her policies and her record. In a new opinion piece for MSNBC, politics writer Alexander Nazaryan ripped the VP's strategy,writing that\"The plan for the vice president's campaign press blitz seemed to be: 'Talk to everyone and say nothing.'\"\nHarris took tough questions on \"60 Minutes,\" but faced farfriendlier environmentson \"The View\" and other venues on her press tour. She was hailed as \"the next President of the United States\" on the ABC talk show; cracked open beers withDemocratic fundraiserStephen Colbert on \"The Late Show;\" and talked about her exercise routine with fawning radio host Howard Stern last week.\nNazaryan questioned if these \"buddy-buddy\" media appearances would move the needle for undecided voters in swing states.\nVice President Kamala Harris was criticized for dodging questions and saying \"nothing\" in her recent media blitz.(AP/Ross D. Franklin)\nTIME MAGAZINE OWNER TAKES KAMALA HARRIS TO TASK FOR DENYING INTERVIEW REQUESTS: ‘WE BELIEVE IN TRANSPARENCY’\n\"And that is the problem: The Harris campaign conducted this tour not because it had something new to say, but because it needed to redirect the media narrative about its candidate,\" Nazaryan, a former White House correspondent for Yahoo News, wrote.\n\"As themedia tourcame to a close with a Univision town hall on Thursday night, I was left with the same vague impression I had before the press tour — which makes that tour a massive missed opportunity,\" he continued.\nThe Harris campaign's strategy of \"running out the clock\" with less than a month to go until the election \"may not be an option,\" as some polls in swing states show the raceshifting awayfrom Harris, Nazaryan argued.\nVice President Kamala Harris criticized former President Trump for not giving an interview to \"60 Minutes\" in advance of the election.(Getty Images)\nAdditionally, a trio ofnew national pollsindicate that former President Trump may have erased the gains made by Harris in recent months after replacing President Biden at the top of the Democratic ticket.\nTRUMP-VANCE TICKET HAS DONE COMBINED 76 INTERVIEWS SINCE AUGUST COMPARED TO 41 FOR HARRIS-WALZ\nDuring her media appearances last week, Harris told viewers that abortion rights and democracy would be on the line if Trump returned to the White House. Nazaryan said these arguments would fall on deaf ears to voters who were not already firmly in Harris' camp, such as swing voters, who view the economy as their No. 1 issue.\nVoters are looking for a \"change\" candidate, he argued, but Harris has not proven that she's that candidate, he said.Harris even told \"The View\"that she can't think of anything that she would've done differently from Biden since he's been in office.\n\"For what it’s worth, I still think Harris will squeak it out. But if she doesn’t, her inability to fearlessly say who she is and what she believes will be one of the reasons. And even if she does, she will likely face a Congress where both chambers are controlled by Republicans. There will be no avoiding difficult conversations with GOP leaders who are going to be a lot less understanding than Joy Behar,\" he wrote.\nWhoopi Goldberg introduced Kamala Harris as the \"next President of the United States\" when she visited the set on October 8, 2024.(ABC/The View)\nWhile the Harris-Walz campaign has increased its media appearances over the past month, the Democratic ticket still lags behind the Republican ticketin the number of interviewstaken since the Democratic ticket was formed.\nHarris will sit down for an interviewwith Fox News' Bret Baierto air on the network on Wednesday.\nFox News' Brian Flood contributed to this article.\nCLICK HERE TO GET THE FOX NEWS APP\nKristine Parks is an associate editor for Fox News Digital. Read more."}, {"title": "Hurricane-hit battleground states face additional voting hurdles in run-up to Election Day", "link": "https://www.foxnews.com/politics/hurricane-hit-battleground-states-could-see-additional-hurdles-ahead-election-day", "content": "Fox News' Madison Scarpino on how residents in Asheville, North Carolina are trying to return to normal after the storm devastated the area.\nVoters in storm-ravaged parts of the Southeast could face new hurdles at the ballot box this year following the destruction wrought by Hurricanes Helene and Milton, back-to-back disasters that have sparked a flurry of new outreach from states, parties, and even campaigns themselves in abid to expand voters' accessto the polls and ensure their votes are counted.\nThough the efforts in the hurricane-hit southern states have taken very different shapes, the shared goal is to increase engagement and participation in the2024 presidential race,in which candidates Kamala Harris and Donald Trump remain locked in a virtual dead heat with less than a month until Election Day.\nIn North Carolina, efforts have been focused on helping displaced residents access polling locations in the wake of Hurricane Helene, which barreled onto shore last month as a Category 4 storm,killing more than 220 peopleand causing billions of dollars in destruction.\nThe bulk of the storm's destruction was concentrated in western North Carolina and in Georgia, two competitive states that could play a key role in determining the next president. Roughly 17% of North Carolina’s registered voters reside in the counties that were designated as disaster areas in the aftermath of Helene,Michael Bitzer,a professor of politics and history at Catawba College, previously told Fox News.\n'CAN'T WAIT TILL THE LAST MINUTE': NC CONGRESSMAN RAISES ALARM ON VOTER ACCESS IN AREAS HARD HIT BY HELENE\nFEMA Administrator Deanne Criswell speaks during a news conference at the White House.(Al Drago/Bloomberg via Getty Images)\nTo that end, the North Carolina State Board of Elections voted last week toapprove changes for 13 countiesin the region, whose access to infrastructure, polling locations and postal services is believed to remain \"severely disrupted\" through Election Day. State election officials alsoannounced coordinationwith FEMA and North Carolina Emergency Management to set up portable restrooms, generators and trailers to support the more than 500 polling places in the state's western region — and an area of devastation that spans some 25 counties.\nMeanwhile, the Trump campaign also hinted at new efforts to help transport voters to the ballot boxes in hurricane-hit states. Speaking to Fox News in an interview Monday, Trump campaign press secretary Karoline Leavitt said the campaign has been in contact with state and local election officials in the Southeast to survey the damage and ensure voters have access to the ballots.\nThe campaign leadership, she said \"has sent a letter \"to state and local officials on the ground in North Carolina saying, ‘You need to provide as many accessible voting locations as possible on the ground,'\" Leavitt told Fox News, adding: \"Our campaign is reviewing how we can possibly provide transportation for voters who need to get to the polls and ensuring they have access to the ballot box.\"\nIn Florida, which was battered by both Hurricanes Helene and Milton, Gov. Ron DeSantis issued an executive order granting election officials in hard-hit counties additional flexibility to alter their election procedures — including polling locations and requests for mail-in ballot addresses to be changed at the last minute.\nMeanwhile, Democrats suffered a blow in Georgia last week after a federal judge ruled that she will not order the state to reopen its voter registration process or extend its voter registration deadline in the aftermath of Hurricane Helene, rejecting arguments from the Georgia conference of the NAACP, the Georgia Coalition of the People's Agenda, and the New Georgia Project, which said disruptions from the storm had unfairly deprived them of their right to register.\nThe ruling could have a major impact in Georgia, a key battleground state that narrowly selected Biden by just 12,000 votes in 2020. (A federal judge in Florida also rejected a similar request brought in the wake of Hurricanes Helene and Milton, filed by the Florida chapter of the League of Women Voters.)\nFederal judges in both states claimed that voters had ample time to register for the November election.\nBiden speaks to reporters in front of damage from Hurricane Milton in Florida.(Getty Images)\nCLICK HERE TO GET THE FOX NEWS APP\nIt is unclear what — or if — the Harris campaign is providing in terms of transport or options for voters in North Carolina or other states that were impacted by the natural disasters, or what specific actions might be taken by Trump's campaign.\nCampaign officials did not respond to Fox News' request for comment.\nBreanne Deppisch is a politics reporter for Fox News Digital covering the 2024 election and other national news."}, {"title": "NBC polling analyst says Kamala Harris' 5-point advantage in previous poll is 'gone'", "link": "https://www.foxnews.com/media/nbc-polling-analyst-says-kamala-harris-5-point-advantage-previous-poll-gone", "content": "NBC's Steve Kornacki did a deep dive into recent polling, saying that Kamala Harris' fortunes have 'completely reversed' since previous polls, and now is in a dead heat with Donald Trump.\nNBC national political correspondent Steve Kornacki said that some polling numbers for Vice President Kamala Harris have \"completely reversed\" in recent days.\nHarris was once touted by many of her supporters as the inevitable winner of the 2024 election, but with less than a month before the election, the raceappears to be a dead heat. NBC \"Today\" host Savannah Guthrie discussed how recent polling shows the race \"deadlocked.\"\nGuthrie then did a deep dive on the numbers with Kornacki and said, \"I mean, the top line is the 5-point advantage that Kamala Harris had in our last poll is gone. What’s behind that shift?\"\nGuthrie did a deep dive on polling numbers with Kornacki and said, \"I mean, the top line is the 5-point advantage that Kamala Harris had in our last poll is gone. What’s behind that shift?\"(NBC)\nTRUMP TAKES LEAD IN 6 OUT OF 7 BATTLEGROUND STATES IN RECENT POLLING\nKornacki agreed, contrasting previous polling that took place after the first Trump-Harris debate versus now, amid Harris' media blitz. The polling showed Trump had risen from 44% to 48%, whereas Harris had declined from 49% to 48%.\nIn one noteworthy poll, however, Harris had declined significantly, as Kornacki noted \"some things that have changed in that time. I think this might be the biggest for Harris.\"\n\"We just asked the basic image perception people have, is it positive or negative of these candidates? The Trump number’s always been somewhere in this territory,\" he said as he gestured at Trump having a 43% positive and 51% negative rating. \"In fact, this is a little bit high for him, believe it or not.\"\nWhere once many of Vice President Kamala Harris' supporters said her victory was certain, polling now indicates another story.(Fox News )\nIF 2024 POLLING ERRORS MIRROR THOSE IN 2020 ELECTION, TRUMP ‘WINS IN A BLOWOUT’, WARNS CNN DATA GURU\nBut he said that Harris’ numbers have notably changed.\n\"But look at Harris, 43 positive, 49 negative. The significance, we polled this a month ago. She was 48% positive and 45 negative. She was above water, as they say. That’s completely reversed. It now looks very similar to Trump’s. That’s a pretty big shift when you’re talking about a race this close,\" he added.\nHe then noted further polling indicating that only a quarter of families say Biden-era policies are helping their family, whereas 45% say they are \"hurting\" them.\n\"And then here’s the interesting twist. We also asked folks, ‘Think back to when Donald Trump was president. Did his policies help or hurt your family?’ And look at the difference, 44% helping, 31 hurting. Trump’s — the retrospective, you would say, opinion of Trump’s presidency among voters, arguably higher now than when he was president,\" Kornacki said.\nCLICK HERE TO GET THE FOX NEWS APP\nAlexander Hall is an associate editor for Fox News Digital. Story tips can be sent to Alexander.hall@fox.com."}, {"title": "Israeli forces seize documents that reveal Hamas plan for more elaborate attacks: report", "link": "https://www.foxnews.com/world/israeli-forces-seize-documents-reveal-hamas-plan-elaborate-attacks-report", "content": "Former U.S. Ambassador to Israel David Friedman discusses Biden's advice to Israel regarding the response to Iran's missile attack and Vice President Harris' stance on Israel.\nYears before Hamasattacked Israelon Oct. 7, 2023 and started the latest war in the region, the terror group plotted other assaults, including a scheme to blow up a skyscraper in Tel Aviv while pressuring Iran to assist in its battle against the Jewish state, according to documents found by Israeli forces in the Gaza Strip, the Washington Post reported.\nThe documents seized from Hamas command centers uncovered planning for the attacks using trains, boats and even horse-drawn chariots, according to the newspaper. The 59 pages of documents include an illustrated presentation detailing possible options for an attack as well as letters from Hamas to Iran’s top leaders in 2021 requesting hundreds of millions of dollars in funding and training for 12,000 additional Hamas fighters.\n\"Hamas is so determined to wipe Israel and the Jewish people off the map that it managed to drag Iran into direct conflict — under conditions that Iran wasn’t prepared for,\" an Israeli security official who has reviewed the letters and planning documents told the Post. The official spoke on the condition of anonymity to discuss sensitive documents seized by Israeli forces in Gaza.\nIRAN MAKING BILLIONS IN OIL REVENUES DESPITE SANCTIONS\nPalestinians take control of an Israeli Merkava battle tank after crossing the border fence with Israel from Khan Yunis in the southern Gaza Strip on Oct. 7, 2023.(Getty Images)\nThe move to release the documents comes as Israel could possibly retaliate against Iran after the Islamic Republic launched nearly200 missileson Oct. 1 in response to the killing of Hasan Nasrallah, the leader of Lebanon’s Hezbollah terrorist group.\nIn the letters written in 2021, Hamas’s Gaza leader Yahya Sinwar appeals to several senior Iranian officials, including the country’s supreme leader, Ali Khamenei, for additional financial and military support, pledging that, with Iran’s backing, he could destroy Israel completely in two years.\nIDF MEETS LITTLE RESISTANCE FROM HEZBOLLAH AFTER WEEKS OF HITTING TERROR TARGETS, OFFICIALS SAY\nIsraeli soldiers operate at a location given as southern Lebanon in this image released on October 6, 2024.(Israel Defense Forces/Handout via REUTERS)\n\"We promise you that we will not waste a minute or a penny unless it takes us toward achieving this sacred goal,\" states a June 2021 letter with apparent signatures by Sinwar as well as five other Hamas officials.\nIran initially declined to directly involve itself in the war between Hamas and Israel after Oct. 7. However, the conflict has expanded as its proxies continue to attack Israel on multiple fronts.\nIn a statement to Fox News Digital, the Permanent Mission of theIslamic Republic of Iranaccused Israel of spreading false information.\n\"We regard the Israeli regime as a mendacious criminal, anti-human entity and place no credence in their illusions,\" a spokesman for the mission said. \"They have a long history of spreading falsehoods, fabricating already-counterfeit documents, and conducting deceptive psychological operations.\"\nUS TO DEPLOY MISSILE DEFENSE SYSTEM, MILITARY PERSONNEL TO ISRAEL\nA man walks past shelter tents erected near collapsed buildings in the Bureij camp for Palestinian refugees in the central Gaza Strip on October 1, 2024 amid the ongoing war in the Palestinian territory between Israel and Hamas.(Eyad Baba/AFP via Getty Images)\nSome plans seized by the Israel Defense Forces include a computer slide presentation showing a Hamas outpost in northern Gaza with options and scenarios for attacking Israel, with targets ranging from military command centers to shopping malls.\nAnother describedplans to destroythe Moshe Aviv Tower, a 70-story building in Tel Aviv that is Israel’s second tallest, as well as the Azrieli Center complex, which comprises three skyscrapers,a large shopping mall, train station and a cinema, according to the Post report.\nMany rockets, fired from Iran, are seen over Jerusalem from Hebron, West Bank on October 01, 2024. The Israeli army announced that missiles were fired from Iran towards Israel and sirens were heard across the country, especially in Tel Aviv.(Wisam Hashlamoun/Anadolu via Getty Images)\nCLICK HERE TO GET THE FOX NEWS APP\n\"Working to find a mechanism to destroy the tower,\" the plan states.\nOther plans of attack included targeting Israel's rail system and resurrecting horse-drawn carriages of antiquity as conveyances for fighters and weapons, the report said.\nLouis Casiano is a reporter for Fox News Digital. Story tips can be sent tolouis.casiano@fox.com."}, {"title": "Kamala Harris dismisses concerns she's losing support from Black men: 'Not my experience'", "link": "https://www.foxnews.com/media/kamala-harris-dismisses-concerns-shes-losing-support-from-black-men-not-my-experience", "content": "CNN data reporter Harry Enten revealed that former President Donald Trump is expected to garner a \"historic\" number of Black and Hispanic voters in November.\nVice President Kamala Harrispushed back on polls showing she was losing support from Black men, in a new interview.\nDuring a 23-minute sit-down with Black-focused entertainment outlet \"The Shade Room\" on Monday, Harris was asked about polls indicating that the Democrats' advantage with Black voters may be declining from past presidential cycles, and among Black men in particular.\nAccording to aNew York Times/Siena College pollreleased on Saturday, Harris currently holds 78% of the Black vote, which is down from 2020, when President Biden won approximately 90% of that voting bloc. It's also down from 2016, when Hillary Clinton won approximately 92% of the Black vote. Harris' support among Black men has dropped even more significantly, according to the report: 70% said they would vote for Harris in November, down from Biden’s 85% in 2020.\n\"When you hear those numbers, and you're seeing in the polls — Black men aren't as excited or fired up for you, how do you respond to that?\" host Justin Carter asked Harris.\nCNN DATA REPORTER PREDICTS TRUMP WILL WIN ‘HISTORIC’ NUMBER OF BLACK AND HISPANIC VOTERS\nVP Harris was asked to respond to polls showing Harris' support from Black voters has declined from Democrats' support from these voters in past presidential cycles.(Screenshot/CBS News)\nThe VP immediately dismissed the polls and suggested that things could change in the next three weeks before the November election.\n\"One, that's not my experience,\" Harris responded. \"Two, Election Day has not arrived yet.\"\nHarris went on to say that she is not taking these voters for granted and is working to earn their support.\n\"Black men are no different from anybody else. They expect that you have to earn their vote. And that's why I'm out here,\" she continued.\n\"It's incumbent on me to earn their support, that’s why I’m talking to folks about the work I’ve done in my career,\" she said, citing her efforts to help strengthen small businesses and pledging to continue to do so if elected as president.\nHERSCHEL WALKER SAYS OBAMA ‘FORGOT OUR FIGHT FOR RIGHT TO VOTE’ AFTER SCOLDING BLACK VOTERS AGAINST HARRIS\nFormer President Obama scolded Black men who aren't supporting Vice President Harris during a campaign stop last week.(Victor J. Blue/Bloomberg via Getty Images, left, Kamil Krzaczynski/AP, right. )\nLater in the interview, Harris was asked whether former President Obama was \"right\" to scold Black men during a campaign stop for Harris last week, suggesting sexism played a role in their lack of enthusiasm for the female presidential candidate.\n\"I'm very proud to have his support,\" Harris said, before urging listeners to take heed to Obama's warning about what's at stake in this election if her opponent, former President Trump, were to be re-elected.\nOn Monday, Harrisrolled out a new agendaaimed at helping boost Black men's financial prospects, called the \"Opportunity Agenda for Black Men.\"\nThe proposals include providing 1 million loans that are fully forgivable to Black entrepreneurs and others to start a business, championing education, training and mentorship programs that help Black men get good-paying jobs in high-demand industries and lead their communities, including pathways to become teachers.\nThe Breakfast Club radio show co-host Charlamagne Tha God argued that the \"America first\" message resonates with voters, particularly in the current moment as a a nation.(Breakfast Club Power 105.1 FM YouTube channel)\nOn Tuesday, Harris will continue her outreach to Black voters,NPR reported, by taking questions at a town hall moderated by popular Black radio host,Charlamagne tha God.\nCNN data reporter Harry Enten predicted on Monday that Trump could win a \"historic\" share of Black and Hispanic voters this election.\n\"At this particular hour, if you believe the polling, Donald Trump’s going to put up the best performance with Black voters since Richard Nixon in the 1960s,\" Enten said.\nFox News' Nikolas Lanum and Paul Steinhauser contributed to this report.\nCLICK HERE TO GET THE FOX NEWS APP\nKristine Parks is an associate editor for Fox News Digital. Read more."}, {"title": "'Dumb thing for her to do': Rift between Harris and Biden camps causing internal disruptions, sources say", "link": "https://www.foxnews.com/politics/dumb-thing-her-do-rift-between-harris-biden-camps-causing-internal-disruptions-sources-say", "content": "Fox News' Jacqui Heinrich reports on alleged tensions between the White House and VP Harris' campaign.\nSources close to the White House report an ongoing rift between President Biden and his staff and Kamala Harris and her staff – with issues tracing back to the initial weeks following Harris' nomination by the Democratic Party.\nThe squabbles have ranged from whether Biden's main surrogates should continue going on TV or be replaced with new Harris surrogates, to debates over whether Biden is undermining Harris' messaging. Other issues have included complaints from the Harris camp that the White House has not moved quickly enough to add staff to the vice president's office to help deal with the bigger workload. The revelations surfaced ina new report Axios published Sunday.\n\"Everyone from the president on down knows how important the election is, and we always anticipated a number of staff would want to transition from the administration to the campaign for the final stretch,\" a White House official told Axios. However, simultaneously,the White Househas been frustrated over the Harris camp's rules around who can be moved to her office and when, other sources inside the White House told Fox News.\nMeanwhile, Biden staffers have also reportedly felt dejected over Biden's exit from the race, sources said, forcing them to play second fiddle to the vice president.\nPRESIDENT BIDEN PROMOTES PRESS SECRETARY KARINE JEAN-PIERRE TO NEW TOP ROLE\nAccording to polling data, less than one-third of Americans believe that the country is on the right track. (Getty Images)\n\"They're too much in their feelings,\" a Harris ally close to the campaign, told Axios.\nOne example of Biden not adequately coordinating his message and schedule, cited by Harris campaign aides, came on Friday. Biden held an impromptu press conference from the White House to update the American public on the government's hurricane relief efforts. Meanwhile, Harris was campaigning in Michigan at the same time, and the dueling events served to effectively lessen the number of eyes on Harris.\nBiden was supposed to be out of the country that day, but he reportedly felt it imperative to stay back and oversee response efforts to Hurricanes Milton and Helene.\nThe infighting did not stop there, either. Last week, Harris criticizedFlorida Gov. Ron DeSantisfor playing political games and not doing what was best for the American people, after she claimed that the Sunshine State governor ignored her calls to discuss hurricane relief efforts. On Friday, when Biden was supposed to be overseas, he undercut Harris' narrative about DeSantis when he praised the Florida governor's work in the wake of the storm, calling him \"cooperative\" and acknowledging he was doing a \"great job.\"\nBIDEN UNDERMINES HARRIS CLAIM THAT RON DESANTIS IS POLITICIZING HURRICANE RESPONSE: ‘DOING A GREAT JOB’\nSources inside the White House told Fox News that Harris creating a riftwith DeSantiswas a \"dumb thing for her to do,\" adding that Biden's team feels like it has done everything it can to provide Harris with opportunities to demonstrate leadership, but she has fumbled them. At least one source who spoke to Fox News said the Harris campaign's poor messaging on this was due to its own poor planning, not the White House's.\nPresident Biden stepped aside and endorsed Vice President Kamala Harris.(Tierney L. Cross/Getty Images)\nThe Harris campaign declined to comment when reached by Fox News Digital. But, Andrew Bates, White House deputy press secretary, extolled Biden's continued support for Harris in a statement to Fox News Digital.\nCLICK HERE TO GET THE FOX NEWS APP\n\"President Bidenendorsed Vice President Harris immediately after leaving the race, rejecting other approaches that would divide the party, and has attested to her leadership abilities and continually made clear his support for her,\" Bates said.\n\"While ensuring that all critical White House functions are fully staffed, we have made significant changes to guarantee the Vice President’s team has all of the support and resources that they need,\" Bates said. \"This builds on a strong, trusting relationship between both teams, which has been critical to successfully executing an unprecedented transition to a new candidate.\""}, {"title": "'Did not expect that': GOP Rep Luna speaks out after meeting with Biden on hurricane response", "link": "https://www.foxnews.com/politics/did-not-expect-that-gop-rep-luna-speaks-out-after-meeting-biden-hurricane-response", "content": "Sean and Tana Anderson, co-owners of Crescent Beach Market, tell Fox News about the lingering devastation after being slammed by Hurricanes Helene and Milton.\nIt’s not every day that a member of the ultra-conservative House Freedom Caucus sits down to meet with the Democratic commander in chief, but national crises have a way of creating strange bedfellows.\nRep. Anna Paulina Luna, R-Fla., told Fox News Digital she was not expecting a call late last week when her phone screen flashed with an unknown Washington, D.C.-based government number. When she answered, it was President Biden’s voice on the line.\n\"Well, I did not expect that. So I talked to him on the phone for about 10 minutes. First thing that he asked me was, what did I need for my constituents, and how did I fare with the storm. And then [we] moved forward into talking about the issues that we're having with FEMA,\" Luna said.\nThe first-term Republican, whose district was hit hard by Hurricane Milton last week, said she also met with Biden when hesurveyed storm damage in Floridaover the weekend.\nPOLITICAL STORM: ON TRUMP ‘ONSLAUGHT OF LIES,’ BIDEN URGES FORMER PRESIDENT TO ‘GET A LIFE MAN’\nRep. Anna Paulina Luna shared measured praise for President Biden in his handling of Hurricane Milton so far.(Getty Images)\nThe pair met for an \"extensive\" discussion on a number of disaster aid reforms, Luna said.\nIt’s not uncommon to see political foes work together after a natural disaster, but the congresswoman’s praise for Biden is a stark contrast from her fierce criticism of his administration – which she herself noted to Fox News Digital – includingspearheading effortsto hold members of his Cabinet in inherent contempt of Congress.\n\"I have obviously been very critical of President Biden in the past, but I will say that him stepping in and taking control of the situation to assist for the right reasons was very honestly kind of shocking for me,\" Luna said.\nHURRICANE MILTON CARVES DEADLY PATH THROUGH FLORIDA, MILLIONS WITHOUT POWER\n\"Obviously, you know, we're still going to be holding FEMA accountable... But as far as I am seeing, FEMA has been very helpful, and I've been in direct communication with them. And they're absolutely going to assist, because President Biden has told them to do so.\"\nAsked about their in-person conversation, Luna said they talked about the situation in Georgia and North Carolina after Helene battered the American Southeast, as well as Florida’s recovery after both storms.\n\"The one thing that I really wanted to hammer home was obviously, you know, FEMA getting debris cleared and really not holding the cities accountable for not being able to move debris in time,\" Luna said. \"So we sorted that out.\"\nBiden surveyed damage from Hurricane Milton in Florida over the weekend.(Getty Images)\nShe also advocated for reforming the National Flood Insurance Program, which Luna said has been largely unchanged since its inception in the 1960s.\nIn both of their conversations, Luna said Biden agreed with her that FEMA’s $750 upfront payment to disaster survivors was inadequate.\n\"He said it was a ‘bunch of malarkey,’ which is 100% true, and that $750 was not enough,\" Luna said.\nFox News Digital reached out to the White House for further comment.\nCATEGORY 3 MILTON BEARS DOWN ON FLORIDA\nHer measured response to federal relief efforts is notable, given the torrent of GOP-led criticism of the administration’s response efforts.\nIt’s worth noting that Biden also saw praise from the Republican governors of South Carolina, Tennessee and Virginia after the storms.\nOn the federal level, Luna is among the bipartisan chorus of lawmakers calling for Congress to return for an early emergency session to deal with disaster relief – something Biden has also voiced.\nLuna is known for being one of the Biden administrations's most outspoken critics in Congress. She is pictured here leading an effort to hold Attorney General Garland in inherent contempt.(Getty Images)\nBut Speaker Mike Johnson, R-La., has signaled on multiple occasions that he’s unlikely to convene the House before their scheduled return the week after Election Day.\nCLICK HERE TO GET THE FOX NEWS APP\nJohnson, who has criticized the Biden administration’s response, argued that the $20 billion that Congress freed up for FEMA last month would be enough to meet immediate needs, and that lawmakers could do little until a formal damage assessment and cost estimate was provided.\nRep. Chuck Edwards, R-N.C., whose district was among the hardest hit by Helene, echoed Johnson in aninterview Friday.\n\"I believe that what we're seeing right now with the calls to come back into session to pass funds is more of a distraction from the administration for their inept reaction to getting folks here to help western North Carolina,\" Edwards said.\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com"}, {"title": "Harris goads Trump to release medical records after she gets clean bill of health from personal physician", "link": "https://www.foxnews.com/politics/harris-goads-trump-release-medical-records-after-she-gets-clean-bill-health-from-personal-physician", "content": "Harris 2024 senior adviser Ian Sams joins Arthel Neville on ‘Fox News Live’ to discuss the latest news from the campaign trail as the 2024 election looms.\nVice President Kamala Harris argued this weekend that former President Donald Trump is \"hiding\" from the American people and attempted to goad him into releasing updated records about his health after she did so herself on Saturday.\n\"Donald Trump refuses to release his medical records, and he is unwilling to meet for a second debate,\"Harris said Sunday.\"Why does his staff want him to hide away? Are they afraid that people will see that he is too weak and unstable to lead America?\"\nOn Saturday, Harris' physician released a two-page\"Healthcare Statement,\"which insisted that \"in summary,\" Harris \"remains in excellent health.\" The statement from Harris' doctor also indicated she had her most recent annual physical exam in April of this year. Trump released his own health records while campaigning in 2016, and once he took over the White House he continued the trend. In August, with the 2024 election quickly approaching, Trump told CBS News that he would release updated medical records to the public. However, he has yet to do so, with roughly three weeks until Election Day.\nWHITE HOUSE RELEASES MEDICAL REPORT ON VP KAMALA HARRIS\nFormer President Donald Trump talks about his trade plan in an exclusive interview with Maria Bartiromo on \"Sunday Morning Futures.\"(Fox News Channel)\n\"He won't put out his medical records,\" Harris insisted Monday morningduring an interview with podcast host Roland Martin.She also slammed Trump for refusing to debate a second time and questioned why Trump's \"staff\" would not allow him to do an interview with CBS' \"60 Minutes,\" particularly when it is tradition for both presidential candidates to do a sit down with the show.\n\"It may be because they think he's just not ready and unfit and unstable and should not have that level of transparency for the American people,\" Harris suggested.\nThe Trump campaign shot back against Harris' accusations, pointing out the former president has alreadyreleased voluntary updates about his health.They also noted that he sharedrecords from a July screeningconducted by Dr. Ronny Jackson, a former White House physician turned GOP congressman, following the second assassination attempt on his life.\nTRUMP'S FORMER DOCTOR GIVES HEALTH UPDATE, CALLS OUT WRAY AS FBI AFFIRMS BULLET STRUCK FORMER PRESIDENT\n\"All have concluded [Trump] is in perfect and excellent health to be Commander in Chief,\" said Trump campaign spokesman Steven Cheung. \"He has maintained an extremely busy and active campaign schedule unlike any other in political history.\" Meanwhile, Cheung slammed Harris as being \"unable to keep up with demands of campaigning,\" arguing that compared to Trump her schedule \"is much lighter because, it is said, she does not have the stamina of President Trump.\"\nOn Sunday, during a rally in Arizona, Trump himself discussed his health and argued critics look for any reason to say he is not cognitively or physically fit to be president.\n\"If I pronounce the word slightly wrong … I speak for hours, mostly without a teleprompter … one mispronunciation of a word: 'He's cognitively impaired. He's getting old. He mispronounced a word like the name of the gang.'\"\n\"But they love it, you know, because Biden was obviously cognitively repaired,\" Trump added at the rally. \"[Harris] should have reported him because that puts our nation in danger.\"\nNBC's Kristen Welker pressed House Speaker Mike Johnson on Sunday about whether former President Donald Trump should release his cholesterol levels.(Screenshot/NBC)\nBefore President Biden dropped out of the presidential race in July, similar demands for his medical records were made. The medical records never came, but details from an exam of the president, whichdetermined he had been exhibiting signs of Parkinsons Disease,eventually surfaced just days before Biden ended his run for president.\nWHITE HOUSE CORRECTS RECORD ON BIDEN'S PHYSICIAN, PARKINSON'S EXPERT MEETING, SAYS IT WAS FOR PRESIDENT'S CARE\nDuring his presidency, Biden's personal doctor released at least three separate reports updating the American public on his health. Trump, similarly, produced at least three different health records while he was serving as president.\nOn Sunday morning's episode of NBC's \"Meet The Press,\" House Speaker Mike Johnson, R–La., was pressed by host Kristen Welker about whether he thought seeing detailed information about Trump's health, such as his cholesterol level, was important.\nCLICK HERE TO GET THE FOX NEWS APP\n\"Kristen, the American people don’t care about the cholesterol level of Donald Trump. They care about the cost of living and the fact they cannot pay for groceries because Kamala Harris and Joe Biden’s policies have put them in that situation. The medical records are irrelevant,\"Johnson responded.\"Let’s talk about things that the American people care about. That’s why Donald Trump is surging in the polls because he’s doing that on stages, in interviews, nonstop around the clock. And Kamala Harris has done nothing.\"\nFox News Digital reached out to the Harris campaign for comment but did not receive a response by press time."}, {"title": "CNN data reporter predicts Trump will win ‘historic’ number of Black and Hispanic voters", "link": "https://www.foxnews.com/media/cnn-data-reporter-predicts-trump-win-historic-number-black-hispanic-voters", "content": "CNN data reporter Harry Enten revealed that former President Donald Trump is expected to garner a \"historic\" number of Black and Hispanic voters in November.\nCNN data reporter Harry Entenwarned on Sunday that former President Trump is predicted to win a \"historic\" number of Black and Hispanic voters in the November election.\nDuring an appearance on \"Inside Politics,\" Enten revealed the potentially bad news for Democrats and also noted that Republicans are outpacing Democrats in party identification and registration for the first time in almost 40 years.\n\"At this particular hour, if you believe the polling, Donald Trump’s going to put up the best performance with Black voters since Richard Nixon in the 1960s,\" Enten said.\nA New York Times/Siena College pollreleased on Sunday suggested that Vice President Kamala Harris holds 78% percent of the Black vote. Hillary Clinton won the voting block with 92% in 2016, and President Biden won approximately 90% in 2020.\nTRUMP, HARRIS LOCKED IN DEAD HEAT IN 7 BATTLEGROUND STATES, POLL FINDS: 'COULD NOT BE CLOSER'\nFormer President Trump speaks to supporters during a campaign event at Saginaw Valley State University on Oct. 3, 2024, in Michigan.(Scott Olson/Getty Images)\nEnten also told a CNN panel on Sunday that Trump is expected to put up the \"best performance\" for a Republican when it comes to Hispanic voters since former President George W. Bush in 2004.\n\"The GOP leads by a point in party identification right now,\" he said. \"The average when the Republican Party loses is the Democrats ahead by 8. When the Republican Party wins, the average party ID advantage for Democrats is 3. Republicans right now, Manu, are doing even better than the average when they win,\" Enten added.\nHe noted that the party registration and party ID data \"points in a good direction\" for Trump.\nHowever, Enten questioned whether Trump’s performance among minority groups could be erased by Harris’ support among college-educated White voters.\nPOLL SHOWS HARRIS TAKING A SLIM LEAD OVER TRUMP THANKS TO SUPPORT FROM A SURPRISING GROUP\nCNN data reporter Harry Enten predicted that Trump may win a historic number of Black and Hispanic voters.(CNN/Screenshot)\n\"The question ultimately is—is that enough to offset the strength that Kamala Harris has with White voters with a college degree? At this particular moment, she has the strongest margin with them than any Democrat going back since recorded history with polling, I guess since 1948, 1952, wherever you want to put it,\" he said.\nEnten calculated that Harris is winning the demographic by 18 points.\nAn NBC News surveyof registered voters released on Sunday found that voters are virtually evenly split between the two candidates.\nCLICK HERE TO GET THE FOX NEWS APP\nWhen the poll, conducted Oct. 4-8, asked respondents who they would choose, Trump and Harris each earned 48% in a hypothetical one-on-one matchup.\nWhen third-party figures were included in the mix, the overall result was 47% support for Trump versus 46% for Harris.\nNikolas Lanum is an associate editor for Fox News Digital."}, {"title": "Trump opens up largest betting lead since days after Biden's dropout", "link": "https://www.foxnews.com/politics/trump-opens-up-largest-betting-lead-since-days-after-bidens-dropout", "content": "CNN data reporter Harry Enten revealed that former President Donald Trump is expected to garner a \"historic\" number of Black and Hispanic voters in November.\nFormer President Trump took a double-digit lead in the betting odds overVice President Kamala Harrisfor the first time since July, signaling potential momentum for the former president as Election Day draws near.\nTrump opened up a 10-point lead in the Real Clear Politics betting average on Sunday, his largest lead over Harris and the largest lead any candidate has enjoyed since the former president’s 10-point lead on July 31.\nThe lead comes as some inDemocratic circleshave attempted to quell panic within the ranks after recent polling that has seemingly trended toward Trump, with David Plouffe, who served as a senior adviser to President Barack Obama and now serves as a senior campaign adviser for Harris, appearing on the \"Pod Save America\" podcast Sunday to argue that the fundamentals of the race have not changed.\nWHAT THE LATEST FOX NEWS POLLS IN THE 2024 ELECTION SHOW\nFormer President Trump gestures while walking onstage for a campaign rally on Oct. 12, 2024, at Coachella in California.(Mario Tama/Getty Images)\n\"I think the freakout is because there were a bunch of polls I’d say in the last month that showed a lead for Kamala Harris that was not real, it’s not what we were seeing. We’ve seen this thing basically be tied, let’s say, since… mid-September. So this is the race we have, it’s the race we expected, I don’t think it’s going to open up for either candidate,\" Plouffe said.\nBut the betting odds have also continued to move inTrump’s favor,perhaps indicating solid momentum for the former president outside typical public polling.\nTrump at one point enjoyed an over 48-point lead in the Real Clear Politics betting average over President Biden on July 15, but that lead quickly began to evaporate after the president’s announcement that he would drop out of the race and Harris’ quick elevation to the top of the Democratic ticket.\nVice President Kamala Harris speaks during a church service at Koinonia Christian Center in Greenville, North Carolina, Sunday, Oct. 13, 2024.(AP Photo/Susan Walsh)\nCHECK OUT THE LATEST FOX NEWS POWER RANKINGS IN THE 2024 ELECTION\nHarris eventually took the betting lead in the race on Aug. 8 and saw that lead peak at 8.8-points a week later. The two candidates have since traded the lead multiple times and no candidate has enjoyed a lead as large as Trump’s Sunday advantage.\nHarris’ last lead in the Real Clear Politics average was on Oct. 5, with Trump steadily gaining more momentum in the race on his way to the 10-point Sunday lead.\nTrump himself has touted his betting advantage in recent days, telling Fox News’ Maria Bartiromo on Sunday that the betting odds were \"through the roof\" in his favor.\nFormer President Trump speaks at a campaign rally at the Calhoun Ranch, Saturday, Oct. 12, 2024, in Coachella, California.(AP Photo/Alex Gallardo)\nCLICK HERE TO GET THE FOX NEWS APP\nThe Real Clear Politics betting odds average tracks seven different platforms that release odds; Betfair, Betsson, Bovada, Bwin, Points Bet, Polymarket and Smarkets. None of those platforms show Harris with a lead in the race. Trump enjoys his largest lead of 12 points on Points Bet.\nNeither the Trump nor the Harris campaign immediately responded to Fox News Digital requests for comment.\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.\nMichael Lee is a writer for Fox News. Prior to joiningFox News, Michael worked for theWashington Examiner,Bongino.com, andUnbiased America. He has covered politics for more than eight years."}, {"title": "Trio of new polls agree on where Trump and Harris stand with 3 weeks to go until Election Day", "link": "https://www.foxnews.com/politics/trio-new-polls-agree-where-trump-harris-stand-three-weeks-until-election-day", "content": "Precision Strategies Vice President Rich Luchette and Republican strategist Matt Keelen discuss the state of the presidential race on 'Fox News Live.'\nWith just over three weeks to go until Election Day, a trio of new national polls in the White House race suggestformer President Donald Trumpis erasing gains made by Vice President Kamala Harris the last couple of months after replacing President Biden atop the Democrats' 2024 ticket.\nThe surveys indicate a margin of error race between the two major party presidential nominees, with Trump enjoying some momentum in the final stretch.\nHarris edged Trump 50%-48% among likely voters questioned in an ABC News/Ipsos poll, down from a six-point lead forthe vice presidentlast month.\nWHAT THE LATEST FOX NEWS POLLS IN THE 2024 ELECTION SHOW\nFormer President Trump and Vice President Kamala Harris, the 2024 Republican and Democratic presidential nominees.(Fox News)\nAccording to an NBC News poll of registered voters nationwide, the vice president and former president were deadlocked at 48%. That is a major switch from a month ago, when Harris enjoyed a five-point advantage.\nAdditionally, a CBS News/YouGov nonprobability based survey of likely voters indicated Harris with a three-point edge over Trump, slightly down from a four-point advantage a month ago.\nCHECK OUT THE LATEST FOX NEWS POWER RANKINGS IN THE 2024 ELECTION\nAfterPresident Biden'sdisastrous late June debate performance against Trump, the former president started to open up a single-digit lead over the White House incumbent.\nHowever, Biden's departure from the presidential election and the Democrats' quick consolidation around the vice president upended the dynamics of the race.\nVice President Kamala Harris speaks during a campaign event at East Carolina University on Sunday, Oct. 13, 2024, in Greenville, North Carolina.(AP Photo/David Yeazell)\nHarris, boosted by a wave of energy and excitement, experienced a surge in fundraising and in her favorable ratings, which pushed her past Trump in presidential polling. The trend continued through the Democrats' late August convention and the first and likely only debate between the two standard-bearers, in early September.\nHowever, as summer transitioned into autumn, Harris' favorable ratings appear to have waned, Republicans are coming home to Trump, and an already large gender gap over support for the two nominees has widened further.\nHARRIS MAKES NEW PITCH FOR BLACK MALES AMID POLLING GAINS BY TRUMP\n\"The Harris campaign seems to have stalled, as her image has slipped and the perception of her as being ‘a second Biden Administration’ persists,\" longtime Republican pollster Neil Newhouse told Fox News.\nNewhouse, a veteran of numerous GOP presidential campaigns, argued that Harris is \"on the verge of snatching defeat from the jaws of victory.\"\nFormer President Trump gestures while walking onstage for a campaign rally on Oct. 12, 2024, in Coachella, California.(Mario Tama/Getty Images)\nWhile national polling is useful in depicting the state of the race, the presidential election is not based on the popular national vote and instead is a battle for the states and their electoral votes.\nThe latest polling in the seven key battlegrounds whose razor-thin margins decided Biden's 2020 victory over Trump and will likely determine who wins the 2024 election also points to a margin of error race.\nCLICK HERE TO GET THE FOX NEWS APP\nA leading non-partisan pollster said the jury's still out on whether Trump's gaining momentum.\n\"We need more data points before we can depict poll movements as momentum,\" Suffolk University Political Research Center Director David Paleologos told Fox News.\nPaleologos, who conducts USA Today/Suffolk University polling, said \"it could be momentum, or it could be the natural closing of the gap in a very polarized country.\"\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub."}, {"title": "ANDREW McCARTHY: FBI's role in Hunter Biden laptop scandal is worse than you know", "link": "https://www.foxnews.com/opinion/andrew-mccarthy-fbis-role-hunter-biden-laptop-scandal-worse-than-you-know", "content": "Former Assistant U.S. Attorney Andy McCarthy reacts to concerns over information suppression from foreign countries on 'America Reports.'\nHunter Biden’s infamous \"laptop from hell\"may be the most damning trove of evidence tying the sitting (if sleeping) president of the United States to theover $27 millionthat his family raked in by peddling his political influence to agents of corrupt and anti-American regimes – in particular, the communist regime of Xi Jinping in China.\nStill, the enduring relevance of the laptop is not as aBidenstory, but as a story ofthe political corruption of the government’s law-enforcement and intelligence apparatus– pillars of our rule of law and our national security.\nThink about this: The FBI took possession of the laptop in December 2019, and quickly authenticated it – not hard to do because there was a mountain of publicly available information for purposes of corroborating the data, which was incontestably Hunter Biden’s.\nIT'S THE 4TH ANNIVERSARY OF THE BIGGEST LIE THE BIDEN-HARRIS ADMINISTRATION EVER TOLD. IT'S ONLY GOTTEN WORSE\nWhat’s the significance of that? Well, Election Day wasn’t until November 3, 2020. Hence, while early voting was already underway in the weeks before the election, the FBI had already known for nearly a year that the laptop was the real deal.\nDespite that, the bureau induced major social media titans, such asTwitter (now X)and Facebook, to suppress derogatory reporting about the Bidens – specifically, the New York Post’s mid-October 2020 reporting on the laptop. How? By deceptively intimating that the Post’s reporting was likely the result of an influence operation carried out by Russian intelligence.\nIn reality, this was an influence operation carried out by current and former U.S. intelligence officials. TheFBI was not alone.\nThe government’s \"Intelligence Community\" routinely shares information. The IC, too, is prone to hype Russian \"interference\" in U.S. elections. Yet, such \"influence operations\" are longstanding: Moscow interfered in American politics throughout the Cold War; it has continued to do so since the Soviet Union’s fall up to the present day. Influence ops are also reciprocal: U.S. spy agencies routinely sought to influence Soviet politics and, now, seek to undermine Putin. If they didn’t, what good would they be?\nFor all the heavy-breathing by themedia-Democrat complex, modern Russia is a basket-case country run by a mafia-style regime whose election-influence ops are often laughably amateurish. They are, moreover, a negligible ripple in the multi-billion-dollar ocean of American campaign messaging.\nHUNTER BIDEN LAPTOP RE-EMERGES AS MEDIA EMBARRASSMENT AS IT BECOMES KEY EVIDENCE AT GUN TRIAL\nAs our domestic security service specializing in foreign counterintelligence, the FBI is a critical IC component. The IC is led by the Office of the National Intelligence Director (ODNI), part of whose core mission is to ensure that intelligence is shared community-wide – including, of course, with the CIA, which combats foreign threats to American interests. If the FBI knew the laptop was authentic, not a product of Russian intelligence, so did the IC.\nIt was IC veterans, however, led by former officials who’d served in the highest ranking posts in theObama-Biden CIAand ODNI, who generated the notorious election-eveletterin which 51 such officials endeavored to deceive voters into dismissing thePost’s laptop reporting as bearing \"the classic earmarks of a Russian information operation.\" Indeed, we now know this letter was instigated at the suggestion ofAntony Blinken– then a Biden-Harris campaign adviser, now the Biden-Harris administration's secretary of state – and that the \"classic earmarks\" line was suggested by James Clapper, the Obama-Biden Director of National Intelligence.\nThat letter was dated October 19, 2020 – again, ten months after the FBI seized the laptop. Naturally,President Biden– who also had to know the laptop was authentic – used the former officials’ letter and its politicization of their government national-security credentials in order to discredit then-President Trump’s highlighting of the laptop and its damning contents at the final presidential debate.\nCLICK HERE FOR MORE FOX NEWS OPINION\nIt doesn’t take a quantum physicist to figure out what happened here. During the summer of 2020, asSen. Chuck Grassley, R., Iowa, hasrecounted, he and Sen. Ron Johnson, R., Wisc., were scrutinizing bank records and other evidence of huge payments to Biden family members (work that became the foundation for the eventual House impeachment investigation). Alarmed, Senate Democrats suddenly asked friendly FBI supervisors in Washington, D.C., to intervene with a briefing on the bureau’s fears of Russian influence operations against the 2020 election.\nThere was no reason to believe readily verifiable bank records about suspicious foreign money transfers had been generated by Russian intelligence. Yet, theFBI collaborated with Democratsin framing it that way. The bureau produced an \"assessment\" about signs of foreign interference in the then-upcoming 2020 election, which Democrats used to portray Grassley and Johnson as dupes who were doing the Russians’ bidding. (See, e.g., this Aug. 13, 2020,AP reportciting the FBI assessment and accusing Johnson of \"amplifying\" Russian \"propaganda.)\nCLICK HERE TO GET THE FOX NEWS APP\nWhen the laptop became public in mid-October 2020, thanks to the Post’s reporting, it was simply folded into thisRussian disinformation fairy tale. The social media companies suppressed the reporting because the FBI encouraged them to do so – even though the bureau knew the laptop was real. The 51 national security officials piled on with their letter, and Biden himself trumpeted the fraud at the debate.\nThe American people spend over $100 billion per year on the IC. The legacy of the laptop is the IC’s capture by the party of government.\nCLICK HERE TO READ MORE FROM ANDREW McCARTHY\nAndrew C. McCarthy serves as a FOX News contributor and is a senior fellow at the National Review Institute and a contributing editor of National Review. Follow him on Twitter@andrewcmccarthy"}, {"title": "Trump and Harris poll in dead heat in NBC News survey as Election Day approaches", "link": "https://www.foxnews.com/politics/trump-harris-poll-dead-heat-nbc-news-survey-election-day-approaches", "content": "'The Big Weekend Show' co-hosts discuss former President Trump and Vice President Kamala Harris hitting the campaign trail in the final weeks before the November election.\nVice President Kamala Harris andformer President Donald Trumpare locked in an extremely tight contest for the White House, with voters virtually split evenly between the two candidates, an NBC News survey of registered voters indicates.\nWhen the poll, conducted Oct. 4-8, asked respondents who they would choose, Trump and Harris each earned 48% in a hypothetical one-on-one matchup.\nWhen third-party figures were included in the mix, the overall result was 47% support for Trump versus 46% for Harris.\nTRUMP TAKES LEAD IN 6 OUT OF 7 BATTLEGROUND STATES IN RECENT POLLING\nDonald Trump and Kamala Harris are dividing voters evenly, according to an NBC News survey.(Fox News )\nSpecifically, 42% indicated that they would definitely support the Republican presidential ticket, while another 42% said they would definitely pick the Democratic ticket. Additionally, 4% indicated that they would probably vote for the GOP ticket while 3% noted they would probably vote for the Democratic ticket. And 1% leaned toward the Democratic ticket while another 1% leaned toward the Republican ticket.\n\"As summer has turned to fall, any signs of momentum for Kamala Harris have stopped,\" Democratic pollster Jeff Horwitt, who performed the survey with GOP pollster Bill McInturff, noted, according to NBC News. \"The race is a dead heat.\"\nThe contest is very close even asElection Day, which is on Nov. 5, 2024, draws near.\nIF 2024 POLLING ERRORS MIRROR THOSE IN 2020 ELECTION, TRUMP ‘WINS IN A BLOWOUT’, WARNS CNN DATA GURU\nRepublican presidential nominee former President Donald Trump speaks at a campaign rally at the Calhoun Ranch on Saturday, Oct. 12, 2024, in Coachella, California.(AP Photo/Alex Gallardo)\n\"The challenge for Kamala Harris: Can she meet the moment and fill in the blanks that voters have about her?\" Horwitt noted, according to NBC News. \"The challenge for Donald Trump: Can he make the case that the chaos and personal behavior that bothered so many about his first term will not get in the way of governing and representing America?\" he said. \"The next month will tell whether the candidates can meet these challenges.\"\nThe poll results also reflect a deep divide regarding people's preferred outcome for the upcomingcongressional elections, with 47% preferring a Republican-controlled Congress and 47% preferring a Democrat-controlled Congress.\nSAME POLL TAKEN ONE MONTH APART SHOWS WHICH PRESIDENTIAL CANDIDATE HAS MOMENTUM IN KEY STATES\nDemocratic presidential nominee Vice President Kamala Harris speaks during a church service at Koinonia Christian Center in Greenville, N.C., on Sunday, Oct. 13, 2024.(AP Photo/Susan Walsh)\nCLICK HERE TO GET THE FOX NEWS APP\nThe survey notes that, \"[t]he margin of error for 1,000 interviews among registered voters is ±3.10%.\"\nAlex Nitzberg is a writer for Fox News Digital."}, {"title": "Tensions allegedly rise between Biden White House and Harris campaign: 'Too much in their feelings'", "link": "https://www.foxnews.com/media/tensions-allegedly-rise-between-biden-white-house-harris-campaign-too-much-feelings", "content": "Fox News' Jacqui Heinrich reports on alleged tensions between the White House and VP Harris' campaign.\nAn Axios report alleged Sunday that there is growing tension and miscommunication betweenthe White Houseand the Harris campaign.\nNational political correspondentAlex Thompson reported\"many senior Biden aides remain wounded by the president being pushed out of his re-election bid and are still adjusting to being in a supporting role on the campaign trail.\"\n\"They're too much in their feelings,\" one Harris ally reportedly told Axios about the White House.\nThompson wrote the main issue with some Harris campaign members is that White House aides \"aren't sufficiently coordinating Biden's messaging and schedule to align with what's best for the vice president's campaign.\"\nAxios' Alex Thompson reported ongoing tensions between the White House and the Harris campaign.(Tierney L. Cross)\nKAMALA HARRIS ALLIES RUSH TO PLAY DAMAGE CONTROL AMID WHITE HOUSE INFIGHTING\nThompson cited recent conflicts such as President Biden holding animpromptu press conferenceon Friday while Vice President Kamala Harris was attending an event in Michigan.\nAnother notable incident includedBiden complimentingFlorida Gov. Ron DeSantis for handling recent hurricanes shortly after Harris criticized DeSantis for not taking her calls. Thompson wrote a person familiar with the situation said Biden wasn’t briefed on Harris’ comments before praising DeSantis.\n\"The White House is lacking someone in the room thinking first and foremost about how things would affect the campaign,\" a Harris aide told Thompson.\nDespite \"sore feelings\" among some Biden aides, the report added that most of them are \"actively rooting\" for Harris to win. However, there is ongoing tension with some White House staffers transitioning to the Harris campaign, particularly Biden aides who feel \"they’ve been labeled as disloyal by Biden's team for leaving or even considering it.\"\nPresident Biden gave a surprise press conference earlier this month that took place at the same time as an event for Vice President Kamala Harris.(Pool)\n\"On Harris' campaign, there's also awkwardness between some who were on Biden's original campaign staff and the Harris allies who've been installed in recent weeks,\" Thompson wrote. \"In the weeks after Harris became the Democratic nominee, there were squabbles about whether Biden's main surrogates on television would continue in those roles or if new faces would emerge, two people familiar with the matter told Axios.\"\nBOOK SHOWS ALLEGED BIDEN-HARRIS DIVIDE SURFACED EARLIER THAN PREVIOUS PRESIDENT-VP RIFTS, SOME CRITICS SAY\nIn a comment toFox News Digital, White House deputy press secretary Andrew Bates said, \"President Biden endorsed Vice President Harris immediately after leaving the race, rejecting other approaches that would divide the party, and has attested to her leadership abilities and continually made clear his support for her.\"\n\"While ensuring that all critical White House functions are fully staffed, we have made significant changes to guarantee the Vice President’s team has all of the support and resources that they need. This builds on a strong, trusting relationship between both teams, which has been critical to successfully executing an unprecedented transition to a new candidate,\" Bates concluded.\nDespite tensions, most White House aides told Axios that they plan on voting for Harris.(Getty Images/Pool)\nThe Harris campaign has yet to respond to a request for comment.\nFox News senior White House correspondent Jacqui Heinrich reported Monday on \"Fox & Friends\" that the Biden team has been increasingly frustrated with Harris putting the president in \"tough spots.\"\nHenrich said sources in Biden's orbit believed it was a \"dumb thing\" for Harris to pick a fight with DeSantis, calling it a \"situation of her making.\" The sources believe Biden has been \"bending over backwards\" to give Harris opportunities to show leadership, but she has fumbled in a few of those situations.\nFox News' Jacqui Heinrich contributed to this report.\nCLICK HERE TO GET THE FOX NEWS APP\nLindsay Kornick is an associate editor for Fox News Digital. Story tips can be sent to lindsay.kornick@fox.com and on Twitter: @lmkornick."}, {"title": "85 days: Kamala Harris has yet to do formal press conference since emerging as Democratic nominee", "link": "https://www.foxnews.com/media/85-days-kamala-harris-has-yet-do-formal-press-conference-since-emerging-democratic-nominee", "content": "‘The Five’ co-hosts discuss Vice President Kamala Harris’ media strategy heading into November.\nVice PresidentKamala Harrishas gone 85 days as the presumptive, and now, official Democratic nominee for president without holding an official press conference.\nTrump has held six news conferences where he took questions from the media since the beginning of August, including another this month after meeting with Georgia Gov. Brian Kemp about hurricane relief efforts.\nPresident Biden also held a news conference in the White House press briefing room earlier this month, where he joked about getting back into the 2024 race.\nBERNIE SANDERS SAYS HARRIS DROPPING FAR-LEFT POLICIES ‘IN ORDER TO WIN THE ELECTION’\nVice President Kamala Harris and former President Trump debate at the National Constitution Center in Philadelphia on Sept. 10, 2024.(Getty Images)\nHarris has stepped up her interviews in recent weeks, including doing radio hits, a solo sit-down with a Philadelphia TV station, and friendly appearances with \"The View,\" Stephen Colbert and Howard Stern.\nBut as for when she'll actually do a formal press conference as a candidate, that day may never come, at least while she's still a candidate.\nConservative Radio Libre host Jorge Bonilla feels Harris should do a press conference but said it’s almost \"irrelevant\" because she continues to get a pass.\nHARRIS DODGES QUESTION ON LOWERING PRICES BY DESCRIBING ‘MIDDLE-CLASS’ ROOTS: NEIGHBORS ‘PROUD OF THEIR LAWN’\n\"She is highly unlikely to do a press conference because the media have enabled and encouraged her ‘plexiglass basement’ strategy, wherein she preserves the illusion of being out there while remaining wholly inaccessible to the press and therefore unaccountable,\" Bonilla told Fox News Digital.\nIn her interview in Philadelphia, her answer citing her middle-class upbringing when asked about specifics of her economic policy drew sharp criticism.\nVice President Kamala Harris went viral with her response to a question about how she'd bring down prices in an interview with Philadelphia's 6 ABC anchor Brian Taff.(Screenshot/6 ABC Philadelphia)\nBARBARA WALTERS WOULD EXPECT KAMALA HARRIS TO DO INTERVIEWS, AUTHOR SAYS: 'PART OF THE JOB OF BEING PRESIDENT'\n\"You know, I grew up in a neighborhood of folks who were very proud of their lawn,\" she said. \"And I was raised to believe and to know that all people deserve dignity, and that we as Americans have a beautiful character. You know, we have ambitions and aspirations and dreams, but not everyone necessarily has access to the resources that can help them fuel those dreams and ambitions.\n\"So when I talk about building an opportunity economy, it is very much with the mind of investing in the ambitions and aspirations and the incredible work ethic of the American people and creating opportunity for people, for example, to start a small business.\"\nCLICK HERE TO GET THE FOX NEWS APP\nFox News Digital’s Paul Steinhauser contributed to this report.\nBrian Flood is a media editor/reporter for FOX News Digital. Story tips can be sent tobrian.flood@fox.comand on Twitter: @briansflood."}, {"title": "Fox News Politics: Who is to blame for the border?", "link": "https://www.foxnews.com/politics/fox-news-politics-border-properly-secured", "content": "Welcome to the Fox News’ Politics newsletter, with the latest political news from Washington, D.C. and updates from the 2024 campaign trail.\nHere's what's happening…\n-VP Kamala Harris to sit down with chief political anchorBret Baierfor first formal Fox News interview\n-Biden warned Iran thatkilling Trumpwould be an ‘act of war’\n-Trump camp teases Election Day transportation options for voters impacted byHurricanesHelene, Milton\nFormer President Bill Clintonsaid to a group of churchgoers Sunday that Georgia nursing student Laken Riley's murder would not have happened if the alleged killer, an illegal immigrant, was properly vetted.\nWhile campaigning for Vice President Kamala Harris in the Peach State, Clinton accused Harris' rival, former President Donald Trump, of tanking negotiations over a bipartisan border compromise in Congress because he wanted it to be a campaign issue.\nHe seemed to suggest that Riley's death could have been avoided if Congress was able to pass a compromise – despite the alleged killer having already been vetted…Read more\nFormer President Bill Clinton's speech in Columbus, Ga. on Sunday heavily featured the issue of the border.(Getty Images)\nSHOOTING BLANKS:Kamala Harris claims she's got a gun, but 2nd Amendment supporters say: good luck getting yours…Read more\nCOLUMBUS DAY FLASHBACK: Harris excoriated European explorers for 'wave of devastation' to Native peoples…Read more\nTECH CRUNCH:AI sector frustrated by Congress' slow pace keeping up with advanced tech…Read more\n'LISTEN TO YOUR QUESTION':NBC News' Kristen Welker presses House Speaker Mike Johnson on Trump's cholesterol levels…Read more\nFALSE NARRATIVE?:Who is Vem Miller, man arrested outside Trump Coachella rally? 4 things to know…Read more\nWHO'S MORE ACCESSIBLE?: Trump-Vance ticket has done a combined 75 interviews since August compared to 39 for Harris-Walz…Read more\n'LITTLE' KEYSTONE:Trends are good in the swing county GOP chair calls ‘Little Pennsylvania’: It’ll ‘be a repeat of ‘16’…Read more\n‘THE LEFT HAS PERFECTED THIS’: Conservatives take page from Obama's playbook in battleground Wisconsin…Read more\nHEALTHY AMERICANS:Harris goads Trump to release medical records after she gets clean bill of health from personal physician…Read more\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more onFoxNews.com.\nThis article was written by Fox News staff."}, {"title": "Fox News Politics: 'Brothers' for Kamala", "link": "https://www.foxnews.com/politics/fox-news-politics-brothers-kamala", "content": "Welcome to the Fox News’ Politics newsletter, with the latest political news from Washington, D.C. and updates from the 2024 campaign trail.\nHere's what's happening…\n- Vladimir Putin meets with Iranian President Pezeshkian to celebrate'very close'relationship\n- Top Republican demands answers as billions inFEMA reliefare still going to COVID: 'Legitimate concern'\n-Doug Emhoffdoesn't deny report he slapped ex-girlfriend outside overseas movie event\nDuring a pre-campaign-rally stop in Pittsburgh on Thursday, former President Barack Obama appeared to admonish Black Americans who have not been as fervent in their support for Vice President Kamala Harris’ presidential bid as they were for his in 2008 and 2012.\n\"We have not yet seen the same kinds of energy and turnout in all corners of our neighborhoods and communities as we saw when I was running,\" Obama said during a stop at a campaign office.\n\"Now, I also want to say that that seems to be more pronounced with the brothers. So if you don't mind -- just for a second, I've got to speak to y’all and say that when you have a choice that is this clean: When on the one hand, you have somebody who grew up like you, went to college with you understands the struggles [and the] pain and joy that comes from those experiences…\"\n…Read more\nFormer US President Barack Obama speaks during a Democratic National Committee (DNC) rally in Philadelphia, Pennsylvania, US, on Saturday, Nov. 5, 2022.(Michelle Gustafson/Bloomberg via Getty Images)\n'REALLY OUTDONE YOURSELVES':Politico says Harris is running on a 'dream economy' but voters aren't noticing…Read more\n'CRUSHING GUILT': Hunter Biden legal saga is ‘real war’ that 'preoccupied' outgoing president, new Woodward book claims…Read more\n'SERIOUS RISK':Biden admin pushed to reveal full report on migrants entering US, boarding flights without ID …Read more\nTIME RUNNING OUT:US has helped tiny fraction of its citizens evacuate war-torn Lebanon…Read more\n'NONSENSE':Lead counsel hits new Dem effort to 'delegitimize' Supreme Court amid senator's report on Kavanaugh probe…Read more\n'SINGLE ISSUE VOTERS':Vaping advocate warns Dem crackdown on 'common sense' tobacco alternatives could backfire in swing states…Read more\nIn this Dec. 20, 2018 file photo, Juul products are displayed at a smoke shop in New York.(AP Photo/Seth Wenig, File)\nWHO'S MORE ACCESSIBLE?Trump-Vance ticket has done a combined 71 interviews since August to just 37 for Harris-Walz…Read more\nUNDERMINING DEMOCRACY?: Dems launched an onslaught of schemes slammed as tactics to undermine democracy ahead of high-stakes election…Read more\nOBAMA VS. TRUMP:Obama, stumping for Harris in key battleground, charges Trump 'will makes problems worse'…Read more\nGEORGIA ON THE LINE: Why this one Peach State county could be 'key' to presidency…Read more\nFox News Digital spoke with voters in Atlanta about who they think will win their swing state between former President Trump and Vice President Harris(Getty Images)\nTOWN HALL:Harris makes pitch to Latino voters at Univision town hall: Top 5 moments…Read more\n'OPERATION AURORA':Trump to announce 'Operation Aurora' to target Tren de Aragua gang in Colorado rally…Read more\nPOLITICAL STORM:Milton's gone, but the political storm keeps raging over federal government's hurricane efforts…Read more\nDOUBLE WHAMMY:As Hurricane Milton hits Florida, so do more illegal immigrants…Read more\nMARYLAND SENATE: Alsobrooks backs court-packing as Hogan fights GOP, McConnell, Trump associations…Read more\n'DO YOUR JOB!':Jewish organization blasts colleges in billboard ad near San Diego State University to combat antisemitism…Read more\nThe Chabad House near San Diego State University has a new menorah standing taller than the previous one that had been vandalized three times in two years.(Chalom Boudjnah/Chabad House at SDSU )\nLIGHT IT UP:Blue state CEO sued over pro-Trump sign nets 'epic win for free speech'…Read more\nDEMOCRACY '24:Alaska, Colorado, and Massachusetts begin absentee voting…Read more\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more onFoxNews.com.\nThis article was written by Fox News staff."}, {"title": "Fox News Politics: Harris and the Hurricanes", "link": "https://www.foxnews.com/politics/fox-news-politics-harris-hurricane", "content": "Welcome to Fox News’ Politics newsletter with the latest political news from Washington D.C. and updates from the 2024 campaign trail.\nWhat's happening…\n-Mayorkasrefuses to answer questionson Afghan terror plot…\n-DemsfretHarris momentum has stalled…\n-GOP seesopportunityas Dems struggle with working class voters…\nFlorida Gov. Ron DeSantis bashed Vice President Kamala Harris for attempting to insert herself into the response to hurricanes Helene and Milton on Thursday.\nDeSantis and Harris have clashed in recent days after the governor declined to take a call from Harris regarding thehurricane response.He said Thursday that Harris has \"no role\" in the process and added that she had never attempted to call him during previous storms in Florida.\n\"I am working with the president of the United States. I'm working with the director of FEMA [Federal Emergency Management Agency]. We've been doing this now nonstop for over two weeks,\" DeSantis said Thursday.\n\"Although I've worked well with the president, she has never called Florida. She has never offered any support,\" he said of Harris. \"I don't have time for those games. I don't care about her campaign. Obviously, I'm not a supporter of hers, but she's not, she has no role in this process. And so I'm working with the people I need to be working with.\"…Read more\nFlorida Gov. Ron DeSantis holds multiple storm preparation news conferences on Oct. 7, 2024 as Hurricane Milton bears down on Florida(Office of Florida governor)\nBRIEFING BATTLE:Mayorkas refuses to answer questions on Afghan terror plot…Read more\nBACK TO CRIMEA:Biden blames Obama for Ukraine war: report…Read more\n'GLITCH':Harris' past comes back to haunt her after crime victim from her policy blasts resurfaced speech…Read more\nMORE NEEDED:FEMA has enough resources to address hurricanes but 'will need additional funds,' Mayorkas says…Read more\nPOLITICAL STORM:Mayorkas rips 'pernicious' misinformation over FEMA relief…Read more\n'OUT OF MONEY':Lack of Secret Service funds, delayed payments to Homeland Security teams revealed…Read more\n‘KILL AND BURY':Defund police Dem's past comes back to haunt him in resurfaced police report…Read more\n'SCARED TO DEATH':Dems fret Harris' momentum has waned, urge campaign to be more aggressive…Read more\nTESTER TESTED:GOP upset in Montana race could flip the Senate…Read more\nLABOR'S LOVE LOST?:As Harris struggles with working class voters, GOP sees opportunity…Read more\nUNEXPECTED OPPOSITION:Battleground Dem warns traditional voting bloc being 'split' in 2024…Read more\nNEIGHBORLY ADVICE:For Wisconsin Dems, a 2024 win in the battleground state is years in the making…Read more\n'BIDENVASION':Kari Lake, Ruben Gallego spar over illegal immigration in AZ Senate debate…Read more\n'FOLLOW THE STUDENT':Trump calls for federal education dollars to 'follow the student,' in push for universal school choice…Read more\nDECIDING FACTOR?:Trump holds lead over Harris in battleground states on this issue…Read more\n'CRICKETS':Walz silent on support for eliminating Electoral College after Harris camp says it does not back proposal…Read more\nWHO'S MORE ACCESSIBLE?:Trump-Vance have done significantly more interviews than Harris-Walz…Read more\nRepublican presidential nominee former President Donald Trump speaks at a campaign rally at Riverfront Sports, Wednesday, Oct. 9, 2024, in Scranton, Pa. (AP Photo/Julia Demaree Nikhinson)(AP Photo/Julia Demaree Nikhinson)\n‘INHUMANE AND UNCONSTITUTIONAL’:Death row inmates would be able to introduce newly discovered evidence in proposed bill…Read more\nSHOCKING DEATH TOLL:More Russian casualties in Ukraine war than all conflicts combined since WWII: US…Read more\nBATTLE CONTINUES:DACA saga drags on…Read more\nDEVOUT CATHOLIC:Ethel Kennedy, RFK's widow, dead at 96…Read more\n'LET HER SUFFER AND DIE':Hospital that delayed Georgia woman's emergency D&C blamed for death: lawyer…Read more\nGet the latest updates from the 2024 campaign trail, exclusive interviews and more onFoxNews.com.\nThis article was written by Fox News staff."}, {"title": "Trump counters Harris media blitz by ripping Bob Woodward, Howard Stern and her hurricane briefing", "link": "https://www.foxnews.com/politics/trump-counters-harris-media-blitz-ripping-bob-woodward-howard-stern-hurricane-briefing", "content": "Panelists Kellyanne Conway, Howard Kurtz and Patrick Murphy react to Vice President Kamala Harris’ recent media interviews on ‘The Story.’\nOn one point, at least, the Kremlin has sided with Bob Woodwardagainst former President Donald Trump.\nWoodward is coming out with a new book, and among its headline-making disclosures is his report on what happened when the pandemic struck, when the death toll was soaring and people could not get home testing kits for COVID-19.\nFROM KISSY-FACE SITDOWN ON ‘THE VIEW’ TO A TOUGHER GRILLING ON ‘60 MINUTES,’ KAMALA HARRIS IS MAKING NEWS\nTrump, at that point in 2020, secretly sentVladimir Putina number of Abbott Point of Care COVID test machines \"for his personal use.\"\nThe Trump campaign said Woodward’s book, an advance copy of which was obtained by CNN, consisted entirely of made-up stories.\nHowever, Kremlin spokesman Dmitri Peskov confirmed the receipt of theCOVID machines.\nFormer President Donald Trump, left, and investigative journalist Bob Woodward.(Getty Images)\n\"As for the tests, when the pandemic began, countries did not have enough equipment,\" Peskov said. \"And many countries then exchanged such gestures of support and sent each other shipments of various equipment they had.\"\nIn fact, during the spring of 2020, Russia sent the Trump administration 60 tons of medical equipment.\nWoodward also quotes the Russian dictator as telling Trump, \"I don’t want you to tell anybody because people will get mad at you, not me. They don’t care about me.\"\nKAMALA 2.0’S CHALLENGE? MAKING MORE NEWS, AND NOT JUST WITH ULTRA-FRIENDLY HOSTS\nHowever, Peskov disputed another assertion by Woodward, that Trump has stayed in touch with Putin since he left the White House, with as many as seven calls between them. \"As for the calls, that's a lie,\" Peskov said.\nIn the book \"War,\" however, the Washington Post sleuth recounts a scene where Trump tells a top aide to leave the room so \"he could have what he said was a private phone call with Russian President Vladimir Putin.\" Trump officials now say they are not aware of any such conversations.\nThe former president granted Woodward 18 taped interviews for his previous book, but they had a falling out after the veteran reporter wrote that Trump was unfit for office and was sued by his subject for releasing the recordings.\nRussian President Vladimir Putin holds a meeting with the acting governor of Kaliningrad Region at the Novo-Ogaryovo state residence, outside of Moscow, on Aug. 14, 2024.(Gavriil Grigorov/POOL/AFP via Getty Images)\nI know Woodward’s work extremely well, and while any journalist can be misled by sources, he does not make things up.\nOther parts of the book dealwith President Bidenconfronting Putin about the coming invasion of Ukraine, had Vice President Kamala Harris warn a skeptical Volodomyr Zelenskyy, and – with officials assuming a 50% chance that he might use a tactical nuclear weapon against the Ukrainians, called the Kremlin boss the \"epitome of evil.\"\nThe president repeatedlycursed out Israeli Prime Minister Benjamin \"Bibi\" Netanyahu, calling him an \"SOB\" and, later, a \"f---ing liar\" after the Israeli prime minister invaded the crowded area called Rafah despite American pressure.\nWHY VANCE EASILY BEAT WALZ IN DEBATE, SOFTENING HIS IMAGE IN THE PROCESS\nIn the statement from Trump’s spokesman, which sounds like it was dictated by the boss, Woodward is described as \"a truly demented and deranged man who suffers from a debilitating case of Trump Derangement Syndrome. Woodward is an angry, little man and is clearly upset because President Trump is successfully suing him because of the unauthorized publishing of recordings he made previously. President Trump gave him absolutely no access for this trash book that either belongs in the bargain bin of the fiction section of a discount bookstore or used as toilet tissue. Woodward is a total sleazebag who has lost it mentally, and he’s slow, lethargic, incompetent and overall a boring person with no personality.\"\nWhy stop there?\nTrump, who prides himself on being a counter-puncher, wastes little time before swinging away.\nVice President Kamala Harris poses during the Unite for America live-streaming rally in Farmington Hills, Michigan, on Sept. 19, 2024.(SAUL LOEB/AFP via Getty Images)\nAfter Harris’ friendly radio interview with Howard Stern, who said it would be insanity to vote for Trump, a post appeared on Truth Social.\n\"BETA MALE Howard Stern made a fool of himself on his low-rated radio show when he ‘interviewed’ Lyin’ Kamala Harris, and hit her with so many SOFTBALL questions that even she was embarrassed.\n\"He looked like a real fool, working so hard to make a totally incompetent and ill-equipped person look as good as possible, which wasn’t very good. I dropped Howard a long time ago, like most others, and have since been credited with very good judgment!\"\nTrump and Stern were, of course, once New York pals, and Trump attended his wedding.\nTrump also had campaign manager Chris LaCivita take a swipe at Fox News for covering (along with other networks) a government briefing, featuring both Biden and Harris, on Hurricane Milton as the monster storm was heading toward Florida.\n\"@FoxNews ⁩just as bad as every other ‘cable news’ network …running literally propaganda and @KamalaHarris ⁩TV ads disguised as a news conference,\" Chris LaCivita posted on X.\nCLICK HERE TO GET THE FOX NEWS APP\nOf course, there’s a political benefit for Harris showing that she and FEMA are working hard to prepare for the Florida storm, just as there is when Florida Gov. Ron DeSantis holds a presser on the Category 5 threat.\nHowever, with Harris' media blitz finally making some news after weeks in which Trump has dominated the campaign coverage, this reflects his determination to insert himself into every story that surfaces, no matter how negative.\nHoward Kurtz is the host of FOX News Channel'sMediaBuzz(Sundays 11 a.m.-12 p.m. ET). Based in Washington, D.C., he joined the network in July 2013 and regularly appears onSpecial Report with Bret Baierand other programs."}, {"title": "From kissy-face sitdown on ‘The View’ to a tougher grilling on ‘60 Minutes,’ Kamala Harris is making news", "link": "https://www.foxnews.com/politics/kissy-face-sitdown-view-tougher-grilling-60-minutes-kamala-harris-finally-making-news", "content": "‘The Five’ co-hosts critique Vice President Kamala Harris' performance in her new media blitz.\nIt was a cringe-inducing moment.\nNo one expected Kamala Harris to be grilledon \"The View,\"comprised of cheerleaders for her candidacy.\nBut Whoopi Goldberg introduced her by bellowing \"the next president of the United States,\" it was a slap-your-forehead moment.\" Seriously?\nThe whole session yesterday was an in-kind contribution tothe Harris campaign.\nKAMALA 2.0’S CHALLENGE? MAKING MORE NEWS, AND NOT JUST WITH ULTRA-FRIENDLY HOSTS\nI know, they’re not straight journalists, they’re liberal commentators slash entertainers. They read their questions verbatim off blue cards. That’s precisely why she wanted to do the show.\nThere were some reasonable questions: How would her presidency differ from Joe Biden’s? How would she handle the border? Why wouldn’t Ron DeSantis take her callsabout hurricane preparationswith a Category 4 storm about to hit Florida?\nAnd then there was Joy Behar, who went on about Trump’s lies and asked how anyone could possibly support him. That enabled the Vice President to say Trump was all about personal grievances, not the voters.\nVice President Kamala Harris appeared on Tuesday's episode of \"The View.\"(ABC)\nKamala made good use of the forum, such as dishing on how she was working out and with her kids when Joe Biden called to say he was stepping aside.\nBottom line: \"The View,\" an ABC program founded by Barbara Walters – it’s still in the news division – was even more embarrassing than I expected, with the ladies falling all over themselves to praise Harris and trash Trump.\nSome reasonable questions were asked, but Kamala ran circles around them and deflected what she didn't want to answer while getting her familiar talking points in.\nIt was a good forum for her, and for once she came prepared to make news. In a move earlier leaked to Politico, Harrismade her pitchfor having Medicare reimburse caring for the elderly at home instead of only in expensive institutions – the first new policy proposal she's made in weeks. She said she would pay for it by demanding deeper discounts on certain drugs paid for by Medicare. Needless to say, she was not exactly cross-examined on the subject.\nWALZ-HARRIS WILL BE THE MOST ‘RADICAL’ ELECTED OFFICIALS THE WORLD HAS SEEN: COREY LEWANDOWSKI\nThe ladies seemed awed that Kamala Harris was even there.\nIt was a very different Kamala who appeared on a \"60 Minutes\" prime-time special aired the night before.\nTo be sure, the news magazine show repeated some of her criticisms of Trump, with Bill Whitaker saying: \"You have accused Donald Trump of using racist tropes when it comes to Haitian immigrants. In Springfield, Ohio. When it comes to birtherism, when it comes to Charlottesville, in fact, you have called him a racist and divisive, yet Donald Trump has the support of millions and millions of Americans.\"\nThe veep’s talking-point response: \"I believe that the people of America want a leader who's not trying to divide us and demean.\"\nBut Whitaker was a bulldog when it came to asking for followups again and again when the Democratic nominee offered generalities.\nCBS News appears to have made a favorable edit to its \"60 Minutes\" interview with Vice President Kamala Harris.(Screenshot/CBS News)\nWhen asked about the Committee for a Responsible Federal Budget saying her plan would add $3 trillion over the next decade – it was much higher for Trump – Harris talked about economists liking her plan and pivoted to praising small business.\nWhitaker’s response: \"Pardon me, Madam Vice President. The question was, how are you going to pay for it?\"\nThis time, Harris said she’d make sure billionaires and big corporations would have to pay their \"fair share,\" and Whitaker expressed skepticism that Congress would approve that.\nThis was the question that Harris hasn’t really had to answer.\n\"Let me tell you what your critics and the columnists say, okay? They say that the reason so many voters don't know you is that you have changed your position on so many things,\" said Whitaker. \"You were against fracking. Now you're for it. You supported looser immigration policies, now you're tightening them up. You are forMedicare for All. Now you're not so many that people don't truly know what you believe or what you stand for.\"\n'60 MINUTES' DEFENDS HANDLING OF HUNTER BIDEN LAPTOP COVERAGE AS IT HITS TRUMP FOR SKIPPING INTERVIEW\nHarris offered this answer: \"In the last four years I have been vice president, United States. And I have been traveling our country. And I have been listening to folks and seeking what is possible in terms of common ground. I believe in building consensus.\" Translation: The world has changed and I have to be realistic about what I can get passed.\nThe interview was so heavily edited that you could see the changes several times as Harris magically limited her answers to two sentences. That’s the overproduced \"60 Minutes\" style, but I think it was a mistake.CBS should haverun the whole thing, or a major chunk of it, unedited.\n(SAUL LOEB/AFP via Getty Images)\nScott Pelley said Trump had agreed to an interview but backed out with shifting explanations, including that there be no fact-checking.\nBy yesterday afternoon, Kamala was taping her interview with Howard Stern, who loved Trump back in the day when they were rating women and has been totally opposed to him as a candidate and president.\nReacting to Bob Woodward’s forthcoming book saying Trump secretly sent Vladimir Putin a COVID test machine during the pandemic – which the former president denies – the VP said: \"I believe that Donald Trump has this desire to be a dictator. He admires strongmen and he gets played by them because he thinks that they’re his friends and they are manipulating him full-time and manipulating him by flattery and with favor…\n\"This guy who is President of the United States is sending them to Russia? To a murderous dictator for his personal use?\"\nCLICK HERE TO GET THE FOX NEWS APP\nStern called it \"maddening\" and \"insanity\" that anyone would support Donald Trump. He told Harris he would vote for her, but could also vote for \"that wall over there\" over the ex-president.\nHarris is finally starting to make some news. Imagine if she’d started some of these interviews weeks ago.\nHoward Kurtz is the host of FOX News Channel'sMediaBuzz(Sundays 11 a.m.-12 p.m. ET). Based in Washington, D.C., he joined the network in July 2013 and regularly appears onSpecial Report with Bret Baierand other programs."}]