[{"source": "abcnews", "title": "Trump says US troops should be used to go after 'radical left.' Can he do that?", "link": "https://abcnews.go.com/Politics/could-trump-use-military-go-after-radical-left/story?id=114806253", "content": "The military isn't supposed to police Americans, but there are exceptions.\nFormer President Donald Trump saysactive-duty or National Guard troops could be usedto go after \"radical left lunatics\" to handle any Election Day chaos, warning that the bigger problem facing the United States isn't a foreign enemy but \"the people from within.\"\nThe suggestion of using military force following a political election is hypothetical, considering Trump won't have command of U.S. troops in November. If he wins the election, Trump wouldn't gain control of the armed forces until mid-January following the inauguration.\nBut deploying the military within U.S. borders is a suggestion Trump has made before, including the idea that the military could police the southern border and help deport an estimated 11 million undocumented immigrants in the United States.\n\"I think the bigger problem are the people from within,\" Trump told Fox News' \"Sunday Morning Futures.\"\n\"We have some very bad people. We have some sick people, radical left lunatics... And it should be very easily handled by, if necessary, by National Guard or really necessary by the military, because they can't let that happen,\" he said.\nSo, can a president use U.S. troops to police Americans and quash political protests?\nMany of Trump's supporters say yes, citing a 200-year-old law meant to curb rebellions. The Insurrection Act of 1807 was used during the Civil War and throughout the 1960s to enforce civil rights laws.\nLegal experts are now warning the law is dangerously vague and ripe for abuse.\nHere's what to know about the use of military power on U.S. soil:\nThe 1878 Posse Comitatus Act mostly prohibits active-duty military troops from carrying out law enforcement duties inside the United States.\nThe idea behind the law is that any president -- as commander in chief of U.S. forces -- shouldn't be allowed to use federal military might against its own citizens.\nBut it's a different law that was passed earlier that century that's caught the attention of many Trump supporters.\nFirst enacted in 1807, theInsurrection Actsays the president can call on a militia or the U.S. armed forces if there's been \"any insurrection, domestic violence, unlawful combination or conspiracy\" in a state that \"opposes or obstructs the execution of the laws of the United States or impedes the course of justice under those laws.\"\nAccording to theBrennan Center for Justice, the law has been invoked dozens of times throughout history, including by Abraham Lincoln during the Civil War and by Lyndon B. Johnson to quell rioting after the assassination of Martin Luther King Jr.\nIn 1957, President Dwight D. Eisenhower used the law to deploy members of the Army's 101st Airborne Division to escort nine Black students into Little Rock Central High School, after the Arkansas governor used the state's National Guard to prevent the students from entering the school.\nMore recently, the law was invoked by President George H.W. Bush during the1992 riots inLos Angelesthat followed the trial acquittal of police officers in the Rodney King case. The law was also under consideration in 2005 following Hurricane Katrina, but was not used.\nIn the days leading up to the Jan. 6 riot, some Trump supporters wanted the president to invoke the Insurrection Act as a justification for far-right militia groups to storm the Capitol and to keep Trump in power despite losing the election.\nTrump falsely claimed he won the election, but never invoked the Insurrection Act while in office.\nLegal experts have proposed reforms to the Insurrection Act, includingone proposalearlier this year by the American Law Institute.\n\"There is agreement on both sides of the aisle that the Insurrection Act gives any president too much unchecked power,\"Jack Goldsmith, a Harvard law professor and former assistant attorney general in the Bush administration, said last April.\nIt's unlikely, though, that such a sharply divided Congress would take up the issue any time soon.\nThere's another law, too, that Trump could try to rely on when it comes to handling illegal immigration -- the 1798 Alien Enemies Act, which allows the president to deport any noncitizen from a country that the U.S. is at war with.\nIn his interview withTime magazinethis year, Trump didn't cite a legal justification when he said he'd use the National Guard to conduct mass deportations and create detention camps for people living illegally inside the U.S.\nIn the end, whether any of Trump's proposals are legal would likely be determined by the courts, including federal judges he appointed.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Trump's 'enemy from within' threat spurs critics' alarm about his authoritarian shift", "link": "https://abcnews.go.com/Politics/trumps-enemy-threat-spurs-critics-alarm-authoritarian-shift/story?id=114816374", "content": "He suggested the military could be used against \"radical left lunatics.\"\nDonald Trump, in a recent interview, suggested his political opponents are more of a threat to the U.S. than top foreign adversaries such as China and Russia when it comes to the 2024 election.\n\"I think the bigger problem are the people from within,\" Trumptold Fox Newsanchor Maria Bartiromo. \"We have some very bad people. We have some sick people, radical left lunatics.\"\nThen he floated the idea of deploying the military against them on American soil, arguing without proof they would be more likely to sow chaos on Nov. 5 than his supporters -- despite what transpired on Jan. 6, 2021.\n\"I think it should be very easily handled by, if necessary, by National Guard, or if really necessary, by the military, because they can't let that happen,\" Trump added.\nThe dark comments highlight Trump's increasing bend toward authoritarian rhetoric in his third White House campaign, some political scientists told ABC News.\n\"It's really classic authoritarian discourse,\" said Steven Levitsky, a Harvard University professor and author of \"How Democracies Die,\" citing examples from 1930s Europe and 1960s Latin America.\n\"In each of these cases, autocrats used exactly this language: there's an enemy within that's more dangerous than our external enemies and that justifies the use of extra-constitutional measures,\" he said. \"How many times does Trump have to use this rhetoric before we realize that this is not a normal election?\"\nTrump's \"enemy from within\" comments come after a history of praising authoritarian leaders in public as well asthreats to jail election workers, pledges to take on the civil service and toenact retributionon political enemies if elected -- all of which would significantly stretch the normal limits of executive power.\nVice President Kamala Harris, playing clips of his Fox News comments, painted Trump as \"increasingly unstable and unhinged\" and \"out for unchecked power\" at a Pennsylvania rally on Monday.\n\"He considers anyone who doesn't support him or who will not bend to his will an enemy of our country. It's a serious issue,\" Harris said. \"He is saying that he would use the military to go after them.\"\nHarris added, \"This is among the reasons I believe so strongly that a second Trump term would be a huge risk for America and dangerous.\"\nMeanwhile, some Republicans attempted to downplay Trump's comments.\nOhio Sen. JD Vance, Trump's running mate, said he thought they were related to illegal migrants -- despite Trump specifically shifting his conversation with Bartiromo away from undocumented immigrants or foreign actors toward who he called \"radical left lunatics.\"\nVirginia Gov. Glenn Youngkin, a Republican, tried to make a similar argument on CNN, in what turned into a tense exchange with host Jake Tapper as Youngkin said he \"didn't believe\" that Trump was talking about using the military against Democrats.\nThe Trump campaign, too, suggested the former president's comments were related to immigration.\n\"The Harris-Biden administration has unconscionably abused our refugee and asylum systems, and turned them into programs to import mass numbers of unvetted migrants from the most dangerous countries on earth, at the expense of Christians and other persecuted religious minorities who those programs were intended to help,\" spokesperson Steven Cheung said in a statement to ABC News.\nCritics expressed concern not only about Trump's comments but how they're being received by the GOP.\n\"All the time in authoritarian states you see branding of some faction of the political opposition not as loyal opposition but as enemy opposition,\" said Kim Lane Scheppele, a professor of sociology and international affairs at Princeton University.\nScheppele noted the U.S. has some history with this, such as Republican President Richard Nixon and GOP Wisconsin Sen. Joseph McCarthy's abuses of power to go after perceived political foes.\nBut there is a key distinction between then and now, she said, in that Nixon and McCarthy were ostracized by their peers.\n\"This one is really different because Trump's got this mass movement and a set of people who are willing to fight for him,\" Scheppele said.\nLevitsky said so long as Republicans are standing by Trump, \"democracy is going to be in trouble.\"\n\"I think the most shocking thing is not what Trump said, but the silence that we hear in response to it, particularly among conservative elites who know better, or who should know better,\" Levitsky said.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Democrats, Republicans lining up in new ways in 2024. No one knows what's next.", "link": "https://abcnews.go.com/Politics/parties-coalitions-changing-election-day/story?id=114793336", "content": "\"We can't take voters for granted,\" one Democrat said.\nThe Democratic and Republican Parties' coalitions are undergoing a seismic change just weeks before Vice President Kamala Harris and former PresidentDonald Trumpface off against each other.\nWhat comes after Election Day is anyone's guess.\nHarris is overperforming with seniors, sparking speculation she could even win a demographic that has traditionally leaned Republican. Trump, meanwhile, is eating into Democrats' edge with Black and Hispanic voters, particularly males, eroding a gap that has sunk past GOP presidential contenders.\nThe 2024 presidential election therefore marks not just a key race to see who leads the country but also one of the first contests under what could be brand new dynamics for the parties. Gone, at least for now, are the days of Republicans banking on the support of older voters -- some of the nation's most reliable ballot punchers -- and Democrats' proclamations that demography is destiny.\n\"The trend lines are that we can't take voters for granted, neither party can take voters for granted. The coalitions are shifting,\" said Jamal Simmons, a Democratic strategist and former communications director for Harris' vice-presidential office.\nPoll after poll suggests voter preferences are altering with little time to suss out what the changes mean.\nA CNN/SSRS poll released last month showed Harris leading Trump 50-46 among voters 65 years old and up. No Democratic presidential contender has carried that group since Al Gore in 2000.\nMeanwhile, a recent Pew poll showed Trump getting 14% support among Black voters and 38% support among Hispanic voters, compared to 79% and 54% for Harris, respectively. In 2020, President Joe Biden won 87% support from Black voters and 65% support from Latinos.\nThose numbers are even starker when divided by gender.\nBiden won 79% support from Black men and 59% support among Hispanic men four years ago. In the pew poll, those numbers dropped to 72% support for Harris from Black men and 53% support for her from Hispanic men.\nThe shifting numbers have the campaigns and outside operatives scrambling to figure out why voter preferences are changing the way they are and how long after Nov. 5 that shift will continue.\nStrategists in both parties speculated that seniors defecting to Harris are motivated by temperament and healthcare and are potentially spooked by the Jan. 6, 2021, riot on Capitol Hill and repeated Democratic attacks that Republicans will go after long-coveted entitlement programs.\n\"One is, is that Democrats have done a lot for seniors. Thirty-five-dollar insulin, $2,000 cap on prescription drugs, negotiating with Medicare, etc., etc. They have an advantage on voters trust them on Social Security and Medicare more than Republicans. And I think that there's a qualitative thing, which is, I don't think for seniors, Trump is their type of Republican. They don't like his behavior,\" said John Anzalone, a Democratic pollster who conducts surveys for both Harris' campaign and AARP.\nBlack and Latino voters, meanwhile, are thought to be leaning more on economic arguments than racial ones that Democrats had long deployed. Those voters, experts said, have defied traditional thinking of voters with uniquely strong cultural concerns and instead are taking into account similar concerns as white working-class voters.\n\"What you're seeing is this transformation of things like race and ethnicity, where Black and brown voters are increasingly becoming more Republican for reasons that are clearly not racial,\" said Mike Madrid, a GOP strategist who studies and writes about Latino voting patterns. \"This peculiar interaction between race, economic class and diplomas or college education...are happening in very unique ways that are reshaping the coalitions.\"\n\"The Democratic Party is becoming more white, it's becoming less diverse, and where it's concentrating voters is with college-educated white progressives who are much more insulated to the economy and economic shocks and things like inflation and recessions. Those aren't issues for them. What is, is abortion rights, gun control, marriage equality,\" he said.\nEconomic frustrations are thought to be particularly motivating among men, with whom Trump is consolidating support.\n\"Democrats have to talk about issues that are important to men, which are very often economic issues, particularly around aspirations. Men want to be able to take care of their families, be contributors to society, and have the standing that comes with a good job or a good business,\" Simmons said.\nEach candidate is putting in work to stem their losses.\nTrump has boasted of his plan to end taxes on Social Security income, and Harris is waging a full court media blitz to bring Black men back into the fold, appearing on key radio shows and deploying former President Barack Obama to deliver a stern message to those potentially wary of electing a female president.\nThe country will only have to wait mere weeks to see if those efforts will pay off -- for this election. Even the most veteran operatives aren't sure what happens from Nov. 6 onward.\nTrump has said this will be his last race, and his singular hold on the GOP may not be replicated, meaning the day after he leaves the stage -- whenever that happens -- could mark a watershed political moment.\n\"I think you're asking the right questions. I just don't have all the right answers,\" GOP pollster Whit Ayres said when asked what comes next. \"I am loathe to try to give a prediction about what a party would look like without a figure that has so dominated the party for the last eight years.\"\nSome strategists think the dynamics will snap back -- with seniors going back to Republicans and voters of color coming home to the Democratic Party, arguing that the unique personalities in this year's race are driving the movement, as seen by more traditional trends playing out in some down-ballot races.\n\"If he goes away, if we beat him, I think that this whole thing starts lining back up as long as you have a strong Democratic nominee,\" said Democratic strategist Chuck Rocha. \"I don't see all the opportunities once Donald Trump is gone, because the Donald Trump phenomenon is only happening with Donald Trump.\"\n\"I think Trump is seen as better on the economy among a subset of younger voters than most Republicans. So, I think it will be challenging for Republicans writ large to mimic that success,\" added a source familiar with the Harris campaign's thinking.\nOthers disagreed, noting that the trends that are producing the changes, such as a rise in populism, were bubbling up prior to Trump and will outlive his political career.\n\"I don't think Trump is the driver of this,\" Madrid said. \"These dynamics began before him.\n\"I don't think it's as clear as to say one group is going to benefit over the other. I think what we're seeing is the movement of all these pieces away from a right-left spectrum to a top-down spectrum,\" he added.\nStill others predicted a whole new ballgame.\nTrump has undoubtedly altered America's politics, and, as seen by the failures of some of his primary rivals, his personal brand is difficult to replicate -- meaning without him on a ticket, the country might simply be staring into the political unknown.\n\"Floodgates open up for there to be competition among subgroups. I absolutely believe that. I think all bets are off. And it just depends on who the candidates are on both sides,\" Anzalone said. \"There may be no snapping back.\"\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Arrest made in connection with FEMA threats in North Carolina", "link": "https://abcnews.go.com/Politics/threats-fema-workers-north-carolina-sheriff/story?id=114776904", "content": "The man was armed with a handgun and rifle, according to the sheriff's office.\nThe sheriff's office in Rutherford County, NC, announced Monday that they'd arrested a man and charged him with allegedly threatening to harm Federal Emergency Management Agency (FEMA) workers in the area.\nWilliam Parsons, 44, of Bostic, NC, was charged with \"going armed to the terror of the public,\" according to a statement from the Rutherford County Sheriff's Office provided to ABC News.\nThe Rutherford County Sheriff's Office statement said deputies on Saturday investigated reports in the vicinity of Lake Lure and Chimney Rock that a \"white male had an assault rifle and made the comment about possibly harming FEMA employees\" working in the area. Witnesses were able to provide enough information for law enforcement to ultimately locate and identify Parsons, who was armed with a handgun and a rifle, according to the statement.\nParsons was released Saturday after posting $10,000 bond, according to the Rutherford County Sheriff's Office.\n\"The initial report stated there was a truckload of militia that was involved. However, after further investigation, it was determined Parsons acted alone and there were no truckloads of militia going to Lake Lure,\" the statement said.\nAccording to SITE Intelligence, which tracks the online activity of extremist organizations, Parsons has promoted the militia group the Three Percenters online.\nNews of the arrest came one day after the sheriff in Ashe County, NC, about two hours to the north of Rutherford County, said that there had been threats against FEMA employees responding to Hurricane Helene.\n\"Recently in the mountain region, there have been threats made against them,\" Ashe County Sheriff Phil Howellposted on Facebookregarding the alleged threats against FEMA employees.\n\"This has not happened in Ashe County or the surrounding counties,\" Howell added. \"Out of an abundance of caution, they have paused their process as they are assessing the threats.\"\nSheriff Howell did not specify in his post who allegedly made the threats, nor is it known if Parsons' alleged threat is the one to which Sheriff Howell was referring. An ABC News request for comment sent to the Ashe County Sheriff's Office did not receive an immediate response.\nThreats to FEMA employees have been consistent during the Hurricane response, along with misinformation, federal authorities told ABC News.\nSearch and rescue efforts in the affected areas continue, a federal source told ABC News. However, while FEMA assesses potential threat information, disaster survivor assistance teams are currently working at fixed locations and secure areas instead of going door to door, out of an abundance of caution, the source said, adding that FEMA will monitor threat information and make adjustments to this posture on a regular basis in coordination with local officials.\nA FEMA spokesperson told ABC News that the agency continues to support communities impacted by Helene and to help survivors apply for assistance.\n\"For the safety of our dedicated staff and the disaster survivors we are helping, FEMA has made some operational adjustments,\" the spokesperson said. \"Disaster Recovery Centers will continue to be open as scheduled, survivors continue to register for assistance, and we continue to help the people of North Carolina with their recovery.\"\nAt the direction of North Carolina Gov. Roy Cooper, the state's Department of Public Safety will assist FEMA conduct their operations.\n\"We know that significant misinformation online contributes to threats against response workers on the ground, and the safety of responders must be a priority,\" the governor said.  \"At my direction, the North Carolina Department of Public Safety is helping partners like FEMA to coordinate with law enforcement to ensure their safety and security as they continue their important work.\"\nSheriff Howell said that FEMA locations in Ashe County are open this week.\n\"Stay calm and steady during our recovery, help folks and please don't stir the pot,\" he said.\nFEMA Administrator Deanne Criswell told ABC News Friday during a press briefing that threats to FEMA employees are a \"shame\" and a \"distraction.\"\n\"We continuously monitor the social media, channels, other outlets where we're seeing this information, because we want to make sure we're providing for the safest environment for our employees, and making sure that they know that their safety is first and foremost for us as they go out into these communities,\" Criswell said in response to a question from ABC News.\nFEMA hires people from local communities when disaster hits, Criswell said, noting that \"many\" leave their families behind to go and help communities who are impacted by disaster.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Harris works to appeal to Black men, a critical group for Democrats", "link": "https://abcnews.go.com/Politics/harris-works-appeal-black-men-critical-group-democrats/story?id=114780568", "content": "The vice president will continue to court Black men while in Detroit.\nFor a second day this week, Vice President Kamala Harris is focusing on a key voting bloc that is a critical base for the Democratic Party: Black men.\nOn Tuesday, Harris will participate in an audio town hall event with Charlemagne tha God, host for the popular \"The Breakfast Club\" podcast. Also on Tuesday, the vice president is meeting with Black entrepreneurs in Detroit.\nHer events come a day after her campaign rolled out a comprehensive plan -- just three weeks until the election -- to help Black men \"get ahead\" economically, which includes providing one million fully forgivable loans to Black entrepreneurs and an effort to invest in Black male teachers.\nIn an interview on \"Roland Martin Unfiltered,\" also released on Monday, Harris argued that economic policies that consider \"historical barriers\" facing Black people benefit all Americans.\n\"If you have public policy, and I'm talking about economic public policy specifically at this point, but if you have public policy that recognizes historical barriers and what we need to do then to overcome,\" Harris said. \"First, speak truth about them and then overcome them, that in the process of doing that, not only are you directly dealing with the injustices and the legal and procedural barriers that have been focused on Black folks, but by eliminating those barriers, everyone actually benefits, right?\"\nThe focus on Black voters comes afterformer President Barack Obama sternly chided Black menover \"excuses\" to not vote for Harris while speaking to a group of Black at a campaign field office in Pittsburgh's East Liberty neighborhood last week.\n\"You have [Trump], who has consistently shown disregard, not just for the communities, but for you as a person, and you're thinking about sitting out?\" Obama asked. \"And you're coming up with all kinds of reasons and excuses?\"\nHarris is polling ahead of Trump with Black voters who are registered to vote, 82-13%, according tothe latest ABC News/Ipsos poll. That compares with 87-12% in the 2020 exit poll (a slight 5 points lower for Harris; no better for Trump). Black men are at 76-18% (compared with 79-19% four years ago), the poll found.\nThese differences from 2020 aren't statistically significant, and Georgia Sen. Raphael Warnock said he agrees.\n\"I don't buy this idea that there will be huge swaths of Black men voting for Donald Trump. That's not going to happen. What I would urge folks to do is to show up, to understand that if you don't vote, that is a vote for Donald Trump. That's the concern.,\" said Warnock on a Tuesday campaign call with reporters.\nPart of the Harris campaign's plan for Black men includes legalizing recreational marijuana nationwide. Such a move would \"break down unjust legal barriers that hold Black men and other Americans back,\" the campaign said in its release.\nThis takes the Biden administration's current stance, which includes pardoning people convicted of marijuana possession, a step further. For Harris' part, such a proposal is evidence of her evolving position. She has become more progressive since her time as attorney general of California when she was heavily criticized for aggressively prosecuting weed-related crimes.\nAsked if she ever smoked by Charlamagne tha God back in 2019, Harris responded, \"I have. And I inhaled -- I did inhale. It was a long time ago. But, yes.\"\nShe went on to clarify that she believes in legalizing the substance.\n\"I have had concerns, the full record, I have had concerns, which I think -- first of all, let me just make this statement very clear, I believe we need to legalize marijuana,\" she said. \"Now, that being said -- and this is not a 'but,' it is an 'and' -- and we need to research, which is one of the reasons we need to legalize it. We need to move it on the schedule so that we can research the impact of weed on a developing brain. You know, that part of the brain that develops judgment, actually begins its growth at age 18 through age 24.\"\nHer answer garnered backlash due to her record prosecuting the substance, particularly given the racial disparities in punishment nationwide. Harris' new proposal looks to correct those historical inequities.\nBut is it enough?\nIn addition to the new proposals, Harris has aggressively been campaigning in Black communities in the past week, stopping at several local Black-owned businesses and churches in North Carolina, Pennsylvania and Michigan as well as appearing on several media programs with predominately Black audiences.\nIn September, Harris told a group of Black reporters in a moderated conversationhosted by the National Association of Black Journaliststhat she was \"working to earn the vote, not assuming I'm going to have it because I am Black.\"\nHer campaign launched a \"Black Men Huddle\" organizing call on Monday, which featured remarks from campaign senior officials Tony West, Brian Nelson, Quentin Fulks and Rep. Cedric Richmond. Later, there was a weekly event focused on Black men supporting Harris featuring actor Don Cheadle.\n\"What the vice president is doing is giving us the tools to be able to go and have meaningful, impactful conversations when Black men turn back around to us and say, 'Well, what's in it for me,' I think that we have policy and tools like this that we can say exactly that,\" said Fulks.\nDoc Rivers, whointerviewed Harris for his \"ALL the SMOKE\" podcast on Monday, said he agreed with Obama's comments last week and pushed for Black men to cast their ballots.\n\"I agree 100% with President Obama -- it's unacceptable not to vote. When you look back at what your parents and your grandparents had to do to get the right to vote, that's unacceptable for me,\" said Rivers. \"But there are Black men who out there that feel hopeless, they don't believe a vote helps them in either way, and I'm here to tell them they're wrong.\"\nABC News interviewed Black men in Pittsburgh's predominately Black Homewood Brushton neighborhood last Friday about their impressions of Harris and what she needed to do to get their vote.\nAquail Bey, a student at The Community College of Allegheny County and president of its veterans club, said Harris needs to meet them where they are and genuinely speak with them.\n\"She's doing a good job right now, but I think she should have -- go to places where they are, you know, meet them on their own terms, you know. Go to the neighborhoods where they are, go to the barber shops ... \" Bey said. \"Wherever the Black men are, go to where they are, speak to them a way that they understand.\"\nAaron Stuckey said people shouldn't assume Black men aren't getting behind Harris.\n\"Just poll us instead of assuming that that's where we're not going,\" he said.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Close fight in the trenches: A look at the ground game in the presidential race: POLL", "link": "https://abcnews.go.com/Politics/close-fight-trenches-ground-game-presidential-race/story?id=114780589", "content": "Harris and Trump are fighting to parity in voter contacts.\nA narrow edge in voter contact by Kamala Harris' campaign at the national level fades to parity in the battleground states -- but Harris has been doing more to turn her contacts into voter assistance, an ABC News/Ipsos poll finds.\nThree weeks before Election Day, and with early voting underway in more than 40 states, the level of political outreach is vast. More than four in 10 Americans have been contacted by the Harris or Trump campaigns asking for their vote, rising to 62% in the seven battleground states.\nNationally, 30% report having been contacted by Harris' campaign, vs. 26% by Trump's -- a small edge for Harris. This evens out in the battleground states, where 47% report contacts by Trump's campaign, 46% by Harris'. These counts exclude fundraising appeals -- and surely have grown since this survey was completed last week.\nSee PDF for full results.\nIn all, 16% of adults have been contacted nationally by Harris' campaign only, 12% by Trump's only and 14% by both, adding to 42%. In the battlegrounds, it's 15% by Trump only, 14% by Harris only and 32% by both.\nThere's a gap in terms of voter assistance. Nationally, 43% of those contacted by the Harris campaign say they were offered one of several forms of voting assistance, vs. 35% of those contacted by Trump's campaign. In the battleground states, offers of assistance run 48-39% in Harris' favor, a slight advantage given sample sizes.\nForms of assistance tested in the survey include checking that people are registered to vote, confirming their plans to vote and making sure they know where to vote. In the battlegrounds (Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin), people contacted by Harris are 8 percentage points more apt than those contacted by Trump to report help making sure they're registered and 7 points more apt to report an effort to confirm they have voted or will vote, both slight differences given sample sizes. Gaps nationally are similar.\nThis poll, produced byLanger Research Associatesfor ABC, with fieldwork byIpsos, also finds some signs of more targeted outreach by Harris. Nationally, 46% of Democrats have heard from her campaign, vs. 37% of Republicans contacted by the Trump campaign. And 42% of Harris supporters say her campaign has reached out to them, vs. 35% of Trump's supporters contacted by his side.\nSimilar to Harris' lead on overall contacts, these gaps disappear in the battleground states. That said, among people in these states who report having voted forJoe Bidenin 2020, 71% report a contact by the Harris campaign this year. Among those who voted for Trump in 2020, fewer, 59%, report a 2024 Trump campaign contact.\nNaturally, Harris' campaign has had far more contact than Trump's among Democrats and liberals, while Trump's has done more outreach to Republicans and conservatives. National results also demonstrate campaign targeting in other ways. Three examples:\n\n\nAmong people younger than 40 -- a generally pro-Harris group -- 27% report a Harris campaign contact vs. 19% contacted by the Trump campaign.\nBy contrast, among white evangelical Protestants, a solidly pro-Trump group, 34% have been contacted by the Trump campaign, vs. 16% by Harris'.\n\nThere are inefficiencies on both sides. Nationally, 24% of Trump supporters have been contacted by the Harris campaign asking for their vote, and 21% of Harris supporters have been contacted by the Trump campaign. Misplaced outreach rises in the battlegrounds: There, 44% of Harris supporters have been asked for a Trump vote, and 41% of Trump supporters have heard from the Harris campaign.\nUsing national data for adequate sample sizes, there are several groups in which Harris' campaign exceeds Trump's in offering assistance to people they've contacted. It's 58% among Black people contacted by Harris' campaign vs. 38% among Black people contacted by Trump's. It's 40% among college graduates contacted by Harris vs. 26% among those contacted by Trump. And the Harris campaign has offered assistance to 42% of independents it's contacted, a potential swing voter group, vs. 32% among independents contacted by the Trump campaign.\nText messages are the most common types of outreach, reported by 61% of those who've heard from either or both of the campaigns. That's followed by email, 43%; postal mail, 36%; social media, 25%; and phone or voicemail, 19%.\nLast on the list is the kind of outreach many political scientists say is most effective -- in-person contact, reported by 6%.\nThe distribution of contact types is similar across the two campaigns overall, albeit with more digital outreach by Harris and more by mail from Trump. Nationally, 84% of her contacts report having heard from her campaign by text, email or on social media vs. 77% of Trump's. Trump, for his part, leads on postal mail outreach, 38 vs. 29%. Distributions look largely similar in the battlegrounds, although both campaigns appear to be focusing more on postal mail; 56% of battleground state respondents who have been contacted by either campaign have been contacted via postal mail vs. 36% nationally.\nThis ABC News/Ipsos poll was conducted online via the probability-based Ipsos KnowledgePanel® Oct. 4-8, 2024, in English and Spanish, among a random national sample of 2,631 adults. Partisan divisions are 29-29-30%, Democrats-Republicans-independents. Results have a margin ofsampling errorof plus or minus 2 percentage points, including the design effect, for the full sample. Error margins are larger for subgroups, including 5 points for battleground state residents. Sampling error is not the only cause of differences in polls.\nThe survey was produced for ABC News byLanger Research Associates, with sampling and data collection by Ipsos. See details on ABC News survey methodologyhere.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Harris calls Trump 'increasingly unstable and unhinged' during Pennsylvania rally", "link": "https://abcnews.go.com/Politics/harris-calls-trump-increasingly-unstable-unhinged-erie-pennsylvania/story?id=114795103", "content": "Harris played clips of Trump during her campaign stop in Erie on Monday.\nVice PresidentKamala Harrisdeployed a new show-and-tell approach to lambasting former PresidentDonald Trumpat her Monday night rally, playing clips of him calling his opponents the \"enemy within\" and saying that it signaled that he was \"increasingly unstable and unhinged.\"\n\"After all these years, we know who Donald Trump is: He is someone who will stop at nothing to claim power for himself,\" Harris said during her campaign stop in Erie, Pennsylvania.\n\"And you don't have to take my word for it. I've said, for a while now, watch his rallies, listen to his words,\" she added.\nHarris first invited Americans to watch Trump's rallies during the presidential debate hosted by ABC News debate last month.\n\"He tells us who he is, and he tells us what he would do if he is elected president. So here tonight, I will show you one example of Donald Trump's worldview and intentions,\" Harris said, teeing up the video that played on large monitors at the Erie Insurance Arena.\n\"The worst people are the enemies from within,\" Trump is seen saying in one clip.\n\"Now if you had one really violent day, one rough hour, and I mean real rough,\" he says in another.\nThe presentation marks the introduction of a new element to a Harris rally.\nThe vice president has quoted Trump's comments before -- as she also did again throughout her speech Monday night -- and has repeatedly asked supporters to watch his events, but she has yet to play a video of them.\n\"So, you heard his words. You heard his words coming from him. He's talking about the enemy within Pennsylvania. He's talking about the enemy within our country, Pennsylvania,\" Harris said after the clip played.\n\"He considers anyone who doesn't support him or who will not bend to his will, an enemy of our country,\" Harris warned.\nHarris went on to say another Trump term would be \"a huge risk for America and dangerous,\" calling out his positions on reproductive freedoms, climate and LGBTQ+ rights.\nThe vice president concluded her speech in Pennsylvania with a rallying cry to voters. \"We are all here together because we know what's at stake. And we are here together because we love our country,\" she said.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Walz to campaign with Presidents Obama, Clinton in early-vote push: Sources", "link": "https://abcnews.go.com/Politics/walz-campaign-presidents-obama-clinton-early-vote-push/story?id=114814686", "content": "Walz will be in North Carolina with Clinton and in Wisconsin with Obama.\nMinnesota Gov. Tim Walz, for the first time this cycle, will soon hit the campaign trail with former President Barack Obama and former President Bill Clinton, according to a senior campaign official.\nThe vice presidential nominee will be out with his party's former standard bearers this week and next week in an effort to push for early voting in battleground states, ABC News has exclusively learned.\nThe governor will first rally with Clinton in Durham, North Carolina, on Thursday -- the first day of early voting in the critical battleground state. Next Tuesday, Walz will travel to Wisconsin, another battleground, with Obama for the start of early voting in that state.\nThe joint campaign blitzes come as the Harris-Walz ticket has deployed both former presidents -- some of its strongest political assets -- headed into the final stretch of the election cycle.\nObama hit the trail for the ticket starting on Oct. 10 and has additional stops planned in the run-up toElectionDay, according to the campaign.\nHis first stop was in battleground Pennsylvania in the Pittsburgh area -- a visit wherehe sternly chided Black menover \"excuses\" to not vote for Harris, saying he finds them sitting out or voting for former President Donald Trump \"not acceptable.\"\nObama will also independently hit the campaign trail in the Sun Belt this week, with stops on Friday in Arizona and on Saturday in Nevada -- the first days of early voting in the state.\nOn Sunday and Monday, Clinton made his trail debut with travel across rural communities in Eastern and South Georgia to encourage Georgians to vote early.\nLast night, on the eve ofearly in-person voting in the state, Clinton stumped for the Harris-Walz ticket in battleground Georgia, mounting the stakes of the election and the importance of voting.\n\"I want you to be happy, and I want you to know that I am here because I believe. I believe, based on my personal knowledge of the job and the candidates, that Kamala Harris will be a fine president,\" he said.\n\"All we gotta do is show up. If we show up, we'll win,\" Clinton added.\nThe joint principal campaign events also come as Walz himself has made campaign stops related to early voting. The governor campaigned last week in Phoenix and Tucson on the first day of early voting in Arizona.\n\"I know you've started voting here in Arizona. It's happening across the country. We can make a difference. And I think just the idea of having an administration building on these strong relationships, this is our opportunity to take this to the next level that we need to do,\" Walz said at event with tribal leaders in Chandler, Arizona last Wednesday.\nABC News' Selina Wang, Fritz Farrow, Gabriella Abdul-Hakim and Lalee Ibssa contributed to this report.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Arizona counties don't have to do citizenship checks before election, judge rules", "link": "https://abcnews.go.com/Politics/wireStory/arizona-counties-wont-forced-citizenship-checks-election-judge-114831464", "content": "Those who sought the checks made their request too close to the election.\nPHOENIX --A judge has rejected a request to require Arizona's 15 counties to verify the citizenship of some 42,000 voters registered only to vote in federal elections in the presidential battleground state, concluding those who sought the checks made their request too close to the Nov. 5 election and didn’t have legal standing.\nA lawsuit filed on behalf of an Arizona voter and the conservative advocacy group Strong Communities Foundation of Arizona sought a court order requiring county recorders to ask federal authorities to verify the citizenship of those voters.\nArizona requires voters to prove their citizenship to participate in local and state races. Voters who don’t provide proof of citizenship yet still swear they are U.S. citizens are allowed to vote only for president, the U.S. House or Senate.\nThe lawsuit alleged officials weren’t complying with a 2022 law requiring the cross-checking of registration information with various government databases.\n“They (the plaintiffs) have not made a clearcut showing of harm, nor that the action they request is feasible in the midst of a general election,” U.S. District Judge Krissa Lanham wrote in an order issued Friday.\nLanham, a nominee of President Joe Biden, said she was declining to force county recorders to divert resources away from preparing for the election and toward citizenship checks just weeks before Election Day.\nThe plaintiffs told the court that they intend to appeal the ruling.\nAmerica First Legal, which is run by former Donald Trump adviser Stephen Miller and represents the plaintiffs, said in a statement Tuesday that the appeal effort was made “to demand potential illegal aliens and noncitizens are lawfully removed from the Arizona voter rolls.”\nTaylor Kinnerup, a spokeswoman for Maricopa County Recorder Stephen Richer, declined to comment on the judge’s order.\nThe lawsuit alleged it wasn’t enough for county officials to consult the databases and said officials should ask federal authorities to verify the voters’ citizenship status.\nAfter it was pointed out that federal law bars systematic voter-list purges within 90 days of an election, the plaintiffs clarified that they were merely asking that a letter be sent to federal officials inquiring about the citizenship of federal-only voters, according to Lanham. The plaintiffs noted they weren’t seeking the removal of people from voter rolls.\nThe 42,000 voters at issue in the lawsuit are separate from a much larger group of voters whose citizenship hasn’t been confirmed yet will still be allowed to vote in local, state and federal elections in November, according to the office of Secretary of State Adrian Fontes.\nAbout a month ago, officials uncovered a database error that hadmistakenly designated nearly 98,000 votersas having access to the full ballot, even though their citizenship status hadn’t been confirmed.\nDriver licenses issued after 1996 are considered valid documented proof of citizenship, but the system error marked the original batch of voters who had pre-1996 licenses as eligible to vote in state and local elections.\nThe state Supreme Court concluded those voters, who were already able to vote in the federal races,could vote in state and local racesfor the 2024 general election.\nA little more than a week later, the number of misclassified votersjumped from almost 98,000 to around 218,000. Fontes' office has said all people included in the database error remain eligible to vote a full ballot.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Casey, McCormick debating again after combative first meeting in battleground Senate race", "link": "https://abcnews.go.com/Politics/wireStory/casey-mccormick-debating-after-combative-meeting-battleground-senate-114810991", "content": "Democratic U.S. Sen. Bob Casey of Pennsylvania and Republican challenger David McCormick are meeting for their second debate\nHARRISBURG, Pa. --Democratic U.S. Sen.Bob Caseyof Pennsylvania and Republican challengerDavid McCormickmeet for their second debate Tuesday evening, with control of the Senate on the line and tens of millions of dollars pouring into the race every week.\nDuring theirfirst debatetwo weeks ago, Casey tried to drive home the message that McCormick is a wealthy,carpetbaggingex-hedge fund CEO whogot richat the expense of Americans and will serve the interests of billionaires.\nMcCormick painted Casey as a weak, do-nothing out-of-touch career politician who will vote almost 100% of the time with PresidentJoe Bidenand Vice PresidentKamala Harris.\nMail-in voting has already begun in the pivotal swing-state seat, and the outcome of this race, one of the nation’s most expensive, could help determine which party controls the narrowly divided Senate.\nCasey, perhaps Pennsylvania’s best-known politician, is seeking a fourth term in what he calls his toughest reelection challenge yet.\nCasey, 64, supported Biden's major initiatives, including his$1.9 trillion pandemic relief package, and is a staunch ally of labor unions. The former state auditor general and treasurer has won six statewide elections and is Pennsylvania’s longest-serving Democrat in the Senate. He has campaigned on preserving the middle class,abortion rights, labor rights and voting rights — and calls McCormick and former PresidentDonald Trumpa threat to all those.\nMcCormick, 59, is making his second run for the Senate afterlosing narrowlyto Dr. Mehmet Oz in 2022’s Republican primary. He was CEO of Bridgewater Associates, the world's largest hedge fund, sat on Trump’s Defense Advisory Board and served in top positions under President George W. Bush. Those included posts as a Commerce undersecretary tasked with policy over controlling exports of sensitive technologies and a Treasury undersecretary as the administration tried to prevent bank failures during the recession.\nMcCormick backs Trump's pledge to extend the tax cuts he signed into law in 2017 and to carry out a mass deportation of immigrants who are in the country without permission — prioritizing people with criminal records. McCormick also opposes abortion rights, but said he wouldn't vote for a national ban on abortion.\nIssues aroundborder policyand theIsrael-Hamas warare prominent in the race.\nDemocrats currently hold a Senate majority by the narrowest of margins, but facea difficult 2024 Senate map.\nMore than $190 million has been spent on this single race so far, according disclosures to the Federal Election Commission. The total is on track to exceed $320 million, based on campaign ad tracking by AdImpact, which includes spots reserved between now and Election Day.\nThe 60-minute debate will air starting at 7 p.m., hosted byWPVI-TV in Philadelphia, which will broadcast it live.Univision 65in Philadelphia will simulcast it with Spanish language translation. Both stations will stream it live online, as willABC News Liveand Univision'sVIX.\nBoth Casey and McCormickwere uncontestedfor their party’s nominations. Also on the ballot in this race are John Thomas of the Libertarian Party, Leila Hazou of the Green Party and Marty Selker of the Constitution Party. They were not invited to the debate.\n___\nFollow Marc Levy attwitter.com/timelywriter.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Economic discontent, issue divisions add up to tight presidential contest: POLL", "link": "https://abcnews.go.com/Politics/economic-discontent-issue-divisions-add-tight-presidential-contest/story?id=114723390", "content": "Harris has 50% support to Trump’s 48% among likely voters, the poll finds.\nDreary economic attitudes and sharply divergent views on social policies mark the 2024 presidential election, contributing to a tighter contest between Vice President Kamala Harris and former President Donald Trump: Just 2 percentage points now divide them in a new ABC News/Ipsos poll.\nHarris has 50% support to Trump's 48% among likely voters in the national survey, with a similar 49-47% result among all registered voters. (Among all adults, regardless of registration status, it's a single-point race, 49-48%, excluding those who wouldn't vote.)\nThe results are slightly closer than Harris' +5 points among likely voters and the general public, and +4 among registered voters, in the last ABC/Ipsos poll in mid-September. A gain for Trump among men -- he's now +8 points among those registered to vote -- is a factor, as is a slip for Harris among independents, often swing voters.\nSee PDF for full results.\nBeneath the horse race, issues pull in opposite directions. The poll, produced for ABC News byLanger Research Associates, with fieldwork by Ipsos, finds that 56% of Americans now favor deporting all undocumented immigrants, up 20 points from eight years ago. That reinforces one of Trump's strongest issues, with a 10-point Trump lead in trust to handle immigration at the southern border.\nYet the same share, 56%, side with Harris on abortion, saying the federal government should restore access to what it was before the Supreme Court eliminated the constitutional right to abortion in 2022. Many fewer, 41%, favor Trump's view that each state should decide. It follows that abortion is Harris' best issue in this poll, with a 15-point lead over Trump in trust on it.\nThen there's the economy, and related to it, a sharp division on the nation's future. As reportedFriday, 44% of Americans say they're not as well off now as they were when Biden took office, tying the most negative number on this question in data since 1986.\nFurther, while inflation has eased and employment is strong, those gains haven't hit home for most people: 59% say the economy is getting worse, more than twice as many as say it's getting better, 23%. And among registered voters who say the economy's worsening, Trump leads Harris by a sweeping 53 points, 74-21%.\nLargely informed by economic attitudes, registered voters divide, 51-47%, on whether America's best days are still ahead, or behind it. This in turn relates to candidate choice: Trump, with his message of national decay, leads Harris by 27 points, 61-34%, among those who say the country's best days are behind it. Harris, with her more optimistic messaging, leads Trump by 28 points, 63-35%, among those who think America's best days are ahead.\nTaken another way, 59% of Trump's supporters say the country's best days are behind it. Among Harris supporters, 67% say the country's best days are still to come.\nTrump leads Harris by 8 points overall in trust to handle the economy and 7 points on inflation, consistent results since August that are central to his competitiveness and reflect Harris' challenges breaking free from dissatisfaction with Biden's economic stewardship. (See more on this inFriday's reporton Harris' headwinds as an agent of change.)\nThat said, Harris pushes back on another economic benchmark, \"looking out for the middle class.\" A new item in this poll, she leads Trump on it by 5 points, 42-37%. (The rest don't trust either of them to handle it.)\nA test of three economic proposals from each candidate fills out the story: Trump has both the most popular and the least popular proposals, with Harris winning the second, third and fourth slots of the six.\nSpecifically, Trump's suggestion to end income taxes on Social Security benefits leads in popularity, followed by three from Harris -- a tax credit for middle- and lower-income families with newborns, a limit on the profits food companies can make on groceries and grants to first-time home buyers. Two more Trump proposals come next -- raising tariffs on foreign imports, and the one that is unpopular among most people, cutting corporate income taxes.\nOne of these -- the idea to end taxes on Social Security benefits -- rises to the level of majority \"strong\" support, 55%. Harris' three proposals also get more strong support than strong opposition, by 10 to 23 points. Trump's remaining items, by contrast, get much less strong support -- and cutting corporate income taxes is more apt to be strongly opposed.\nIn trust on other issues, Trump holds single-digit leads on handling crime and safety, national security and the conflict in the Middle East; Harris has a single-digit lead on \"protecting American democracy.\" Results for items repeated from past polls are virtually unchanged.\nWhile potential voters are closely divided on many points, enthusiasm and personal favorability are two areas in which Harris has clear advantages. Among registered voters who support her, 84% say they're enthusiastic about it; among Trump supporters, enthusiasm drops by 6 points, to 78%. That's markedly lower than enthusiasm for Trump -- 93% -- at this point in 2020.\nEnthusiasm is related to personal favorability, and 44% of Americans see Harris favorably, vs. 35% for Trump. Harris' favorability rating lost 3 points in this poll, and 47% now see her unfavorably. That said, many more, 58%, have an unfavorable opinion of Trump.\nFavorability isn't determinative. Trump has been underwater in favorability consistently since 2015 -- but won the Electoral College eight years ago regardless.\nOne important boost to Trump is that, among the 15% of registered voters who see both candidates unfavorably, he leads by a wide margin, 62-24%. Looking at it another way, 21% of Trump's supporters see him unfavorably, but support him anyway. The corresponding figure for Harris is just 7%.\nTrump also continues to score a few points by portraying Harris as too liberal. Forty-eight percent of Americans see her this way, vs. 43% who call Trump too conservative. That said, 7% call Harris too conservative and 9% call Trump too liberal; at the end of the day, very similar numbers call them \"about right\" ideologically, 43% for Trump, 41% for Harris.\nHowever much they're liked or disliked, another result shows that most people are ready to hear more from the candidates: 57% say Harris and Trump should agree to an additional televised debate, while 41% say not.\nTrump reiterated last week that another debate is not in the cards. And there's a difference on the question between their supporters. Among registered voters who prefer Harris, 71% are looking for another debate, while among those who prefer Trump, this drops sharply, to 45%. (After their sole debate last month, 58% overall thought Harris had won it.)\nWith the election close to three weeks away, partisanship infuses survey results. Eighty-five percent of Republicans and Republican-leaning independents say the economy is getting worse, for instance, while just 32% of Democrats and Democratic leaners agree. In another example, Republicans and GOP leaners are far more apt than their Democratic counterparts to say the country's best days have passed, 60% vs. 36%.\nPolicy preferences show similar patterns. Eighty-eight percent of Republicans support mass deportation, as do 58% of independents, compared with 26% of Democrats. (That said, support for deportations has increased broadly compared with a 2016 survey, with the exception of views among Democrats and liberals.)\nOn abortion, partisan divisions results are reversed: Eighty-seven percent of Democrats say the federal government should restore abortion access, as do 57% of independents, dropping to 27% of Republicans.\nPolls are best used not to recite who's ahead, but to assess how and why the country is coming to its decision. It's also important to keep in mind that the ultimate winner of the popular vote may differ from the winner of the presidency, as demonstrated in 2016 and 2000 (and likewise, for history buffs, in 1888, 1876 and 1824).\nWith Election Day drawing close and early voting underway, this poll includes slight departures from previous ABC/Ipsos polls this cycle in measuring vote preferences. Survey respondents are offered up to five candidates -- Harris, Trump, Jill Stein, Chase Oliver and Cornel West, and their running mates -- based on which of those candidates are on the ballot in the state where the respondent lives. (Robert F. Kennedy Jr., while on the ballot in 30 states and the District of Columbia, is not listed, since he's not actively running. Respondents can volunteer their support for Kennedy or anyone else.)\nIn addition to being asked whom they'd support, respondents are given the option of saying they already voted. In this survey 1% had done so, a number likely to ramp up quickly.\nAs mentioned, one shift in this poll is the result among men who are registered to vote -- 52-44% in Trump's favor, compared with a dead heat, 48-48%, in mid-September. That includes a 19-point Trump lead among white men and a close contest among Hispanic men and younger men (age 18-39) alike.\nA slight change is among independents, who, per exit polls, have voted for the winner in nine out of the last 12 presidential elections. Harris led among independents by 10 points, 51-41%, in mid-September, compared with a non-significant 5 points now, 49-44%.\nHarris, for her part, continues to lead among women by 9 points, 53-44%, aided by her showing among under-40, Black and Hispanic women. And she leads by 14 points among college graduates, 56-42%, among the more reliable groups for turnout.\nThe 17-point gender gap between the candidates (Trump +8 among men, Harris +9 among women) is back to its typical level; it has averaged 19 points in exit polls since 1996. This reflects the fact that women are 8 points more apt than men to identify as Democrats.\nThe contest stands at 82-13%, Harris-Trump, among Black people who are registered to vote; that compares with 87-12% in the 2020 exit poll (a slight 5 points lower for Harris; no better for Trump). Black women are at 87-10% now (compared with 90-9% in 2020); Black men are at 76-18% (compared with 79-19% four years ago). These differences from 2020 aren't statistically significant.\nThen there's the division of votes by state groupings. In what are thought to be safely and likely red states, Trump is comfortably ahead, 55-42%. In expected blue states, Harris is well ahead, 56-39%. And in the seven battleground states where the contest is expected to be close -- Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin -- it couldn't be closer: 49% for Harris, 49% for Trump.\nMETHODOLOGY – This ABC News/Ipsos poll was conducted online via the probability-based Ipsos KnowledgePanel® Oct. 4-8, 2024, in English and Spanish, among a random national sample of 2,631 adults. Partisan divisions are 29-29-30%, Democrats-Republicans-independents. Results have a margin ofsampling errorof plus or minus 2 percentage points, including the design effect, for the full sample. Error margins are larger for subgroups. For registered voters, the sample size is 2,226 and the error margin is 2 points. For likely voters, the sample size is 1,714 and the error margin is 2.5 points. Sampling error is not the only cause of differences in polls.\nThe survey was produced for ABC News byLanger Research Associates, with sampling and data collection by Ipsos. See details on ABC News survey methodologyhere.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Vance stands by Trump's false claims Venezuelan gangs have invaded Colorado", "link": "https://abcnews.go.com/Politics/vance-stands-trumps-false-claims-venezuelan-gangs-aurora/story?id=114751512", "content": "The Republican mayor of the city has said the claims are grossly exaggerated.\nGOP vice presidential nominee Sen. JD Vance is standing by former PresidentDonald Trump'sfalse claims that Venezuelan gangs have invaded and conquered Aurora, Colorado.\nTrump has repeatedly claimed that members of the Venezuelan Tren de Aragua gang have \"taken over\" apartment complexes and \"overrun\" the city, as he did in arally in the cityon Friday.\nMike Coffman, the Republican mayor of Aurora, said Trump's claims are \"grossly exaggerated\" and \"have unfairly hurt the city's identity and sense of safety.\"\nAsked by \"This Week\" co-anchor Martha Raddatz on Sunday if he supports Trump making those claims, Vance did not back down.\n\"Well, Martha, you just said the mayor said they were exaggerated. That means there's got to be some element of truth here,\" Vance said.\"\nRaddatz followed up with Vance, saying the issues in Aurora were limited to a handful of apartment complexes and that the mayor released a statement saying the city's \"dedicated police officers have acted on those concerns and will continue to do so.\"\nVance responded, saying Democratic nominee Vice President Kamala Harris caused the issues in Aurora.\n\"Unfortunately, when you let people in by the millions, most of whom are unvetted, most of whom you don't know who they really are, you're going to have problems like this.\"\n\"Kamala Harris, 94 executive orders that undid Donald Trump's successful border policies. We knew this stuff would happen. Bragged about opening the border, and now we have the consequences, and we're living with it. We can do so much better, but frankly, we're not going to do better, Martha, unless Donald Trump calls this stuff out. I'm glad that he did.\"\nIn the aftermath of Hurricane Helene, which devastated parts of states in the southeastern U.S., including Florida, North Carolina, and Georgia,Trump has falsely suggestedthat aid from FEMA meant for the hurricane was going to migrants and that the federal government is going out of their way to not help people in Republican areas.\nAsked if he believed that true, Vance defended the president.\n\"What the President said is that fundamentally, FEMA aid is distracted by going to illegal migrants,\" Vance responded. \"We've got Republican congressmen who are on the ground who represent that area saying that they have to call the White House to get food and water to FEMA? I don't, frankly, think there's anything malicious going on here, Martha, but I do think that we've had an incompetent response to this particular crisis, particularly in Western North Carolina, which, to be fair, was hit harder than a lot of us expected it.\"\nVance called the federal government's response to the crisis incompetent, saying members of the military are still \"trickling\" into western North Carolina.\nRaddatz pushed back against the false claims that the government is not assisting people in Republican areas and citing Pentagon officials who said that active duty troops were staged and ready to go before being called upon and were instantly out the door.\nOn Friday in Georgia, Vance said that the attorney general is the second-most important government role after the president.\nRaddatz pressed Vance if Trump would go after his political opponents if he won another term.\n\"No, he was president for four years, and he didn't go after his political opponents. You know, who did go after her political opponents? Kamala Harris, who has tried to arrest everything from pro-life activists to her political opponents,\" Vance said.\nTo follow up, Raddatz told Vance that Trump has said in the past that those who have cheated will be prosecuted.\n\"Well, he said that people who violated our election laws will be prosecuted. I think that's the administration of law,\" Vance said. \"He didn't say people are going to go to jail because they disagree with me.\"\nVance continues to refuse to acknowledge that Trump lost the 2020 election. In an interview with \"This Week\" earlier this year, Vance said he wouldn't have certified the results of the 2020 race until states submitted pro-Trump electors.\nRaddatz pressed Vance again on the 2020 election.\n\"In interview after interview, question after question, and in the debate, you refuse to say that Donald Trump lost the 2020 election,\" Raddatz said. \"So I'm just going to assume that if I ask you 50 times whether he lost the election, you would not acknowledge that he did. Is that correct?\"\n\"Martha, you've you asked this question. I've been asked this question 10 times in the past couple of weeks. Of course, Donald Trump and I believe there were problems in 2020,\" Vance said.\nPressed again by Raddatz, Vance replied, \"I've said repeatedly I think the 2020 election had problems. You want to say rigged? You want to say he won? Use whatever vocabulary term you want.\"\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Harris was asked to name a few of Trump's virtues. Here's her response", "link": "https://abcnews.go.com/Politics/wireStory/harris-asked-3-virtues-trump-114704743", "content": "Vice President Kamala Harris was asked to name three virtues that her opponent in next month's election, Donald Trump, possesses — but was unable to come up with even one\nLAS VEGAS --Vice PresidentKamala Harriswas asked to name three virtues that her opponent in next month's election,Donald Trump, possesses — but was unable to come up with even one.\nAt the end of hertown hall for Spanish-language network Univisionin Las Vegas on Thursday, audience member Teresa Djedjro, 48 and originally born in Mexico, asked Harris to, \"Please give me three virtues that Trump has.”\nHarris laughed and thanked her for the question before saying, “I know that the vast majority of us has so much more in common than what separates us.” Then she made clear that is not the case for herself and the former president, saying Trump's approach to politics, “pains me” while singling out his ”us versus them” approach.\n“I don’t think that's healthy for our nation, and I don’t admire that,\" Harris said. \"And I’m quite critical of it, coming from someone who wants to be president of the United States.”\nTaking another stab at a compliment, she offered, “I think Donald Trump loves his family and I think that’s very important,\" only to continue, \"But I don’t really know him. I only met him one time ... so I don’t really have much more to offer you.”\nTrump is holding his own Univision town hall next week, after the original gathering in Miami was postponed due to Hurricane Milton. Still, he too has had little nice to say about Harris during the campaign, calling her “mentally impaired.”\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Trump outpaces Harris and Walz in campaign events as Election Day approaches", "link": "https://abcnews.go.com/Politics/trump-outpaces-harris-walz-campaign-events-run-final/story?id=113932634", "content": "In September, Trump held 21 public events compared to Harris' 13.\nAs former President Donald Trump and Vice President Kamala Harris spend the run-up to the last stretch of the 2024 election barnstorming through battleground states, a contrast has emerged: Trump has single-handedly outpaced both Harris and her running mate, Minnesota Gov. Tim Walz, in campaign events for the month of September as he shows no signs of slowing down -- a strategy his campaign is employing to focus on counties vulnerable to flipping.\nIn September, Trump held 21 public campaign events including remarks, rallies, press conferences and town halls. That's compared to Harris' 13 campaign events; Walz had seven campaign events, according to campaign schedules ABC News has reviewed. On top of Trump's jam-packed campaign schedule, his running mate, Sen. JD Vance, alone held 14 events in the month of September.\nThese tallies do not include brief campaign retail stops and appearances without remarks.\nThe intensity in Trump's campaign schedule has continued into the first week of October. From Oct. 1 through Oct. 6, Trump has already held eight campaign events compared to Harris, who has held two, according to an ABC News review of their schedules.\nRecently Harris has spent her days focused on her official duties as vice president receiving Federal Emergency Management Agency briefings and surveying Hurricane Helene's damage in Georgia and North Carolina. Trump similarly visited Georgia to survey the storm damage and received his own briefings from local officials.\nHarris campaign advisers have dismissed arguments that Harris isn't campaigning hard enough, pointing to the eight events she had done throughout the month in her official capacity as vice president including a trip down to the southern border along with dealing with the devastation from Hurricane Helene.\nHarris campaign spokesperson Sarafina Chitika said in a statement that Trump is \"cocooned in a conservative media bubble\" and \"limiting his time in battleground states,\" while Harris and Walz are \"taking tough questions and meeting voters where they are.\"\n\"In the home stretch, Donald Trump is campaigning in California, Chicago, and New York City, after camping out at Mar-A-Lago avoiding voters,\" Chitika wrote in the statement.\nHowever, in recent weeks, Trump has been campaigning across multiple battleground states, which have included multiple appearances in Wisconsin, Pennsylvania, Michigan and North Carolina, as he enters a crucial phase of his campaign and vies to make a final pitch to voters ahead of Election Day.\n\"I go to a lot of places, we're definitely outworking the opposition. She'll go to one place in three days. I say, 'Why can't I do that?'\" Trump quipped at a campaign stop in Savannah, Georgia, late last month.\nEarlier this election cycle, Trump was falling behind in the number of campaign events compared to his nonstop rallying during the 2016 election. Trump, who had early victories in primary races, had fewer events amid his legal battles, which kept him confined in a courtroom most days of the week.\nBut he has picked up the pace in the final months ahead of the election.\nThe former president has spent most of his time in the past month in the commonwealth of Pennsylvania, holding four events in September there as polling shows it's the closest state on the map between the two candidates. Harris only has a 0.4% lead over Trump in Pennsylvania, according to538's polling average.\nTrump's events have been concentrated in urban-suburban areas in battleground states that flipped between his two presidential runs as his campaign hopes to eat away at Democratic margins.\nFor example, last month, Trump gave remarks at a manufacturing plant in Walker, Michigan, in Kent County -- a county that President Joe Biden flipped from Trump in 2020. Later in the day, Trump hosted a town hall in Warren, Michigan, which sits just outside of Detroit and was the only county in 2020 in the tri-county region that flipped to Trump in the past two cycles after former President Barack Obama won the county in 2008 and 2012.\nTwo weeks ago, Trump visited Prairie Du Chien in Crawford County, Wisconsin -- a southwest county in the state that is among several in the region that flipped from Obama to Trump. Now, Trump is trying to win back voters in these pivotal counties after he narrowly lost the state to Biden by 21,000 votes in 2020.\nLast week, Trump marked his fourth visit to Wisconsin in eight days with events in Milwaukee and Dane counties -- two Democratic strongholds. He went on to campaign on Sunday in Juneau, Wisconsin, in Dodge County -- a county that has increasingly been turning into a Republican stronghold over the last few presidential elections.\nHarris has similarly focused on Pennsylvania, holding five events in the commonwealth. She has spent much of her time in Western and central Pennsylvania, drawing crowds from both the Democratic-leaning Pittsburgh area as well as rural counties that have been wavering between strong and slight Republican leanings.\nThe schedule contrast comes as the Harris campaign, and previously Biden's, have been critical of Trump's slow pace on the road earlier in the cycle, arguing he was campaigning from \"his country club basement.\"\nIn the early weeks of August, on the heels of Biden's withdrawal from the 2024 election, Trump only had a smattering of events in Republican-safe states, spending most of his time at private fundraisers and participating in online interviews including with tech entrepreneur Elon Musk and streamer Adin Ross.\nHarris began introducing herself to the nation by holding multiple events in the beginning weeks of her campaign and drawing big crowds from that momentum -- especially in the second week of August when the Harris-Walz ticket held five joint rallies across the country -- but has since failed to keep up with that pace. At times, Harris has focused on her official duties as vice president instead or simply had no public campaign or vice presidential schedules announced.\nAdditionally, Harris and Walz have both received public scrutiny for their careful campaigning methods, both largely avoiding media availability on the road and sit-down interviews, something the Trump and his running mate, Sen. JD Vance both routinely do.\nRecently, however, the Harris-Walz campaign has announced a series of media interviews including appearances on the \"Call Her Daddy\" podcast, ABC's \"The View,\" CBS News' \"60 Minutes,\" and the \"Howard Stern Show\" for Harris. Walz is set to do interviews on the \"Smartless\" podcast and \"Jimmy Kimmel Live\" this week.\nThelatest polling average from 538shows Harris is gaining momentum nationally, leading Trump by 2.6%, but a recentNew York Times/Siena College pollshows a tighter race with the two candidates neck-and-neck among registered voters in Michigan and Wisconsin. AnotherNew York Times/Siena College polla week prior showed Trump leading in the battleground states of Arizona and North Carolina.\nAs he enters the final stages of the campaign, Trump has publicly acknowledged the importance of the last weeks of his campaign, often telling his supporters that he isn't taking anything for granted. Trump's campaign has said the former president is aware of the stakes of the election as he enters the final stages and hopes his message on immigration and economy -- two key issues for voters this election -- resonate.\nTrump has said he plans to leave everything on the field as Election Day draws near.\n\"We're going to leave nothing to chance and everything on the field … and we're going to defeat Kamala Harris, and we're going to make America great again,\" Trump said at a campaign stop in Waunakee, Wisconsin, last week.\nHarris, going into the final stretch of the election, has stressed that she's running as an \"underdog\" in what's shaping up to be a close race.\n\"This is a margin-of-error race. We are the underdog. And I am running like the underdog because I am the underdog in this race. The baton is now in our hands,\" Harris said at a fundraiser in San Francisco in late September.\nWhile falling behind Trump in formal campaign remarks, the Harris campaign has filled their schedule for both candidates with retail campaign stops, seeing value in fostering environments where their candidates can have more face time with voters, as well as fundraisers that has allowed them to wipe out Trump's campaign money edge from earlier this year.\n24/7 coverage of breaking news and live events"}]