[{"source": "abcnews", "title": "Process to replace Matt Gaetz could cut into House GOP's narrow majority", "link": "https://abcnews.go.com/Politics/process-replace-matt-gaetz-cut-house-gops-narrow/story?id=116147431", "content": "In bad news for House Republicans, his seat will be left vacant for months.\nFollowing news Friday that formerFlorida Rep. Matt Gaetz does not intend to return to Congressafter he withdrew from consideration to be President-elect Donald Trump's attorney general, it appears his seat will be vacant for months -- presenting a challenge for House Republicans who already maintain a slim majority in the incoming Congress.\nOn Friday, Florida Gov. Ron DeSantis set the FL-01 special election primary for Jan. 28 and the general election for April 1. That means Gaetz's seat will be unfilled for at least 12 weeks in the 119th Congress.\n\"At Gov. Ron DeSantis' direction, this special election is being conducted as quickly as statutorily possible,\" said Florida Secretary of State Cord Byrd on Friday. \"We are committed to ensuring this election is held as soon as we are allowed to hold it by state law.\"\nSuch a vacancy would cut into the narrow majority House Republicans are projected to have in the next Congress, which will only continue to shrink if GOP Reps. Elise Stefanik and Michael Waltz are confirmed to be in Trump's Cabinet.\nABC News projects that Republicans have won 219 seats and Democrats 213 in the House. The numbers do not take into account any departures for jobs in the Trump administration or Gaetz's resignation. There are also three outstanding House races that still haven't been called, which will determine the ultimate size of the GOP's majority.\nThe special election schedule is at the Florida governor's discretion. For instance, the dates set by DeSantis in 2022 to fill the vacancy of the late Democratic Rep. Alcee Hastings left the seat open for nine months, despite Democrats' pushing for a speedier process.\nAt least half a dozen Florida Republicans have already expressed willingness to run for Gaetz's seat. 538 rates Florida's 1st Congressional District, which Gaetz represented for eight years, as \"solid Republican.\"\nGaetz on Friday sat for his first interview with conservative commentator Charlie Kirk since withdrawing as Trump's attorney general pick. During the interview, the conservative firebrand announced then that he would not return to Congress, despite having won reelection in November by 32 points.\n\"I'm going to be fighting for President Trump. I'm going to be doing whatever he asks of me, as I always have,\" Gaetz said. \"But I think that eight years is probably enough time in the United States Congress.\"\nABC News' Jay O'Brien contributed to this report.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Sens. Bill Hagerty and Amy Klobuchar Sunday on ‘This Week’", "link": "https://abcnews.go.com/Politics/sens-bill-hagerty-amy-klobuchar-sunday-week-anchor/story?id=116147915", "content": "This is a listing for 'This Week' airing Sunday, November 24, 2024.\n\nSENATORS BILL HAGERTY AND AMY KLOBUCHAR SUNDAY ON “THIS WEEK” WITH CO-ANCHOR JONATHAN KARL\nSen. Bill Hagerty\n(R) Tennessee\nBanking, Housing,& Urban Affairs Committee\nExclusive\nSen. Amy Klobuchar\n(D) Minnesota\nJudiciary Committee\nExclusive\n. . . . . . . . . . . . . . . . .\nPOWERHOUSE ROUNDTABLE\nDonna Brazile\nFormer DNC Chair\nABC News Contributor\nChris Christie\n(R) Former Presidential Candidate\n(R) Former New Jersey Governor\nABC News Contributor\nReince Priebus\nFormer RNC Chair\nFormer Trump White House Chief of Staff\nABC News Political Analyst\nRep. Jasmine Crockett\n(D) Texas\n. . . . . . . . . . . . . . . . .\nLike “This Week” on Facebookhere. You can also follow the show on Twitterhere.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "What Pam Bondi, Trump's new AG pick, has said about investigating DOJ prosecutors", "link": "https://abcnews.go.com/Politics/pam-bondi-trumps-new-ag-pick-investigating-doj/story?id=116136850", "content": "\"We can clean house next term and that's what has to happen,\" she said in 2023.\nPresident-electDonald Trumpwasted little time selecting another candidate for attorney general after Matt Gaetz dropped his bid amid sexual misconduct allegations.\nPam Bondi, Florida's attorney general for eight years, was part of Trump's defense team during his first impeachment trial and supported his false claims of fraud following the 2020 election. She's remained in Trump's orbit since then, continuing to advise him on legal matters.\nDespite the shake-up, Bondi seems easily positioned to pick up the mantle on Trump's goal of overhauling the Justice Department and his pledge for retribution against political opponents.\n\"For too long, the partisan Department of Justice has been weaponized against me and other Republicans - Not anymore,\" Trump wrote in his official announcement of Bondi for attorney general. \"Pam will refocus the DOJ to its intended purpose of fighting Crime, and Making America Safe Again.\"\nIn August 2023, during an appearance on Fox News, Bondi railed against the criminal indictments against Trump and what Fox host Sean Hannity described as a \"two-tiered system of justice.\"\n\"When Republicans take back the White House, and we will be back in there in 18 months or less, you know what's going to happen? The Department of Justice, the prosecutors will be prosecuted -- the bad ones -- the investigators will be investigated,\" she said.\n\"Because the deep state last term for President Trump, they were hiding in the shadows,\" Bondi continued. \"But now, they have a spotlight on them and they can all be investigated … We can clean house next term and that's what has to happen.\"\nShe also implied action could be taken against President Joe Biden amidRepublican allegationsthat Biden was personally involved in and benefited from his family's overseas business dealings, which have yet to be supported by direct evidence.\n\"When we have a new administration, absolutely, Sean. It has to,\" Bondi said at the time.\nThe comments echo Trump's ownvows on the campaign trailto go after his perceived political enemies, intelligence officers, prosecutors and more.\nTrump in 2016 led chants of \"lock her up\" against Hillary Clinton, though he never went after her legally once in office. Bondi, at the 2016 convention, when the crowd shouted \"Lock her up,\" responded: \"'Lock her up,' I love that.\"\nBondi was also a supporter of Trump's false claims regarding the 2020 election, helping file several unsuccessful lawsuits alleging voter fraud.\nShe appeared alongsideRudy Giulianiin Philadelphia the day after the 2020 race declaring Trump \"won Pennsylvania\" while votes were still being counted. The state went for President Biden by roughly 80,000 votes.\nCritics say the comments raise questions as to whether she could be trusted to enforce the law.\n\"As AG, would she drop cases against violent insurrectionists? Continue pushing the Big Lie under oath?\" Democratic Rep. Adam Schiff, who next year will join the Senate, wrote on X. \"She will have to answer those questions and a lot more during her confirmation hearings.\"\nABC News' Soorin Kim and Peter Charalambous contributed to this report.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Timeline: Manhattan DA's Stormy Daniels hush money case against Donald Trump", "link": "https://abcnews.go.com/Politics/timeline-manhattan-district-attorney-case-donald-trump/story?id=98389444", "content": "Trump was found guilty on 34 counts of falsifying business records in New York.\nFormer President Donald Trump has beenfound guilty on 34 felony countsof falsifying business records after being indicted last year by a Manhattan grand jury, making him the first former president in American history to be convicted of a crime.\nProsecutors alleged that Trump engaged in a \"scheme\" to boost his chances during the 2016 presidential election througha series of hush money paymentsmade by others and the falsification of New York business records to cover up that alleged criminal conduct.\nHere is a timeline of the case, dating back to Trump's initial declaration as a candidate for president:\nTrump announces he is running for president.\nTrump meets with David Pecker, then-chairman and CEO of American Media Inc. -- which owns the National Enquirer -- at Trump Tower in New York. Pecker agrees to help with Trump's campaign by looking out for negative stories about him to \"catch and kill,\" according to prosecutors' statement of facts. He also agrees to publish negative stories about Trump's competitors in the election, according to the statement of facts filed by the Manhattan DA.\nPecker learns that a former Trump Tower doorman was trying to sell information that Trump allegedly fathered a child out of wedlock, according to the statement of facts. At the CEO's direction, AMI negotiates and signs an agreement to pay the doorman $30,000 in exchange for acquiring exclusive rights to the story. AMI allegedly falsely characterized this payment in its general ledger, according to the statement of facts.\nAMI purchases the story without fully investigating the doorman's claims, at the direction of Pecker, per his alleged arrangement with Trump, according to the statement of facts. AMI later determines the story was not true and wanted to release the doorman from the agreement, but Lawyer A -- a Trump Organization lawyer believed to be Michael Cohen -- allegedly instructs him not to do so until after the presidential election, according to the statement of facts.\nThe National Enquirer's editor-in-chief and chief content officer contacted Cohen (Lawyer A) about a woman -- who is believed to be Playboy model Karen McDougal -- who alleged she had had a sexual relationship with Trump while he was married, according to the statement of facts. Cohen (Lawyer A) is updated by the National Enquirer about this regularly over text and by phone, according to the statement of facts. Trump allegedly did not want this information to become public because he was concerned what impact it may have on his campaign for president, according to the statement of facts.\nAMI ultimately pays the woman $150,000 in exchange for her not speaking out on the alleged sexual relationship. She would also get two magazine cover features and a series of articles published under her byline, according to the statement of facts.\nProsecutors allege that this deal was made based on the understanding that Trump or the Trump Organization would reimburse AMI for the payment, according to the statement of facts.\nTrump has denied having the affair.\nAn audio recording allegedly captures a conversation between Trump and Cohen (Lawyer A) as they discuss how to obtain the rights to the woman's story from AMI and reimburse it for the payment, according to the statement of facts.\nCohen (Lawyer A) allegedly tells Trump he will open a company for the transfer of the woman's account and said he had spoken to Trump Organization Chief Financial Officer Allen Weisselberg about setting it up, according to the statement of facts.\nA shell company -- called Resolution Consultants, LLC -- is allegedly set up on about Sept. 30, 2016. On or about that date, Pecker signs an agreement transferring the rights of the woman's account to the shell company owned by Cohen (Lawyer A) for $125,000, according to court documents. But, before the reimbursement was made, Pecker consulted AMI's general counsel and then told Cohen (Lawyer A) that the deal was off.\nNews breaks that Trump was caught on tape in 2005 telling the host of the entertainment show \"Access Hollywood,\" \"I just start kissing them [women]. It's like a magnet. Just kiss. I don't even wait. And when you're a star, they let you do it. You can do anything. ... Grab 'em by the [genitals]. You can do anything.\"\nAccording to prosecutors, evidence shows that both Trump and his campaign staff were concerned the tape would harm his viability as a candidate and reduce his standing with female voters in particular.\nIn a statement Trump releasedafter the recording was leaked, he apologized and called his remarks \"locker room banter, a private conversation that took place many years ago.\"\nAMI's editor-in-chief contacts Pecker about a second woman -- believed to be adult film actress Stormy Daniels -- who alleged she had a sexual encounter with Trump while he was married, according to the statement of facts. Pecker tells the editor-in-chief to notify Cohen (Lawyer A).\nThe AMI editor-in-chief connects Cohen (Lawyer A) with the woman's lawyer. The two then negotiate a deal to secure the woman's silence. The woman would be paid $130,000 for the rights to her story, according to the statement of facts.\nTrump allegedly tells Cohen (Lawyer A) to delay making a payment to the second woman for as long as possible, according to prosecutors. If he is able to delay making the payment until after the election, they could avoid paying altogether, Trump allegedly says, per prosecutors. Prosectors claim emails and text messages between both lawyers and the AMI editor-in-chief show they attempted to delay making the payment for as long as possible, according to the statement of facts.\nUltimately, Trump agrees to the payoff and directs Cohen (Lawyer A) to proceed, prosecutors allege. Trump allegedly does not want to make the payment himself and asked Cohen (Lawyer A) and Weisselberg to find a way to make the payment, according to the statement of facts. Cohen (Lawyer A) makes the payment after confirming that Trump would pay him back.\nShortly after speaking with Trump over the phone, Cohen (Lawyer A) opens a bank account in Manhattan in the name of a shell company he had created to effectuate the payment, according to the statement of facts.\nCohen (Lawyer A) then transfers $131,000 from his personal home equity line of credit into the account, according to court documents.\nCohen (Lawyer A) transfers $130,000 to a lawyer representing the second woman accusing Trump of having a sexual encounter with her while he was married to suppress her story, according to court documents.\nTrump wins the presidential election.\nAMI then releases the doorman and the first accuser of their nondisclosure agreements, according to court documents.\nProsecutors allege that between Election Day and Inauguration Day, Trump meets privately with Pecker in Trump Tower in Manhattan, thanking him for handling the stories of the doorman and the first woman, according to the statement of facts.\nTrump invites Pecker to the inauguration, according to the statement of facts.\nTrump arranges to reimburse Cohen (Lawyer A) for the payoff he made on his behalf shortly after being elected president, according to the statement of facts.\nCohen (Lawyer A) meets with Weisselberg to discus how he would be reimbursed, with Weisselberg asking Cohen to bring a copy of a bank statement for the shell company account showing the $130,000 payment, according to the statement of facts.\nWeisselberg and Cohen (Lawyer A) agree to a total repayment amount of $420,000. That figure reflected double the $130,000 payment and $50,000 reimbursement for another expense in addition to a $60,000 year-end bonus -- so Cohen (Lawyer A) could characterize the payment as income on his tax returns instead of a reimbursement -- according to the statement of facts.\nTrump, Weisselberg and Cohen (Lawyer A) agree the lawyer would be paid the $420,000 through 12 monthly payments of $35,000 over the course of 2017, according to court documents. Cohen (Lawyer A) was to send an invoice to the Trump Org each month falsely requesting a payment of $35,000 for legal services rendered. Cohen (Lawyer A) does not have a retainer agreement with Trump or the Trump Organization, according to prosecutors.\nCohen (Lawyer A) meets with Trump in the Oval Office to confirm the repayment arrangement in February 2017, according to the statement of facts.\nCohen (Lawyer A) emails the Trump Organization the first monthly invoice requesting two $35,000 payments for January and February, which were allegedly approved by Weisselberg, according to the statement of facts.\nCohen (Lawyer A) submits 10 similar invoices for the remaining months in 2017, but is not on retainer, according to prosecutors. Prosecutors allege the Trump Organization falsely recorded each payment as a \"legal expense,\" according to the statement of facts.\nAccording to prosecutors, the first check was paid from Trump's trust and signed by Weisselberg and Trump's son, as trustees. It was falsely recorded as payments for January and February 2017 legal services, according to the statement of facts.\nA second check, for March 2017, was also paid from the trust and signed by two trustees, according to the statement of facts.\nThe remaining nine checks, for April through December 2017, were paid by Trump personally, according to the statement of facts. Trump allegedly signed each of the checks personally and had them sent to the Trump Organization in New York. They were then scanned and maintained in its data system before being detached and mailed to Cohen (Lawyer A), according to the statement of facts.\nThe last $35,000 payment made was for December 2017, according to the statement of facts.\nTrump invites Pecker to the White House for dinner to thank him for his help during the campaign, according to the statement of facts.\nThe FBIexecutes a search warrant on Cohen's residences and office, according to a statement of facts. Prosecutors allege that in the months that followed, Trump and others engaged in a public and private pressure campaign to try to ensure that Cohen did not cooperate with law enforcement in the federal investigation.\nCohen (Lawyer A) speaks with Trump on the day of the FBI searches, according to prosecutors. Trump allegedly told him to \"stay strong,\" according to the statement of facts.\nTrump publicly encourages Cohen not to \"flip\" in aseries of tweetssaying, \"Most people will flip if the Government lets them out of trouble, even if it means lying or making up stories. Sorry, I don't see Michael doing that.\"\nCohen (Lawyer A) is approached by an attorney -- Lawyer C -- who offers to represent him in the interest of maintaining a \"back channel of communication\" to Trump, according to the statement of facts.\nOn April 21, 2018, Lawyer C allegedly emails Cohen (Lawyer A) stating that he has a close relationship with Trump's personal attorney, named as Lawyer D, according to the statement of facts.\nLawyer C emails Cohen (Lawyer A) a news clip discussing the possibility of him cooperating with law enforcement, encouraging him not to, according to the statement of facts.\n\"The whole objective of this exercise by the [federal prosecutors] is to drain you, emotionally and financially, until you reach a point that you see them as your only means to salvation,\" Lawyer C wrote in the email, according to the statement of facts.\nIn the same email, Lawyer C wrote, \"You are making a very big mistake if you believe the stories these 'journalists' are writing about you. They want you to cave. They want you to fail. They do not want you to persevere and succeed,\" according to the statement of facts.\nInan in-depth interviewthat airs on \"Good Morning America,\" his first since the FBI raided his office and homes in April, Cohen strongly signals his willingness to cooperate with special counsel Robert Mueller and federal prosecutors in the Southern District of New York -- even if that puts Trump in jeopardy.\n\"My wife, my daughter and my son have my first loyalty and always will,\" Cohen tells ABC News' George Stephanopoulos. \"I put family and country first.\"\nCohenpleads guilty in the federal investigationadmitting to his role in AMI's payoff to McDougal (Woman 1) to influence the election, according to the indictment, and saying in his plea that he had done so at Trump's direction.\nCohen also pleads guilty in connection with his payoff of Daniels to secure her silence, claiming it was done at Trump's direction, according to the statement of facts.\nTrump commentson Twittersaying, \"If anyone is looking for a good lawyer, I would strongly suggest that you don't retain the services of Michael Cohen!\"\nCohen and AMI admit guilt in connection with the payoffs made to the two women claiming Trump had extramarital relations with them, according to the statement of facts.\nAMI entered into a non-prosecution agreement with the U.S. Attorney's Office for the Southern District of New York in connection to the payoff made to Woman 1, admitting it did not intend to publish a story at any time during the negotiation or acquisition of her story, the practice known as \"catch and kill,\" according to the statement of facts.\nAfter a bitter campaign for reelection, Trump goes head to head with Joe Biden on Election Day. Four days later,it's clear Trump has lostafter ABC News projects Pennsylvania for Biden.\nManhattan District Attorney Cyrus Vance announceshe will not seek reelectionafter 12 years in office, with the investigation into Trump still ongoing. His office had begun to look into hush money payments made to Stormy Daniels in 2018.\nAlvin Bragg is elected district attorney in Manhattan. Once in office, he picks up theinvestigation into Trump.\nBragg had led the investigation into the Trump Foundation in 2017 under then-Attorney General Eric Schneiderman for \"extensive unlawful political conduct\" with the charity's money and using it for personal matters. Thefoundation was dissolvedand Trump was forced to pay $2 millionas part of a settlement in 2019.\nVanceconvenes a new grand juryfor six months to hear evidence against Trump, paving the way for it to last until after he leaves office in January.\nThe grand jury that was already convened was set to expire. It had voted to bring chargesagainst the Trump Organization and its CFO, Weisselberg, on unrelated matters.\nBragg takes office as Manhattan's new district attorney. Before leaving office, Vance does not bring charges against Trump.\nThe two prosecutors leading the Trump probe -- Assistant District Attorneys Carey Dunne and Mark Pomerantz --resignfrom the district attorney's office.\nPomerantz later revealsthat he disagreed with Bragg's decision to not bring charges against Trump in Bragg's early days as DA. Pomerantz was formerly a special prosecutor with the Southern District of New York.\nThe investigation continues after their resignations but doubt is cast on whether charges will be brought against Trump.\nWeisselbergpleads guilty to tax evasion, admitting he avoided taxes on nearly $2 million in income in a yearslong scheme. He agrees to a plea bargain for five months in prison and to testify against the Trump Organization at the upcoming trial in October. But, the plea agreement does not require him to testify against Trump himself.\nBraggannounces he has hiredMatthew Colangelo as senior counsel. He was a previous Department of Justice official and prior to that worked at the New York Attorney General's Office where he was part of the team that investigated the Trump Foundation.\nA jury finds the Trump Organizationguilty on all countsof tax fraud brought by the Manhattan district attorney's office.\nCharges included scheme to defraud, conspiracy, criminal tax fraud and falsifying business records.\nA grand jury has been hearing testimony about the hush money payment to adult film actress Stormy Daniels, sources tell ABC News, includingtestimony from Pecker, the longtime Trump confidant. The DA's office also has the cooperation of Cohen.\nIn a letter to book publisher Simon& Schuster, Bragg says he is concerned anupcoming book about Trumpwritten by Pomerantz could harm the district attorney's office's investigation. Bragg asks the publisher to delay its release by asking for 60 days to review its manuscript.\nPomerantz's publisher says the book will be published in February as planned.\nPecker becomesone of the first people to testifyin front of the reconvened grand jury as it investigates hush money payments to Daniels.\nSimon& Schuster releases Pomerantz's book, \"People vs. Donald Trump: An Inside Account,\" in which he criticizes Bragg, saying Bragg made a mistake by not bringing a case against Trump at the beginning of his tenure. Pomerantz had been assigned to the case by Vance.\nBraggresponds to the criticism, saying the case against Trump wasn't ready.\nCohen meets with prosecutors investigating Trump in what is his 15th time meeting with the district attorney's office, but his first since the grand jury was convened.\nCohenagain testifies before the grand juryinvestigating the hush money payments.\nBob Costello, an attorney who says he previously advised Cohen,tells reporters his former clienthas a \"lie, cheat, steal\" mindset after Costello testifies for the defense before the Manhattan grand jury investigating Trump's role in the hush payment to Daniels.\nCostello, a longtime Trump ally, appears before the grand jury as an exculpatory witness after Trump's legal team asked the DA to allow him to testify, according to a letter to prosecutors obtained by ABC News.\n\"I'm trying to tell the truth to the grand jury,\" Costello tells reporters after testifying. \"If they want to go after Donald Trump and they have solid evidence, then so be it. Michael Cohen is not solid evidence.\"\nPecker speaks to the grand jury again for about an hour, according to sources familiar with the matter. The district attorney's office may have called Pecker to bolster Cohen's earlier testimony about the purpose of the payment.\nThe Manhattan grand juryhands down an indictmentagainst Trump, making him the first former or current president to be indicted. The indictment remains under seal so it's not immediately clear what Trump will be charged with, but he negotiates his surrender, saying he will travel to New York the following week.\nTrump travels to New York City from his Mar-a-Lago estate in Florida home, one day ahead of surrendering to the court. He spends the night at his apartment in Trump Tower.\nTrump travels to the Manhattan courthouse from midtown Manhattan to be processed by authorities before heading to court for his arraignment and the unsealing of the indictment.\nThe former presidentpleads not guiltyto 34 felony charges of falsifying business records stemming from his hush payment to Daniels. Prosecutors allege that heengaged in a \"scheme\"to boost his election chances during the 2016 presidential race through a series of hush money payments made by others to help his campaign, and then \"repeatedly and fraudulently falsified New York business records\" to conceal that criminal conduct.\nTrump immediately returns to Mar-a-Lago where he gives a speech to supporters the same night criticizing Bragg for bringing charges and adding, \"We are a nation in decline, and now these radical left lunatics want to interfere in elections by using law enforcement. We can't let that happen.\"\nAthreatening letter containing white powderis sent to Bragg, the second since Trump started posting on social media about his impending indictment. There are no reports of injuries or illness.\nBragg himself has received \"multiple\" death threats since Trump's indictment, police sources tell ABC News.\nProsecutors say the judge overseeing the criminal case against Trump should ask one of his attorneys for additional information about a potential conflict of interest.\nTrump's defense team includes Joe Tacopina, an attorney Daniels once considered hiring to represent her, and the Manhattan district attorney's office says Tacopina's representations so far are insufficient. Trump affirmed at his arraignment he wanted to move forward with Tacopina on his legal team, but Susan Hoffinger, the executive assistant district attorney, said a full hearing would be needed.\nThe potential conflict was raised by Daniels' current attorney, Clark Brewster, who said in a letter to the Manhattan district attorney's office Daniels had a 2018 conversation with Tacopina and lawyers at his firm.\nTacopina has said he never spoke to Daniels and he told the judge his firm refused to represent her.\nJudge Juan Merchan, the New York City judge overseeing Trump's criminal case,imposes a protective orderagainst Trump that is meant to ensure evidence shared by the DA's office doesn't wind up on the internet.\nProsecutors had sought the protective order because of what they called Trump's \"extensive history\" of making inflammatory remarks about witnesses, prosecutors and others associated with legal matters pending against him, assistant district attorney Catherine McCaw said when seeking the order.\nJudge Merchansets a trial dateof March 25, 2024, for Trump's criminal trial on charges of falsifying business records. He had previously indicated that no one associated with the case is allowed to schedule anything that would conflict with the trial.\nThe judge also reviews for Trump the terms of the protective order that prohibits him from sharing on social media any evidence turned over by the Manhattan district attorney during discovery.\nAttorneys for Trump ask Judge Merchan tostep aside, citing the judge's daughter's ties to a Democratic organization.\nThe defense says the judge can't be impartial because his daughter is an executive at Authentic Campaigns, a Democratic consulting firm that worked on President Joe Biden's 2020 campaign.\nMerchan himself will decide whether he is impartial.\nTrump tries in a new court filing to get his criminal prosecution in New Yorkmoved to federal court, arguing the alleged crimes \"took place while the president was in office.\"\nTrump's attorneys accuse the Manhattan district attorney's office of \"deceptively mischaracterizing and ignoring the applicable facts and body of law\" by seeking to keep the case in state court.\nA federal judgeseems disinclinedallow Trump to move his criminal prosecution in New York into federal court.\n\"The act for which the president has been indicted does not relate to anything under the color of his office,\" says Judge Alvin Hellerstein, adding that he intends to issue a decision in the coming weeks.\nFederal judge Alvin Hellersteinrejects Trump's requestto move his hush-money criminal case into federal court.\n\"Trump has failed to show that the conduct charged by the Indictment is for or relating to any act performed by or for the President under color of the official acts of a President,\" Hellerstein writes in his ruling.\nThe judge overseeing Trump's federalelection interference caseorders the trial in that case to begin on March 4, 2024, afterspeaking with Braggto advise him of the likely overlap between the two cases, both of which are slated to start that month.\nJudge Merchan signals he is open tomoving the dateof the trial, currently scheduled for March 4, due to \"the many recent developments involving Mr. Trump.\"\nJudge Merchan rules that attorney Joe Tacopinahas no conflictrepresenting Trump in the case despite prior dealings with Stormy Daniels. Tacopina had been contacted about representing Daniels prior to her choosing since-disgraced attorney Michael Avenatti.\nTrump asks a New York judge todismiss all chargesin his hush money case.\n\"President Trump cannot be said to have falsified business records of the Trump Organization by paying his personal attorney using his personal bank accounts,\" defense attorney Todd Blanche says in the motion, which calls the case a \"discombobulated package of politically motivated charges.\"\nTrumpdrops his effortto move his criminal hush money prosecution from Manhattan court into federal court.\nManhattan District Attorney Alvin Bragg, in acourt filing, opposes Trump's attempt to dismiss his criminal indictment, saying the former president is seeking \"special treatment\" that he does not deserve.\nStormy Daniels is \"set to testify\" in Trump's Manhattan hush money trial set for March 25, theadult film actress sayson the most recent episode of her podcast.\nIn the case's final hearing before the trial gets underway, Judge Juan Merchan -- with Trump in attendance --denies Trump's motion to dismissthe case and shoots down arguments from the defense that the trial should be delayed because it will interfere with Trump's campaigning for president.\nDA Alvin Bragg asks a judge toimpose a limited gag orderbarring Trump from making public statements about witnesses, jurors, court staff and prosecutors other than Bragg involved in the case, citing what he calls Trump's \"longstanding and perhaps singular history\" of attacking people he considers to be adversaries.\nProsecutors plan to useTrump's own words-- including quotes from books like \"Trump: The Art of the Deal\" -- against him in his hush money trial, according to court filings.\nTrump's defense lawyers ask Judge Juan Merchan todeny prosecutors' requestfor a limited gag order, arguing the former president should be permitted to fully respond to attacks by his political opponents.\nThe public release of the infamous 2005 \"Access Hollywood\" tape before the 2016 presidential election \"served as the catalyst\" for Trump's hush payment to Stormy Daniels and should be admissible at his upcoming trial,prosecutors arguein a court filing.\nTrump's attorneys, in a filing, accuse Manhattan District Attorney Alvin Bragg ofpursuing a \"deluded fantasy\" caseagainst the former president by tying a hush payment to an attempt to influence the 2016 presidential election.\nJudge Merchan agrees with the DA's request tolimit the disclosure of the namesand other identifying information of jurors in the upcoming trial, finding \"there is a likelihood of bribery, jury tampering, or of physical injury or harassment of juror(s).\"\nAttorneys for Trump ask Judge Merchan todelay the start of the trialwhile the U.S. Supreme Court weighs Trump's presidential immunity argument -- but the judge pushes back, criticizing the timing of the request and ordering Trump's team to seek permission before making future motions.\nAttorneys for Trump say in a court filing that they willnot invoke a formal \"advice of counsel\" defenseat the trial, but signal that Trump will argue he did not intend to break the law \"because of his awareness that various lawyers were involved.\"\nThe Manhattan district attorney's office tells Judge Merchan that it wouldaccept a 30-day delayto the start of the hush money trial, citing newly disclosed evidence from the U.S. attorney's office in Manhattan.\nJudge Merchandenies Trump's attempts to exclude evidencerelated to the Access Hollywood tape and testimony from key witnesses from his upcoming criminal trial, but rules that prosecutors will not be permitted to play the infamous tape to jurors.\nTrump's request for a lengthy adjournment of his hush money trial based on recently disclosed potential evidence is \"a red herring\" and part of a \"strategic delay,\"prosecutors arguein a court filing.\nStormy Daniels, meanwhile, tells ABC's \"The View\" that she is\"absolutely ready\"to testify at trial.\nJudge Juan Merchanorders the trial to beginwith jury selection on April 15. The decision rejects a bid by Trump's attorneys to further delay the case after the defense raised issues with the late production of over 100,000 pages of potential evidence by federal prosecutors.\nJudge Merchan grants the Manhattan district attorney's request for alimited gag orderon the former president that prevents Trump from making public statements about witnesses in the hush money case, prospective jurors, members of the court staff and their families other than the judge, and lawyers in the case other than Manhattan DA Alvin Bragg.\nThe partial gag order follows Trump's disparaging remarks about witness Michael Cohen, Judge Merchan, and Merchan's daughter, who works with a group involved in Democratic politics.\nJudge Merchanexpands his limited gag orderon Trump to cover the family members of the judge and District Attorney Alvin Bragg, following a request by prosecutors after Trump continues to target Merchan's daughter on social media.\nThe development comes as sources tell ABC News that Trump's former spokesperson Hope Hicks isexpected to testifyfor the prosecution at the upcoming trial.\nTrump's lawyers again ask Judge Merchan torecuse himself from the trial, seven months after the judge declined a similar request by defense lawyers.\nJudge Merchan rules that Trump isnot immune from prosecutionin the case on the grounds of presidential immunity, in part because Trump failed to invoke the defense in a timely fashion.\nThe ruling comes on the same day the Manhattan DA's office urges the judge toreject Trump's attemptto delay the upcoming trial due to the large amount of pretrial publicity.\nJudge Merchanquashes a subpoenaissued to NBCUniversal by defense lawyers that had sought materials related to their documentary about Stormy Daniels, calling the request the \"very definition of a fishing expedition.\"\nJudge Lizbeth Gonzalez of Appellate Division First Departmentdenies Trump's attemptto delay the upcoming trial on the grounds that pretrial publicity has made it impossible to find a fair and impartial jury.\nThe development comes on the same day that Judge Merchanreleases the questionnairehe plans to use to oversee jury selection for the trial. ABC News, meanwhile, reports that prosecutors at the upcoming trial are expected to call several witnesses who are or were part ofTrump's inner circle.\nAppellate Judge Cynthia Kerndeclines Trump's requestto delay the upcoming trial while waiting for the full panel of the Appellate Division First Department to weigh, later this month, whether to relax Trump's limited gag order.\nAppellate Judge Ellen Gesmerdeclines Trump's requestto delay the upcoming trial while waiting for the full panel of the Appellate Division First Department to weigh, later this month, Trump's challenge to a ruling by Judge Merchan barring the defense from raising objections to evidence based on presidential immunity, as well as the judge's refusal to recuse himself from the case.\nTrump's attorneys, in the meantime, havesubpoenaed the wrong Jeremy Rosenberg, according to court filings.\nThree days before the scheduled start of the trial, Judge Merchandenies Trump's requestto adjourn the case due to overwhelming pretrial publicity.\nThe first criminal trial involving a former U.S. presidentgets underwayin New York with the start of Donald Trump's hush money trial. The former president sits through roughly six hours of court proceedings as the process of seating a 12-person jury begins.\nOnDay 2 of the trial, the first seven jurors are selected for the 12-person jury that will be supplemented with six alternates. Among the seven are an oncology nurse, an attorney, a teacher and an IT consultant.\nThe remaining five jurors -- five men and seven women --- are selected for the 12-person jury onDay 3 of the trial, after a temporary setback results in the dismissal of two jurors who were previously seated.\nA full jury of 12 jurors and six alternates is seated inDay 4 of the trial. The alternate jurors are five women and one man.\nAttorneys deliver opening statements inDay 5 of the trial, with prosecutors framing the case as \"election fraud, pure and simple\" and the defense seeking to distance Trump from any alleged wrongdoing.\nFormer National Enquirer publisher David Pecker, testifying onDay 6 of the trial, describes in detail the \"catch-and-kill\" arrangement he struck with Trump and his then-attorney Michael Cohen during the 2016 presidential campaign.\nFormer National Enquirer publisher David Pecker testifies about then-Trump attorney Michael Cohen's payment to Stormy Daniels before being cross-examined onDay 7 of the trial.\nJurors onDay 8 of the trialhear testimony from witnesses including Trump's longtime Trump Organization assistant, Ronna Graff, who says she has a \"vague recollection\" of spotting Stormy Daniels in Trump Tower.\nABC News reports that former Trump attorney Michael Cohen, as he waits to testify in the trial, has been discussing the trial proceedings and attacking Trump in aseries of TikTok livestreamsthat some experts say could hurt Cohen in the courtroom.\nAttorney Keith Davidson, who represented both Stormy Daniels and Karen McDougal, testifies onDay 9 of the trialhow he brokered a pair of deals to keep their alleged affairs with Trump out of print.\nAttorneys for Trump, onDay 10 of the trial, attempt to frame attorney Keith Davidson, who represented both Stormy Daniels and Karen McDougal, as an unsavory figure who made a career of extorting wealthy celebrities for shady clients.\nHope Hicks, one of Trump's closest former advisers, testifies onDay 11 of the trialabout the \"frantic\" hours after his 2016 campaign learned about the existence and imminent release of the infamous \"Access Hollywood\" tape.\nTwo longtime employees of the Trump Organization testify onDay 12 of the trialabout their role in executing a string of payments to then-Trump attorney Michael Cohen in 2017.\nFace to face with Donald Trump for the first time in more than a decade, Stormy Daniels, taking the stand onDay 13 of the trial, gives a graphic description of the alleged 2006 sexual encounter with Trump that he sought to bury ahead of the 2016 presidential election for fear of it torpedoing his campaign.\nAttorneys for Trump, who denies the encounter took place, subsequently move for a mistrial on the grounds that Daniels' explicit testimony was \"extraordinarily prejudicial,\" but Judge Merchan denies the motion, saying the appropriate remedy is not a mistrial, but the defense's cross-examination.\nTrump's defense team asks an intermediate appeals court tofast-track his appealchallenging the constitutionality of the limited gag order in his hush money case.\nUnder a heated cross-examination, Stormy Daniels spars with defense attorneys as she denies allegations that she made up her story of a 2006 sexual encounter with Trump in order to enrich herself, telling jurors onDay 14 of the trialthat her interaction with Trump and subsequent notoriety had a \"negative\" impact on her life.\nJurors also hear testimony from former Trump White House aide Madeleine Westerhout, who testifies about how Trump, while president, signed Michael Cohen's reimbursement checks.\nFormer White House aide Madeline Westerhout, onDay 15 of the trial, testifies that Donald Trump \"was very upset\" with a 2018 Wall Street Journal story that reported on the hush-money payment to Daniels, saying that \"my understanding is he knew it would be hurtful to his family.\"\nAppearing calm and composed on the stand, star witness Michael Cohen, Trump's former attorney at the heart of the hush money case, testifies onDay 16 of the trialthat Trump directed him to \"just take care of\" a payment to silence Stormy Daniels in the waning days of his 2016 presidential campaign, and that Trump approved the final $130,000 deal and signed off on the reimbursement plan.\nCohen testifies that the sole purpose of the scheme was to protect Trump's political fortunes and obscure his role in orchestrating the arrangements.\nIn a combative start to former Trump attorney Michael Cohen's cross-examination, Trump's defense team, onDay 17 of the trial, questions Cohen's motivation for testifying against Trump, highlighting Cohen'sTikTok streamsattacking the former president, in contrast to his past praise and admiration for Trump.\nTrump's defense team undertakes an aggressive bid to undermine former Trump lawyer Michael Cohen's credibility, attempting to frame Cohen as a prolific liar with a bone to pick against his former boss onDay 18 of the trial.\nAfter the defense concludes its cross-examination of former Trump attorney Michael Cohen, the prosecution rests its case onDay 19 of the trial. For the defense's second witness, Trump's attorneys call Cohen's one-time legal adviser Robert Costello, who earns sharp rebuke from Judge Merchan for allegedly violating his \"courtroom decorum.\"\nAfter Michael Cohen's one-time legal adviser Robert Costello completes his testimony, thedefense restson Day 20 of the trial -- without Trump taking the stand in his own defense. The parties thenhash out the instructionsthat will be given to the jury following summations.\nCalling former Trump attorney Michael Cohen an \"MVP of liars,\" Trump's lawyers argue in their lengthyclosing statementthat Trump should be acquitted of all charges because prosecutors presented \"absolutely no evidence of an intent to defraud\" and because the former president had \"absolutely no intent to unlawfully influence the 2016 election.\"\nIn theirown marathon closing, prosecutors tell the jury that Trump chose Cohen as his \"fixer\" because Cohen was \"willing to lie and cheat,\" and that the state has presented a \"mountain of evidence\" demonstrating that Trump was involved in a \"conspiracy to corrupt the 2016 election and a coverup to hide that conspiracy.\"\nIn their first day of deliberations, the juryrequests a readbackof four pieces testimony from the trial: three from former National Enquirer publisher David Pecker and one from former Trump attorney Michael Cohen.\nAt the end of their second day of deliberations, the jury finds former President Trumpguilty on all 34 countsin his hush money trial, marking the first time in history that a former U.S. president has been convicted on criminal charges. Judge Juan Merchan sets Trump's sentencing for July 11.\n\"This was a rigged, disgraceful trial,\" the former president tells reporters outside the courtroom. \"I'm a very innocent man.\"\nPresident Joe Biden,responding to Trump's conviction, says, \"The American principle that no one is above the law was reaffirmed. Donald Trump was given every opportunity to defend himself.\"\n\"That's how the American system of justice works, and it's reckless, it's dangerous, it's irresponsible for anyone to say this was rigged just because they don't like verdict,\" Biden says.\nTrump's legal team says the former presidentwill appealhis hush money conviction, but in the meantime he will comply with the court's standard pre-sentencing investigation.\nAs he awaits sentencing, former President Trump asks Judge Merchan tolift the limited gag orderthat prevents him from speaking about witnesses, jurors and others associated with the case.\nSources say the NYPDwill be revokingformer President Trump's gun permit following his criminal hush money conviction.\nFormer President Trump isinterviewedby New York City probation officials as part of the routine pre-sentencing investigation, according to sources.\nThe New Jersey attorney general's Division of Alcoholic Beverage Control, meanwhile, says it is reviewing thestate liquor licensesheld by Trump's golf courses following his criminal conviction.\nA top Justice Department official informs House Republicans in a letter that an extensive search of DOJ records has uncoveredno contactsbetween senior DOJ officials and Manhattan District Attorney Alvin Bragg's office relating to their state prosecution of former President Trump.\nTrump's lawyerscontinue their pushto terminate the limited gag order in the case, arguing that Trump's \"political opponents\" -- including President Biden, Robert DeNiro, Michael Cohen, and Stormy Daniels -- are using the gag order as a \"sword\" to attack the former president.\nThe New York Court of Appealsdeclines to take up Trump's challengeto the limited gag order imposed on him by Judge Merchan, saying their rejection is \"upon the ground that no substantial constitutional question is directly involved.\"\nJudge Merchan agrees topartially liftTrump's limited gag order, granting him the ability to speak freely about the jury and witnesses in the case.\nIn a blockbuster decision in Trump's federal election interference case, the U.S. Supreme Court rules that the former president isentitled to presumptive immunityfrom criminal prosecution for official acts taken while in office, prompting Trump's attorneys to ask Judge Merchan tothrow out his hush money convictionon the grounds that the jury saw evidence that should have been protected by presidential immunity.\nJudge Merchanpostpones Trump's July 11 sentencingto Sept. 18 so he can consider Trump's request to toss his conviction based on the Supreme Court's immunity ruling.\nThe judge gives Trump's attorneys until July 10 to submit papers and the DA's office until July 24 to respond, and says he will rule on Trump's motion to set aside his conviction on Sept. 6.\nIn a 52-page filing, Trump asks Judge Merchan tovacate his hush money convictionon the grounds that the trial was \"tainted\" by evidence and testimony that the Supreme Court's landmark ruling on presidential immunity now makes off-limits.\nIn a court filing, Manhattan DA Alvin Bragg asks Judge Merchan toreject Trump's attemptto have his conviction thrown out based on the Supreme Court's immunity ruling, arguing that \"the evidence that he claims is affected by the Supreme Court's ruling constitutes only a sliver of the mountains of testimony and documentary proof that the jury considered in finding him guilty.\"\nIn a court filing, Trump revives his longshot effort to have Judge Merchanrecused from the casebecause of an alleged conflict of interest involving the judge's daughter and Vice President Kamala Harris. The filing comes on the same day that a New York appeals courtdenies Trump's efforthave his limited gag order thrown out.\nIn a court filing, Manhattan DA Alvin Bragg urges Judge Merchan todeny Trump's third attemptto have Merchan recused from the case.\nThe U.S. Supreme Courtrejects an attemptby the Republican attorney general of Missouri to delay Trump's sentencing in the case.\nJudge Merchandenies Trump's third attemptto kick him off the case based on an alleged conflict of interest.\nTrump's attorneys ask Judge Merchan topush backthe case's Sept. 18 sentencing date to beyond the November election, in order to combat what they call prosecutors' \"naked election-interference objectives.\"\nAttorneys in the Manhattan DA's office say in a letter to Judge Merchan that they willdefer to the judgeregarding Trump's request to delay sentencing in the trial.\nTrump's attorneys, seeking to delay his sentencing, again ask a federal court in New York toremove the casefrom state court in light of the Supreme Court's ruling on presidential immunity.\nA day after Trump asks a federal court to remove his hush money case from state court, the latest effort to delay his upcoming sentencinghits a snagwhen the court rejects his filing as \"deficient.\"\nU.S. District Judge Alvin Hellersteindenies Trump's attemptto move his New York hush money case from state court into federal court in light of the Supreme Court's presidential immunity ruling.\nJudge Juan Merchan says he willdecide on Fridaywhether to delay Trump's Sept. 18 sentencing. The development comes a day after Trump's attorneys ask the U.S. Court of Appeals for the Second Circuit to stay Judge Hellerstein's order denying Trump's request to move the hush money case into federal court.\nJudge Merchandelays Trump's sentencingfrom Sept. 18 until Nov. 26, after the presidential election, and says he will now rule on Trump's motion to set aside the verdict on Nov. 12.\nThe judge says he made the decision \"to avoid any appearance -- however unwarranted -- that the proceeding has been affected by or seeks to affect the approaching Presidential election.\"\nTrump's attorneys ask the full U.S. Court of Appeals for the Second Circuit todelay his hush money case\"in order to preserve Trump's right to a fair and orderly litigation of the Presidential immunity defense in a federal forum.\"\nThe U.S. Second Circuit Court of Appealsdenies Trump's requestto delay the case, on the same day that New York's Court of Appeals declines to consider Trump's request to lift the remaining elements of the case's limited gag order.\nTrump, in a filing, again asks the U.S. Second Circuit Court of Appeals to transfer his New York criminal hush money caseto federal courtin an effort to stall his Nov. 26 sentencing or throw out his conviction altogether.\nDonald Trump is reelected president of the United States over Kamala Harris,raising questionsabout how and whether Judge Merchan will proceed with Trump's scheduled sentencing later in the month.\nJudge Merchan, on the day he is scheduled to rule on Trump's motion to set aside his conviction based on the U.S. Supreme Court's recent decision on presidential immunity, instead agrees todelay the decisionafter both sides request more time to consider how to proceed following Trump's election victory. The judge gives prosecutors until Nov. 19 to recommend next steps.\nAfter Trump's lawyers argue in a filing that the case should be dismissed because a sitting president is immune from prosecution, prosecutors tell Judge Merchan that they oppose any effort to dismiss Trump's conviction -- but that they do not object topausing the caseuntil Trump is out of office.\nJudge Merchanindefinitely postponesTrump's Nov. 26 sentencing date and gives the defense until Dec. 2 to file a motion to dismiss the case.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Marjorie Taylor Greene to head new DOGE House subcommittee with plans to cut 'waste'", "link": "https://abcnews.go.com/Politics/marjorie-taylor-greene-head-new-doge-house-subcommittee/story?id=116138565", "content": "Musk and Ramaswamy are set to helm the \"Department of Government Efficiency.\"\nRepublican firebrand Rep. Marjorie Taylor Greene has been tapped to chair a new congressional subcommittee aimed at eliminating government waste under the newly formed \"Department of Government Efficiency,\" which is set to be led by Elon Musk and Vivek Ramaswamy -- and firing government employees could be part of her plan.\nHouse Oversight Committee Chairman James Comer announced the creation of the new GOP-controlled \"Delivering on Government Efficiency (DOGE)\" subcommittee in the next Congress, and Greene, a loyal supporter of President-elect Donald Trump, will chair it.\nGreene said in the new position, she will work to \"identify and investigate the waste, corruption, and absolutely useless parts of our federal government.\"\n\"Our subcommittee will provide transparency and truth to the American people through hearings,\" she said in a statement. \"The goal of DOGE is to bring accountability and GUT useless government agencies.\"\nRep. Jamie Raskin, the ranking Democrat on the Oversight Committee, slammed the committee and Greene's involvement in it.\n\"So now a noted student of American government, Rep. Marjorie Taylor Greene, will chair a subcommittee to work with two unvetted billionaires who stand to receive billions more in government contracts and subsidies from the government under Trump,\" Raskin said in a statement.\nThe Georgia Republican haspledged to carry out Trump's agenda in the roleand \"rooted out every penny of waste and abuse\" -- signaling that government employees' jobs could be on the chopping block.\n\"In the private sector, if you're not doing a good job, you get fired. But for some reason, in government, bad employees—whether they're failing to do the job they were hired to do or working in roles that are no longer needed—never get fired,\" Greene wrote in apost on X on Thursday. \"This is incredibly unfair to the hard-working taxpayers of our country, and it's about to change.\"\nTrump himself has made no secret of his plans to cut what he sees as government waste by calling for thedismantling for the Department of Educationandselecting Cabinet picks who talk about abolishing entire agenciesand firing tens of thousands of federal workers at a time.\nHelping in that effort could be thenew Department of Government Efficiency-- helmed by Musk and Ramaswamy, both staunch allies of the president-elect. While DOGE will not be a federal agency in the U.S. government, Trump said it will provide advice and guidance \"outside of government\" and partner with the White House and Office of Management& Budget to \"drive structural government reform.\"\nThe president-elect did not detail how this new department would be funded.\nLawmakers involved in the future subcommittee have already met with members of the White House DOGE team, including Ramaswamy, who support the Oversight Committee's endeavor and are already working together, according to a source.\nRamaswamyposted on Xthat he is \"looking forward\" to working with Greene and with Congress in that effort.\nGreene's time in the House has been marked by several controversies -- including her involvement in araucous House Oversight Committee meeting that included name callingand herplot to oust House Speaker Mike Johnsonfrom the job earlier this year.\nShe has been on the House Oversight Committee since 2023 -- but in 2021, theHouse voted to remove her from her assigned committeesbecause of herrecord of making incendiary remarksranging from allegedly supporting violence against House Speaker Nancy Pelosi and Democrats, to spreading baseless claims that mass school shootings were staged.\nABC News' Will Steakin contributed to this report.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Texas board approves Bible curriculum option in public schools", "link": "https://abcnews.go.com/Politics/texas-board-vote-bible-curriculum-public-schools/story?id=116127619", "content": "Schools can receive money for using the materials.\nThe Texas Board of Education approved a new K-5 curriculum that allows Bible teachings in classrooms.\nThe curriculum includes Biblical and Christian lessons about Moses, the story of the Good Samaritan, the Golden Rule, readings from The Book of Genesis, and more. The accuracy of the materials has come under scrutiny. For example, the curriculum claims \"Abraham Lincoln and other leading abolitionists relied on a deep Christian faith,\" though Lincoln's religion hashistorically been debated.\nThe instructional materials, called Bluebonnet Learning, are developed by the state, according to the Texas Education Agency. The lessons would be optional, but districts can receive at least $40 per student for using state-approved materials, accordingto local legislation.\nSome supporters of instituting religion in the curriculum say that these religious texts are important for the historical context of U.S. history and can instill moral values in the classroom. While some critics said, this violates the First Amendment right to freedom of religion for students and teachers, forcing classrooms to engage in Christian instruction.\nTexas Gov. Greg Abbotthas spoken out in supportof the Texas Education Agency's curriculum after singing legislation directing the Texas Education Agency to purchase and develop instructional materials.\n\"The materials will also allow our students to better understand the connection of history, art, community, literature, and religion on pivotal events like the signing of the U.S. Constitution, the Civil Rights Movement, and the American Revolution,\" Abbott said in a May statement. \"I thank the TEA for their work to ensure our students receive a robust educational foundation to succeed so that we can build a brighter Texas for generations to come.\"\nThe Freedom From Religion Foundation, an advocacy organization centering on the separation of state and church, has criticized the curriculum, claiming leaders are determined to \"turn the state's public schools into Christian training grounds.\"\n\"The curriculum targets the youngest, most impressionable elementary students, starting by introducing kindergartners to Jesus,\" FFRF Co-President Annie Laurie Gaylor said in an online statement ahead of the vote. \"Religious instruction is the purview of parents, not proselytizing school boards. This is a shameful ruse by Christian nationalists in Texas who see the schools as a mission field.\"\nStates like Texas, Oklahoma, Louisiana and others have been behind the push to enforce Christian-based school requirements, including the implementation of Bibles, the Ten Commandments and other religious doctrines in schools.\nEditor's note: A previous version of this story incorrectly stated the grades of the proposed curriculum. The new plan would be for K-5 schools.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Matt Gaetz says he doesn't plan on returning to Congress", "link": "https://abcnews.go.com/Politics/matt-gaetz-returning-congress-after-dropping-bid-attorney/story?id=116138261", "content": "Gaetz said he'll still be \"in the fight but it's going to be from a new perch.\"\nMatt Gaetz said Friday he will not return to Congress afterwithdrawing his namefrom consideration to be President-elect Donald Trump's attorney general.\nIn an interview with conservative commentator Charlie Kirk on\"Real America's Voice,\"Gaetz said he is \"still going to be in the fight but it's going to be from a new perch.\"\n\"I do not intend to join the 119th Congress,\" he said. \"There are a number of fantastic Floridians who've stepped up to run for my seat, people who have inspired with their heroism, with their public service. And I'm actually excited to see northwestFloridago to new heights and have great representation.\"\nQuestions swirled aboutGaetz's futureafter he dropped his confirmation bid on Thursday amid sexual misconduct allegations. Gaetz has long denied the allegations, which were the subject of a federal investigation that ended with no charges as well as a House Ethics Committee probe that was in its final stages when Gaetz stepped down from office last week.\nWhile Gaetz resigned from the 118th Congress just hours after being tapped by Trump to serve in the administration, he won reelection to serve in the 119th Congress beginning in January.\nGaetz said he's been an elected official for 14 years, including eight years on Capitol Hill, and that he has \"other goals in life\" he wants to pursue.\n\"I'm going to be fighting for President Trump. I'm going to be doing whatever he asks of me, as I always have,\" Gaetz said. \"But I think that eight years is probably enough time in the United States Congress.\"\nGaetz also praised Pam Bondi, who was quickly tapped by Trump on Thursday evening to lead the Justice Department pending Senate confirmation.\nAsked by Kirk what happened that caused him to step back from consideration, Gaetz contended it wasn't about the allegations or the House Ethics Committee report -- which Democrats are still pushing to have released.\nGaetz pinned the blame of unsuccessful nomination on his effort to oust former House Speaker Kevin McCarthy, suggesting too many lawmakers had an \"ax to grind.\"\n\"There were senators that had not gotten to yes,\" Gaetz acknowledged, though he argued he believed he could have swayed lawmakers to support him.\n\"I could have engaged in a monthslong fact battle,\" he said. \"But we don't have months to go through that.\"\n\"It was more a matter of pace than anything,\" Gaetz said, \"and the pace was just going to be too, too long for me and with someone like Pam that we can put right there in that spot, we're going to be far more successful as an administration.\"\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Matt Gaetz AG nomination: Timeline", "link": "https://abcnews.go.com/Politics/matt-gaetz-ag-nomination-timeline/story?id=116102495", "content": "Gaetz withdrew his name from consideration eight days after it was announced.\nIn the span of eight days, former Rep. Matt Gaetz went from a reelected House member to an attorney general pick in President-elect Donald Trump's second administration to ultimatelybowing outbefore a Senate confirmation hearing.\nHere is a timeline of the roller coaster of events for the embattled ex-congressman.\nPresident-elect Donald Trump announces that Gaetz, who had won reelection for Florida's 1st district on Election Day, was his nominee for attorney general.\nGaetz resigns from Congress that day, according to House Speaker Mike Johnson.\nSeveral House Republicans meeting behind closed doors said there wasan audible gaspin the room when they heard Trump had picked Gaetz, sources told ABC News.\nGaetz was investigated for alleged sex trafficking by the Justice Department, however, no charges were ultimately brought.\nThe House Ethics Committee has also been probing Gaetz on those allegations, which he has repeatedly denied.\nFlorida Gov. Ron DeSantis announces he will hold a special election to fill the Gaetz's seat but doesn't immediately provide details.\nSen. John Thune, the incoming Senate majority leader, tells reporters he doesn't know if Gaetz can get confirmed until they start the confirmation process.\nSenators on both sides of the aisle call for the release of details from the Ethics Committee's investigation into the former congressman.\nABC Newsreportsthe woman who was at the center of the Justice Department investigation into sex trafficking allegations surrounding Gaetz testified to the House Ethics Committee that the former congressman had sex with her when she was 17 years old.\nJohnson tells reporters that he would urge the Ethics Committee not to release their report on their probe into Gaetz.\nThe speaker says he didn’t think it was \"relevant\" for the public to know what’s in the report.\nAn attorney representing two women who were witnesses in the House Ethics Committee's investigationtells ABC Newsone of his clients testified that she witnessed the Florida congressman having sex with a minor.\nIn an interview with ABC News' Juju Chang, Florida attorney Joel Leppardreveals new detailsregarding his clients' closed-door testimony before the Ethics Committee -- including that his clients told congressional investigators that Gaetz allegedly paid for them to travel across state lines to have sex on at least two occasions.\nTrump backer and Tesla/SpaceX/X CEO Elon Musk backs Gaetz despite more stories about his scandals coming to light. Musk said the scandals were \"worth less than nothing\" and called the former congressman \"our Hammer of Justice,\" in a post on X.\nJohnson denied that he discussed the details of the draft ethics report on the Gaetz matter with House Ethics Chairman Michael Guest, and further denied that Trump or Gaetz pressured him to bury the report.\nA hacker gained access to an online secure document-sharing file between attorneysinvolved in a civil lawsuit brought by a close friend to Gaetz, and potentially revealed documents, including unredacted depositions from key witnesses in the case, sources familiar with the matter told ABC News.\nDuring a Space X launch, Trump tells reporters he is not reconsidering his pick for attorney general.\nABC Newsreportsthe Ethics Committee obtained records, including a check and records of Venmo payments, that appear to show that Gaetz paid more than $10,000 to two women who were later witnesses in sexual misconduct probes conducted by both the House and the Justice Department, according to documents.\nGaetzmeets with Republican senators,who push for his nomination process to continue.\nDemocrats on the Senate Judiciary Committee write to FBI Director Christopher Wray to request the complete evidentiary file in the bureau's closed investigation into Gaetz.\nThe Ethics Committee voted against releasing the report after multiple rounds of votes, with all Republicans on the committee voting against its release, during a closed-door, two-hour meeting. The committee schedules another meeting in December. Two Democrats introduce privileged resolutions to make the report public.\nJohnson says said the House will take up the privileged resolution to force the release of the Gaetz report after Thanksgiving break.\nGaetz announces on X that he is withdrawing his name from the nomination process.\n\"While the momentum was strong, it is clear that my confirmation was unfairly becoming a distraction to the critical work of the Trump/Vance Transition,\" he said in the post.\nIllinois Democratic Rep. Sean Casten suggests that he plans to still move forward with forcing the House to vote on compelling the Ethics Committee to release the Gaetz report.\nGaetz tells conservative commentator Charlie Kirk that hedoes not intend to join the 119th Congress, but is \"still going to be in the fight but it's going to be from a new perch.\"\n\"And I'm actually excited to see northwest Florida go to new heights and have great representation,\" he said.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Trump's Cabinet picks boast thin resumes. That's the point: ANALYSIS", "link": "https://abcnews.go.com/Politics/trumps-cabinet-picks-boast-thin-rsums-point-analysis/story?id=116106308", "content": "\"Debating resumes ... plays right into Trump's favor,\" one Democrat said.\nMany of President-elect Donald Trump's picks to fill his Cabinet boast resumes that are thin on the kind of subject matter the agencies they would helm oversee.\nBut that doesn't necessarily mean they're politically unqualified.\nThe ongoing battle on Capitol Hill over Trump's selections underscores how outsider bona fides and shake-it-up attitudes now imbue would-be secretaries with credibility. That's in contrast to steady-as-she-goes mantras and beefy résumés in a government bureaucracy that voters believe has failed them, Republican operatives told ABC News.\nThe shifting vocabulary is just another example of Trump's ability to transform norms in Washington, but also of voter frustrations and a shifting electorate. And now, Democrats warned, targeting nominees' résumés risks reinforcing the image that the party is unreceptive to the beliefs of everyday Americans about what ails the country.\n\"I'm not endorsing anyone, but the argument that this person isn't qualified to do X because he doesn't have the résumé or the establishment kiss of approval just reinforces that they don't get it,\" said Chris Kofinis, a Democratic strategist and former aide to Sen. Joe Manchin, I-W.Va. \"Debating résumés when most people distrust government plays right into Trump's favor.\"\n\"If you asked most American people, guess what they would say, 'What's the difference? It's not like they've been doing a great job beforehand, so now you're worried about this guy?'\" Kofinis added of would-be nominees' qualifications. \"The argument is, 'you need to have people with managerial and certain type of policy expertise to run these agencies.' Based on whose opinion? Based on experts' opinion, or based on the American people's opinion?\"\nTrump has moved at a rapid pace to flesh out his upcoming administration, handpicking an array of establishment and unconventional people for top posts.\nSen. Marco Rubio and Rep. Mike Waltz, two Floridians, were deemed establishment picks for secretary of state and national security adviser, respectively.\nThe president-elect has also put forth Fox News host and Army veteran Pete Hegseth as his Pentagon chief, Linda McMahon to lead the Education Department, South Dakota Gov. Kristi Noem as homeland security secretary and former Democratic Rep. Tulsi Gabbard of Hawaii to be director of national intelligence. Former Florida GOP Rep. Matt Gaetz was also pegged to be attorney general, though he took his name out of consideration on Thursday.\nNone has particularly brawny resumes on those departments' subject matter, which Democrats have repeatedly noted.\nTo be certain, resumes aren't the only issue at play. Gaetz and Hegseth are beset by sexual misconduct allegations, and Trump is still one to put a premium on loyalty as he sifts through is options for top administration posts. But Democrats have also worked to paint several of the picks as \"unqualified\" based on their relative lack of experience as well as by virtue of past personal issues and Trump's various policy pushes.\nThe question, though, is precisely what the word \"qualified\" means after an election in which voters registered their discontent with business as usual via their ballots.\n\"I think you can call some of these people outsiders, for sure. Others have experience, it's just not the experience that maybe the D.C. establishment is looking for. It's not somebody that worked their way up in this department and now is the person to do it. It's someone that's going to take a fresh look,\" said Nick Trainer, a GOP strategist and former Trump administration official.\n\"Americans that aren't tuned into their government every day are shifting towards the Republican Party, and it's because these elites in the D.C. establishment and the Democrat Party don't get it,\" Trainer added. \"They just don't understand that an average American in a Midwestern state or whatever doesn't care if their secretary of XYZ studied at Harvard. That's not what they want.\"\nThe new standard is being established with the help of Trump's unique sway among his base, offering him the ability to inject credibility into his picks solely by virtue of his imprimatur. And now, Democrats are forced to grapple with precisely how to respond.\nThe party is undergoing a post-election reckoning to understand how its brand became so unpalatable that Vice President Kamala Harris suffered a comprehensive defeat to a twice-impeached convicted felon. Tactical decisions over advertising, spending, media appearances and more have been cited as possible pitfalls for Harris.\nBut beyond tactics, Democrats lamented a reputation as elitist, inside-the-beltway experts with little knowledge or interest in what average Americans feel is important for the country. And going after cabinet candidates for lacking elite academic or government bureaucratic credentials risks exacerbating the issue.\n\"The dog whistle when it comes to how Democrats describe experience, is it means status quo,\" said Sean Spicer, Trump's first White House press secretary.\nSome Democrats said the likely nominees' past policy stances are ripe for criticism -- but that going after resumes could be risky.\n\"Anytime we are showing elitism or being preachy, it's not good for our brand. But if we're calling out folks who have turned their back on workers or people that have done things that are not in the best interest of America or other things, then I think those are distinct questions that help the party,\" said Chuck Rocha, a Democratic strategist who is mulling a run for Democratic National Committee chair.\n\"It's about not being with America, not being with the workers,\" Rocha added Wednesday. \"I would argue against Matt Gaetz, sure, the sex parties and the other stuff is crazy, but he's also had a long resume of voting against capping insulin and other things that have really been bad for American workers.\"\nOthers advocated more of a wait-and-see approach.\n\"If your angle of attack is, 'person X is grossly unqualified,' let them prove they're not qualified,\" Kofinis said. \"If you want to start earning trust back from the American people, stop being so quick to give an answer and conclusion, and wait.\"\nWhile Democrats are figuring out how to respond to Trump's picks and how to resurrect their brand more broadly, Republicans are satisfied to watch them twist in the wind.\n\"Democrats are the resistance party. They're going to find whatever excuse they can to resist,\" said one former Trump campaign official. \"So, I'm not surprised by that, but they're going to continue to hurt themselves, that's for sure. They're missing the point.\"\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Tracking Trump's picks to serve in his Cabinet, administration", "link": "https://abcnews.go.com/Politics/tracking-trump-named-serve-cabinet-administration/story?id=115777302", "content": "Trump's choices include RFK Jr., Elon Musk, Matt Gaetz and more.\nPresident-electDonald Trump, ahead of his return to power in January, is announcing who he wants to fill Cabinet positions and other key roles inside his administration, including names like Marco Rubio, Tulsi Gabbard and Matt Gaetz.\nTrump began to roll out his nominees and appointees just days after his election victory over Vice President Kamala Harris. Among them are some of his staunchest allies on Capitol Hill and key advisers to his 2024 campaign.\nTrump will have a Republican-controlled Senate and possibly a Republican-controlled House to help usher his picks through. But he's also urging the incoming Senate leader to embracerecess appointments, which has led to speculation some of his choices may be more controversial.\nHere is a running list of whom Trump has selected, or is expected to select, to serve in his administration:\nTrump announced Florida Sen. Marco Rubio as his pick to be secretary of state.\nRubio is the vice-chair of the Senate Select Committee on Foreign Intelligence and sits on the Senate Committee on Foreign Relations. He holds hard-line views on China, Iran and Russia, although like other Republicans he has shifted on support for Ukraine's war effort to be more aligned with Trump.\nRubio will need to be confirmed by the Senate. Read more about Rubio's experiencehere.\nTrump announced he has chosen South Dakota Gov. Kristi Noem to be his secretary for the Department of Homeland Security.\nAs Trump's Homeland Security secretary, among Noem's biggest roles is expected to be to oversee Trump's border policies, including the major campaign promise of \"mass deportations,\" alongside Trump's \"border czar\" Tom Homan and White House deputy chief of staff on policy Stephen Miller.\nThe role would require Senate approval. Read more about Noemhere.\nTrump has selected Fox News host Pete Hegseth to lead the Department of Defense.\nHe listed Hegseth's experience as a veteran and his media experience as his reasons for the choice. Hegseth served in the Army National Guard and was deployed to Iraq and Afghanistan and previously served as the director of an advocacy group that has called for more privatization of the Veterans Administration.\nHegseth will need to be confirmed by the Senate to serve in the role. Read more about Hegsethhere.\nTrump said he has picked Robert F. Kennedy Jr., a vaccine skeptic, to lead the Department of Health and Human Services.\nHHS oversees major health agencies such as the Centers for Disease Control and Prevention, the Food and Drug Administration and the Centers for Medicare& Medicaid Services, among others.\nThe job requires Senate confirmation. Read more about Kennedyhere.\nTrump announced the two men will lead what he's calling a new \"Department of Government Efficiency.\"\nIt will not be a new federal agency, but will provide \"outside of government\" counsel on reforming departments and cutting waste, Trump said.\nRead more about Trump's planhere. The president-elect did not detail how this new department would be funded.\nFormer Rep. Matt Gaetz announced hewas withdrawing his name from consideration to be Trump's attorney general.\nGaetz informed Trump that he'd be withdrawing shortly before announcing his decision, sources familiar with the matter told ABC News.\nSources told ABC News in the last few days it became clear to the Trump team that Gaetz was not going to have enough votes for a Senate confirmation -- with sources close to the president-elect telling ABC News that there was \"no path to 50\" senators.\nThe attorney general position needs to be confirmed by the Senate.\nAfter former Rep. Matt Gaetz announced he withdrew his name for consideration to be attorney general, Trump nominated Pam Bondi as his new pick.\nBondi is the former attorney general of Florida, marking the first woman in the role.\nBondi has remained in Trump’s inner circle for years and has continued to advise him on legal matters. She was also one of the lawyers who defended Trump during his first Senate impeachment trial.\nPresident-elect Donald Trump announced he is nominating Linda McMahon, a former World Wrestling Entertainment executive and the former Small Business Services secretary, to lead the Department of Education.\nMcMahon, who served as Trump's Small Business Services administrator for two years, has no teaching or experience but served one year on the Connecticut State Board of Education.\nTrump hasproposed that the Department of Education be eliminatedand to \"send all education work and needs back to the states,\" according to his Agenda47 policy platform.\nMcMahon's appointment must be approved by the Senate. Read more about McMahonhere.\nPresident-elect Donald Trump announced Brendan Carr as his pick for chairman of the Federal Communications Commission on Nov. 17.\nCarr previously served as general counsel for the FCC and as the senior Republican for the FCC.\nTrump first nominated Carr to the FCC in 2017. The president-elect said in his official announcement this week that although Carr's current term runs through 2029, the president-elect is now designating him as the \"permanent chairman.\"\nA president chooses a chair from among Senate-confirmed commissioners of the FCC, such that the choice does not require further confirmation from the Senate.\nTrump nominated his own personal top defense attorney for the second highest position in the Department of Justice on Thursday.\nAfter much speculation, Trump nominated his lawyer who represented Trump in the hush money case and in both of Jack Smith's federal probes.\nBlanche will need to be confirmed by the Senate.\nTrump announced he nominated Emil Bove for principal associate deputy attorney general.\nBove will need to be confirmed by the Senate.\nTrump announced he nominated former Georgia Rep. Doug Collins for secretary of veterans affairs.\nCollins is a veteran who currently serves as a chaplain in the U.S. Air Force Reserve Command, Trump said in a statement.\n\"We must take care of our brave men and women in uniform, and Doug will be a great advocate for our Active Duty Servicemembers, Veterans, and Military Families to ensure they have the support they need,\" Trump said.\nCollins' position requires Senate confirmation.\nTrump announced Chris Wright is his nominee to lead the Department of Energy.\nWright, who must be approved by the Senate, is the chief executive of Liberty Energy – the world’s second-largest fracking services company – and is one of the industry’s most outspoken critics of the effort to combat climate change.\n\"As Secretary of Energy, Chris will be a key leader, driving innovation, cutting red tape, and ushering in a new 'Golden Age of American Prosperity and Global Peace,'\" Trump said.\nWright has said he doesn't believe there is a \"climate crisis\" and has argued that policies aimed at combating climate change make energy more expensive and less reliable.\nRead more about Wright's experiencehere.\nTrump announced he has chosen North Dakota Gov. Doug Burgum as his interior secretary.\nTrump also announced that Burgum will be joining his administration as chairman of the \"newly formed, and very important, National Energy Council.\"\nThe council will consist of all departments and agencies \"involved in the permitting, production, generation, distribution, regulation [and] transportation\" of American energy, Trump said.\nBurgum wasseen as a possible running mate of Trump's. He was one of his busiest surrogates, campaigning for the former president and raising money for his reelection campaign.\nThe position requires Senate confirmation.\nTrump announced that he has picked former Wisconsin Rep. Sean Duffy for transportation secretary.\n\"He will prioritize Excellence, Competence, Competitiveness and Beauty when rebuilding America’s highways, tunnels, bridges and airports,\" Trump said in a statement. \"He will ensure our ports and dams serve our Economy without compromising our National Security, and he will make our skies safe again by eliminating DEI for pilots and air traffic controllers.\"\nDuffy co-hosts \"The Bottom Line\" on Fox Business and is a Fox News contributor.\nThe position requires Senate confirmation.\nTrump said on Thursday he has selected Dean John Sauer as solicitor general.\nAs Trump's defense attorney, Sauer argued for presidential immunity in front of the Supreme Court earlier this year, in which the high court granted broad immunity for official acts.\nThe Department of Justice position requires Senate confirmation.\nHe marks the third attorney who has worked on Trump's criminal cases nominated for a DOJ position.\nTrump announced former ActingImmigrationand Customs Enforcement Director Tom Homan will serve as \"border czar.\"\nHe will be charged with seeing out the mass deportations Trump promised throughout his campaign.\nHoman oversaw ICE under the Trump administration for a year and a half, at a time when the administration's \"zero tolerance\" policy led to parents being separated from their children at the border.\n\"Border czar\" is not an official Cabinet position, meaning it won't need Senate confirmation. Read more about Homanhere.\nSusie Wiles will be the first female chief of staff for any White House.\nWiles was Trump's co-campaign manager for his 2024 run. Trump also credited her for her work on his 2016 and 2020 White House bids, though his 2024 bid ran smoother and saw fewer shake-ups.\nWiles is the daughter of legendary NFL Hall of Famer Pat Summerall. She will not require Senate confirmation to serve in the post.\nTrump announced that Stephen Miller will become his deputy chief of staff for policy.\nMiller is one of Trump's senior advisers and helped craft his hard-line immigration policies during his first term. He will be key in trying to implement Trump's 2024 campaign pledge to mass deport migrants illegally living in the U.S.\nHe will not require Senate confirmation to serve in the post. Read more about Miller's backgroundhere.\nJoining Stephen Miller as another top adviser from his campaign being brought to the White House is Dan Scavino, whom Trump selected as deputy chief of staff.\nScavino was also a senior aide during Trump's first term in office.\nTaylor Budowich also supported Trump's campaign efforts and earned himself a spot at the White House.\nHe previously ran Trump's super PAC, MAGA Inc.\nJames Blair was the political director for Trump's campaign and will seemingly offer similar skills to Trump's administration through the role of deputy chief of staff for legislative, political and public affairs.\nFormerly, he was the founder and president of a political consulting firm.\nNew York Rep. Elise Stefanik has been tapped to be Trump's U.S. ambassador to the United Nations.\nStefanik joined Congress as a moderate Republican but became one of Trump's key defenders after his first impeachment and after his 2020 election loss. She joined House leadership in 2021 as chair of the House Republican Conference.\nStefanik made headlines this past year as she challenged university presidents on their handling of protests over theIsrael-Gaza war. She's also accused the United Nations of antisemitism over some of the resolutions passed amid the conflict.\nStefanik will have to be confirmed by the Senate to serve in the role. Read more about Stefanikhere.\nTrump has selected John Ratcliffe to serve as director of the CIA.\nThe former three-term Republican congressman from Texas served as Trump's director of national intelligence from mid-2020 until the end of Trump's first term.\nHis path to DNI wasn't a smooth one -- he was nominated to the post in 2019, but he withdrew his nomination after questions from both parties arose about his qualifications for the job and whether he had embellished his record as a federal prosecutor.\n\"From exposing fake Russian collusion to be a Clinton campaign operation, to catching the FBI's abuse of Civil Liberties at the FISA Court, John Ratcliffe has always been a warrior for Truth and Honesty with the American Public,\" Trump said in a statement announcing his pick. \"When 51 intelligence officials were lying about Hunter Biden's laptop, there was one, John Ratcliffe, telling the truth to the American People.\"\nRatcliffe's nomination requires Senate confirmation. Read more about himhere.\nTrump has tapped former New York congressman Lee Zeldin to lead the EPA.\nZeldin represented Long Island's Suffolk County in the House of Representatives for eight years before launching a failed bid for governor against Democrat Kathy Hochul. Before becoming an elected official, Zeldin was an attorney.\nZeldin has pledged to eliminate regulations at the EPA he claimed are hampering businesses. He also said he wanted to restore energy independence as well as protect access to clean air and water.\nZeldin will need Senate confirmation to serve in the role. Read more about himhere.\nTrump has picked Florida Rep. Michael Waltz to be his national security adviser.\nWaltz, who was the first Green Beret elected to the House, sits on the House Intelligence, Armed Services and Foreign Affairs committees. Before becoming an elected official, Waltz served in various national security policy roles.\nThe national security adviser is appointed by the president with no Senate confirmation needed.\nTrump announced he has nominated former Arkansas Gov. Mike Huckabee to be the U.S. ambassador to Israel.\nThe role, which will need to be confirmed by the Senate, will be a key appointment as tensions remain high in the Middle East. Like David Friedman, Trump's first ambassador to Israel, Huckabee is an outspoken supporter of the Israeli settlement movement.\nTrump announced that he had picked Tulsi Gabbard -- a military veteran and honorary co-chair of his transition team -- has been chosen by Trump to be his director of national intelligence.\nThe position requires Senate confirmation. Read more about Gabbardhere.\nTrump announced that he picked Cantor Fitzgerald CEO Howard Lutnick as his secretary of the Department of Commerce.\nLutnick, who leads the investment bank, has been serving as co-chair of the Trump transition team alongside Trump's former Small Business Administrator Linda McMahon.\nThe role requires Senate confirmation.\nRead morehere.\nTrump announced that Steven Cheung, who previously served as the director of strategic response in Trump's first term, will serve as director of communications in his second.\nCheung was also the director of communications for Trump's presidential campaign.\nTrump has announced that Sergio Gor, who ran the pro-Trump Super PAC Right For America, will serve as director of the Presidential Personnel Office.\nIn this role, he joins Cheung as an assistant to the president.\nIn his statement announcing the selection, Trump said, \"Steven Cheung and Sergio Gor have been trusted Advisors since my first Presidential Campaign in 2016, and have continued to champion America First principles throughout my First Term, all the way to our Historic Victory in 2024.”\nTrump has named attorney Bill McGinley as his White House counsel, his transition team announced.\nMcGinley served as the White House Cabinet secretary during Trump's first term and has served as general counsel at the National Republican Senatorial Committee.\n\"Bill is a smart and tenacious lawyer who will help me advance our America First agenda while fighting for election integrity and against the weaponization of law enforcement,\" Trump said in a statement.\nThe White House counsel is appointed by the president.\nTrump announced that one of his own lawyers, Will Scharf, will serve as assistant to the president and White House staff secretary.\n“Will is a highly skilled attorney who will be a crucial part of my White House team,” Trump said in a statement.\nScharf helped defend Trump in his federal election interference case and his Supreme Court immunity case.\nTrump nominated his former SEC chair, Jay Clayton, as the U.S. Attorney for the Southern District of New York. The president-elect made his announcement on social media.\nThe position requires Senate confirmation.\nPrior to running the SEC, Clayton worked almost exclusively as a corporate attorney, with the exception of a two-year clerkship and a brief internship for the U.S. Attorney's Office for the Eastern District of Pennsylvania.\nDr. Mehmet Oz has been selected to serve as the administrator of the Centers for Medicare and Medicaid Services, Trump announced.\nThe agency is within the Department of Health& Human Services. Trump indicated that Dr. Oz will work closely with Robert F. Kennedy Jr. to take on chronic diseases.\nThe position requires Senate confirmation.\nTrump announced he's nominating former congressman Peter Hoekstra to be the United States ambassador to Canada.\nThe role requires Senate confirmation for approval.\nMost recently, Hoekstra served as chairman of the Michigan Republican Party. He previously served as the U.S. ambassador to the Netherlands during Trump's first term.\nTrump announced former acting attorney general Matt Whitaker as ambassador to NATO.\nWhitaker was an active member of Trump's 2024 campaign.\n\"Matt is a strong warrior and loyal Patriot, who will ensure the United States' interests are advanced and defended,\" Trump said.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Congressional Republicans continue to introduce bills eliminating the DOE", "link": "https://abcnews.go.com/Politics/congressional-republicans-continue-introduce-bills-eliminating-department-education/story?id=116115168", "content": "Republicans Mike Rounds and Thomas Massie want to abolish the DOE.\nSouth Dakota Sen. Mike Rounds introduced the \"Returning Education Back to Our States Act\" on Thursday, signaling a commitment to deliver on President-elect Donald Trump's vow to dismantle the Department of Education.\nIn the conservative movement to return education back to local control, Rounds said the legislation would \"eliminate\" the department while redistributing all critical federal programs to other agencies.\nRounds' announcement was first reported by Fox News.\n\"For years, I've worked toward removing the federal Department of Education,\" the Republican senator wrote in a statement, adding \"I'm pleased that President-elect Trump shares this vision, and I'm excited to work with him and Republican majorities in the Senate and House to make this a reality. This legislation is a roadmap to eliminating the federal Department of Education by practically rehoming these federal programs in the departments where they belong, which will be critical as we move into next year.\"\nIn his statement, Rounds said the United States spends too much on education for students' test scores to be lagging behind other countries in standardized assessments. He called the DOE ineffective and earmarked the department's responsibilities for the Departments of Interior, Treasury, Health and Human Services, Labor and State, according to the bill text.\nThe Individuals with Disabilities Education Act (IDEA) and aid programs under Title VIII of the Elementary and Secondary Education Act will be transferred to the Department of Health and Human Services, the Office of Indian Education of the Department of Education will be transferred to the Department of the Interior, the Federal Pell Grant and other higher education loan programs will be transferred to the Department of the Treasury.\nAccording to the bill, the treasury department will allocate Block grants to states for K-12 and postsecondary education. The treasury secretary also has the power to withhold these funds if they are mishandled by the states. The Justice Department will oversee federal civil rights laws that were previously under Title VI.\nKentucky Rep. Thomas Massie told ABC News Thursday morning that he would also bring forward legislation to abolish the DOE within the \"first few weeks\" of the 119th Congress.\n\"There'll be one sentence - only thing that will change is the date: The Department of Education shall terminate on December 31, 2026,\" Massie told ABC News.\nMassie has been pushing to defund the U.S. Department of Education since the start of 2023 when he introduced H.R. 899. Massie's bill wasn't voted on in the House last year.\nHowever, education analyst Neal McCluskey at the Cato Institute, a libertarian think tank, argued Massie's one-sentence bill was not realistic.\n\"You've got to figure out what to do with all the legislation that feeds into the Department of Education,\" McCluskey said.\n\"If Congress were to pass that law that says, abolish the Department of Education, technically the department would go away, but then you'd have all sorts of questions, well, who's going to administrate or be administrator for all these programs,\" he said.\nIn March 2023, Massie wrote an amendment H.Amendment 124 in H.R. 5, the \"Parents Bill of Rights Act\" – the House's signature K-12 education policy – to abolish the department. That amendment failed as all Democrats and 60 House Republicans voted against it.\nEven as Republicans hold majorities in both chambers next Congress, the Senate typically needs 60 votes to do anything, according to McCluskey. McCluskey said, \"There's no chance they're going to be at 60, and so it's going to be tough [to abolish the department legislatively].\"\n\"The Department of Education administers a whole lot of laws, and then those laws have to be changed about who runs student aid and who is tasked with making decisions about canceling student debt, and who decides or who administers Title I and lots of these other federal programs,\" McCluskey told ABC News.\n\"He [President-elect Trump] can certainly use the bully pulpit to drive this a lot. He could provide legislative blueprints if he wanted to. But ultimately this has to come through Congress,\" McCluskey underscored.\nMeanwhile, Augustus Mays, vice president for partnerships and engagement at the advocacy group The Education Trust, told ABC News that the president-elect could also ask Congress to gut federal programs like Title 1, the Every Student Succeeds Act (ESSA), and others, in his congressional budget request.\nPublic education, particularly in high-need districts, would effectively be drained of millions of dollars, according to Mays.\n\"It would really cripple the ability to function and aid the support that these students need to really succeed from an academic standpoint,\" Mays said.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "What to know about Trump AG pick Pam Bondi", "link": "https://abcnews.go.com/Politics/trump-announces-pam-bondi-new-attorney-general-pick/story?id=116115173", "content": "Trump chose the former Florida attorney general shortly after Gaetz withdrew.\nOn the same day that former Rep. Matt Gaetzwithdrew himself from considerationas President-elect Donald Trump's attorney general, Trump announced that formerFloridaAttorney General Pam Bondi is his second choice to fill that role in his administration.\nBondi, 59, has remained in Trump’s inner circle for years and has continued to advise him on legal matters. She was one of the lawyers who defended Trump during his first Senate impeachment trial.\n\"I have known Pam for many years -- She is smart and tough, and is an AMERICA FIRST Fighter, who will do a terrific job as Attorney General!\" Trump said in a Truth Social post.\nBondi's nomination must be confirmed by the Senate. She did not immediately comment on Trump's announcement.\nFor more than a decade, Bondi has been a key Trump supporter and has been involved in some controversies -- including the \"big lie,\" pushed by Trump in 2020. She publicly espoused the false claim that he rightfully won the battleground state of Pennsylvania.\nIn 2013, the Trump Foundation sent a $25,000 donation to Bondi's fundraising committee for her attorney general reelection campaign.\nAround the same time, Bondi's office had on its deska lawsuitthat probed both Trump himself and Trump University, but it ultimately did not join the suit.\nBondi and Trump both denied allegations that the donation led to her decision to not join the lawsuit, which had been filed by the New York attorney general's office.\nShe endorsed Trump for his presidential run and spoke at the 2016 Republican National Convention, leading a \"lock her up chant\" against then-Secretary of State Hilary Clinton.\nShe also served as a co-chair of Trump's reelection bid and spoke at the Republican National Convention in 2020.\nBondi was elected attorney general in 2010 and was reelected in 2014. She left the office after reaching her two-term limit in 2019.\nA year later, she was selected as part of Trump's defense team for his first impeachment trial. He was acquitted in the Senate.\nBondi has also been a registered lobbyist since 2019 at Brian Ballard's firm, Ballard Partners. Trump’s chief of staff, Susie Wiles, is also a lobbyist with the firm.\nBondi’s most recent clients include the Florida Sheriffs' Association, the Florida Sheriffs' Risk Management Fund and the Major County Sheriffs of America. Her quarterly retainer fees range from $20,000 to $50,000, federal lobbying disclosures show.\nShe has previously represented investment firms and corporate clients like Amazon, General Motors, the MLB, Fidelity, Uber and the GEO Group, which is a private prison company, according to filings.\nIn 2019 and 2020, Bondi was engaged in consulting and advocacy services on behalf of the Embassy of the State of Qatar regarding \"matters involving anti-human trafficking,\" foreign lobbying disclosures filed by Ballard Partners show. Bondi registered as a foreign agent for the government of Qatar as part of her lobbying work.\nAfter his impeachment trial, Bondi remained with Trump's legal team while he campaigned in 2020 and repeatedly made false claims about voter fraud when he lost to Joe Biden.\nRecently, she has been a member of the conservative think tank America First Policy Institute, which was formed by former Trump administration officials. She serves as AFPI's chair for the Center for Litigation, and co-chair of the Center for Law and Justice, according to the think tank's website.\nBondi and AFPI attorneys were involved in preemptive election lawsuits in battleground states during this year's election.\nTrump has previously named his other personal attorneys to senior roles in the Department of Justice, including Todd Blanche, Emil Bove and D. John Sauer.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Matt Gaetz withdraws from consideration as Donald Trump's attorney general", "link": "https://abcnews.go.com/Politics/matt-gaetz-withdraws-donald-trumps-attorney-general/story?id=116099891", "content": "Gaetz said his confirmation bid was \"unfairly becoming a distraction.\"\nFormer Republican Rep. Matt Gaetz announced Thursday he is withdrawing his name from consideration to be President-electDonald Trump's attorney general.\n\"I had excellent meetings with Senators yesterday,\" Gaetz wrote in a post on X. \"I appreciate their thoughtful feedback - and the incredible support of so many. While the momentum was strong, it is clear that my confirmation was unfairly becoming a distraction to the critical work of the Trump/Vance Transition. There is no time to waste on a needlessly protracted Washington scuffle, thus I'll be withdrawing my name from consideration to serve as Attorney General. Trump's DOJ must be in place and ready on Day 1.\"\n\"I remain fully committed to see that Donald J. Trump is the most successful President in history,\" Gaetz added. \"I will forever be honored that President Trump nominated me to lead the Department of Justice and I'm certain he will Save America.\"\nGaetz informed Trump late Thursday morning that he'd be withdrawing, sources familiar with the matter told ABC News.\nTrump, who had been personally calling lawmakers to shore up support for Gaetz, issued a statement saying he appreciated Gaetz's \"recent efforts\" to seek Senate approval and claiming that withdrawing was Gaetz's choice.\n\"He was doing very well but, at the same time, did not want to be a distraction for the Administration, for which he has much respect,\" Trump wrote. \"Matt has a wonderful future, and I look forward to watching all of the great things he will do!\"\nVice President-elect JD Vance, who escorted Gaetz to meet Vance's fellow GOP senators on Wednesday, posted on X, \"I’m extremely grateful for the work Matt put into the nomination process. He made his decision to withdraw entirely out of respect for President Trump’s administration. Matt is a patriot and I look forward to seeing what he does next.\"\nGaetzresponded on X, \"Thank you, Mr. VP-Elect! I look forward to continuing the fight to save our country. Just maybe from a different post\"\nTrump announced last Wednesday he was tapping Gaetz to serve as the nation's top law enforcement officer. Gaetz, a conservative firebrand in Congress, resigned his seat shortly after.\nThe choice shocked many Republicans on Capitol Hill andraised eyebrowswithin the Justice Department.\nSen. Kevin Cramer, R-N.D., expressed \"relief\" after Gaetz's announcement.\n\"I know enough people that were a “hell no” in the conference to know that the path would have been very, very difficult, if possible, and I doubt it was,\" Cramer said.\nGOP Sen. Josh Hawley of Missouri said he thinks it was the \"right decision\" even though Gaetz sounded so \"optimistic\" during their meeting on Capitol Hill.\nRepublican senators thought to be opposed to Gaetz because of obstacles to confirmation openly praised the decision he step aside.\n\"I think that was an excellent move on behalf of the incoming president,\" Minority Leader Mitch McConnell said.\n\"I think it was a sound decision. I think it was important,\" said Sen. Lisa Murkowski of Alaska, who had been among those publicly voicing serious concerns.\nAsked if she was relieved, Murkowski said, \"I am. I think it was the right decision.\"\nSen. Mike Rounds of South Dakota, who also had expressed concerns, said withdrawing was the \"right decision to make.\"\n\"There was perhaps some information out there that the president was not aware of when he made the original recommendation. Part of this process is, the information comes out, and then at that point, as people re-evaluate or evaluate, you know, the president or the individual candidate may decide it's not the right time to pursue the nomination,\" Rounds said. \"It may very well have been because of advice from the Senate rather than consent from the Senate.\"\nNot all senators were as open on their views.\n“That’s obviously a decision he came to, and I think everybody had to make a decision that’s good for them and their family. And for whatever reason he decided not to pursue it,\" Sen. John Thune, the incoming Republican leader, said.\nWhen pressed on whether he felt it was the right choice: \"We respect his decision,\" Thune said.\nGaetz has been under scrutiny amid sexual misconduct allegations, including accusations he had sex with a minor, which he's long denied.\nThe House Ethics Committee was in the final stages of its probe into Gaetz when he was tapped to be attorney general, ABC News reported. Fiery debate has transpired on Capitol Hill since then on whether the panel should release its report.\nMany senators said they believed the information that would be in the report would become public during his confirmation hearings before the Senate Judiciary Committee. Sen. John Cornyn, who met with Gaetz on Wednesday, said his hearing had the potential to be \"Kavanaugh on steroids.\"\nSources told ABC News in the last few days it became clear to the Trump team that Gaetz was not going to have enough votes for a Senate confirmation with sources close to the president-elect telling ABC News \"no path to 50\" senators.\nKaroline Leavitt, the spokeswoman for the Trump-Vance transition, said on Thursday Trump \"remains committed to choosing a leader for the Department of Justice who will strongly defend the Constitution and end the weaponization of our justice system.\"\n\"President Trump will announce his new decision when it is made,\" Leavitt said.\nTrump has announced who he intends to install his top defense attorneys to the high-level roles at the Justice Department. Todd Blanche has been picked to be the deputy attorney general and Emil Bove as principal associate deputy attorney general.\nABC News' Will Steakin, Kelsey Walsh, Lalee Ibssa and Mariam Khan contributed to this report.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Hegseth says he's 'cleared' in sex assault case. The police report doesn't say that.", "link": "https://abcnews.go.com/Politics/pete-hegseth-vance-meet-gop-senators-fight-nomination/story?id=116092147", "content": "Trump's Pentagon pick spoke as he met with Senate Republicans on Capitol Hill.\nPresident-elect Donald Trump's controversial pick to be secretary of the Department of Defense, Pete Hegseth, met with Republican senators on Capitol Hill on Thursday amidnew detailsaboutallegations of sexual assault from a 2017 incident-- coming the same day former Republican Rep. Matt Gaetz, facing his own sexual misconduct allegations,withdrew his name from consideration to be Trump's attorney general.\nThe woman who accused Hegseth, a former Fox News host, of sexual assault in 2017told police at the timethat he took her phone and blocked her from leaving the room the night of the incident, according to a 22-page police report obtained by ABC News. Hegseth told police at the time the encounter was consensual.\nOn Thursday, Hegseth responded to a question about the sexual assault claim, saying \"the matter was fully investigated and I was completely cleared and that's where I am going to leave it.\"\nWhile it is true that Hegseth never faced charges in the matter, investigators found the alleged victim's version of events compelling enough to refer the matter to prosecutors. Hegseth later paid the woman who accused him of sexual assaultas part of a settlement agreementwithout admitting any wrongdoing.\nHegseth's comment came after Karoline Leavitt, the spokesperson for the Trump transition, said the \"report corroborates what Mr. Hegseth’s attorneys have said all along: the incident was fully investigated, and no charges were filed because police found the allegations to be false.\" Nowhere in the report does it say the allegations were found to be false.\nHegseth, anArmyveteran, could face a challenging road to confirmation and spoke with Republican senators in hopes of helping his nomination process. Hegseth met with several Republican senators Thursday morning including Sens. John Barrasso, Roger Wicker, Marsha Blackburn and Bill Hagerty.\nAsked if the Hegseth allegations and police report came up in their conversation, Wicker said they didn't get into specifics.\n\"We weren't specific, but, ya know, since no charges were brought by the authorities, we have only press reports,\" Wicker said.\nWicker, the top Republican on the Senate Armed Services Committee -- which will manage the secretary of defense nomination and eventual hearing, said Hegseth would be in \"pretty good shape\" during his confirmation process.\nBarrasso called the former Fox News host a \"strong nominee\" after their meeting.\n\"Pete pledged that the Pentagon will focus on strength and hard power -- not the current administration's woke political agenda,\" Barrasso said.\nRepublican Sen. Joni Ernst said she believes an FBI background check into Hegseth would be \"helpful\" in knowing more about Trump's pick.\nErnst, a combat veteran and member of the Senate Armed Services committee, also said \"there's a lot floating around out there, we need to actually be able to visit with him face to face, and I know the committee will do a thorough vetting.\"\nHegseth has been involved in other controversies as well. He has said in interviews before being named that he advocated a \"frontal assault\" on the DOD, including firing what he called \"woke\" generals and eliminating the Pentagon's diversity goals. He also argued that women shouldn't be allowed in ground combat. although he's okay with their serving as pilots or in other military roles, because he claims that has led to the military's physical standards being lowered and changed capabilities of combat units.\nHegseth's Capitol Hill visit comes just one day afterVice President-elect JD Vance and former Rep. Matt Gaetzmet with senators to make his case for the attorney general role. Gaetz announced Thursday that he iswithdrawing his name from consideration.\nGaetz's meetings with senators took place the same day theHouse Ethics Committee decided against releasing the report into himover allegations of sexual misconduct and illicit drug use.\n-ABC News' Arthur Jones and Sarah Beth Hensley contributed to this report.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Haley skewers Trump picks Gabbard, RFK Jr.", "link": "https://abcnews.go.com/Politics/nikki-haley-republicans-skewer-controversial-trump-nominees/story?id=116096628", "content": "A former Trump Cabinet member, she railed against his choices for DNI, HHS.\nThe sudden withdrawal of former Florida GOP Rep. Matt Gaetz, President-elect Donald Trump's embattled pick for attorney general, amid opposition from Senate Republicans, marks the first major setback for Trump as he fills his Cabinet -- but other high-profile nominees also appear to be facingmounting pushbackfrom members of his own party.\nIn a recent episode of her SiriusXM radio show, Trump's former ambassador to the United Nations, Nikki Haley, skewered Tulsi Gabbard, the president-elect's selection for director of national intelligence, and his choice for health and human services secretary, Robert F. Kennedy Jr. -- blasting both nominees for their foreign policy ideologies.\nSpeaking about Gabbard, Haley said she had \"major issues\" with her being proposed and reiterated comments Gabbard has made in the past that she said run counter to the views of the U.S. intelligence community, including blaming NATO for the invasion of Ukraine and her decision to meet with Syrian dictator Bashar Assad in 2017.\n\"She has defended Russia, she has defended Syria, she has defended Iran, and she has defendedChina,\" Haley said. \"DNI has to analyze real threats. Are we comfortable with someone like that at the top of our national intelligence agencies?\"\nIn presenting her argument, Haley also emphasized various occasions in which Gabbard -- a former Democratic congresswoman who ran for the party's presidential nomination in 2020 before becoming a Republican -- has directly clashed with the president-elect.\n\"She opposed ending the Iran nuclear deal. She opposed sanctions on Iran. She opposed designating the Iran military as terrorists who say death to America every single day,\" Haley said. \"She said that Donald Trump turned the U.S. into Saudi Arabia's prostitute. This is going to be the future head of our national intelligence.\"\nHaley also referencedGabbard'sassertion in a 2020 interview that the Trump administration provided \"no justification whatsoever\" for authorizing the strike that killed Iranian commander Qassem Soleimani, which Gabbard also described at the time as an \"illegal and unconstitutional act of war.\"\n\"She tried to limit Trump's war powers against Iran. She tried to cut our annual defense budget so that we couldn't punish Iran and hinder their influence,\" Haley said.\nSpeaking about Kennedy, Haley said he is \"not a health guy\" but a \"liberal Democrat\" who spent his time in Washington siding with progressive policies while also criticizing his views of U.S. adversaries.\n\"He said he would consider admitting Russia into NATO,\" Haley said, an apparent reference to Kennedy's contention that Moscow should have been admitted to the alliance following the dissolution of the Soviet Union.\nHaley also denounced Kennedy's support for thawing relations with China, which she said could have deleterious implications for American healthcare.\n\"During COVID, we talked about how 90% of our medications were coming from China and how dependent we are. He wants us to deescalate tensions,\" she said.\nHaley was Trump's primary opponent in the content for the GOP's presidential nomination but endorsed him after dropping out of the race in March.\nAfter winning the White House, the president-elect publicly announced he would not invite Haley back to serve in his second administration. But Haley, at least outwardly, has maintained a cordial relationship with Trump and brushed off the snub, insisting she made it clear she had \"no interest in being in his Cabinet.\"\nSources tell ABC News that Gaetz bowed out of what was shaping up to be a futile confirmation battle on Thursday after it became clear to Trump's team that the former Florida lawmaker, who is facing sex trafficking and drug use allegations, had \"no path\" to securing 50 votes in the Republican-led Senate.\nWhile it's not clear that either Gabbard or Kennedy face similarly long odds in the chamber, both have been lambasted by Republicans in recent days.\nFormer Republican Rep. Joe Walsh slammed both candidates during an interview on Sunday.\n\"These people have no business running these departments,\" he said. \"This is like a revenge against Dr. Fauci when it comes to RFK Jr., but Tulsi Gabbard, the best you can say about her is she's a Putin cheerleader. That's the best you can say.\"\nGabbard has also attracted the ire of the \"Wall Street Journal's\" right-leaning editorial board, which said she has \"given no indication across her long political career that she is the right person\" to lead the intelligence community.\nThe Trump-friendly New York Post took aim at both Gabbard and Kennedy, calling the former congresswoman a \"dreadful\" pick and saying \"it's hard to see\" how Kennedy could lead the Department of Health and Human Services to \"practical solutions.\"\nDuring the confirmation process, Republicans are expected to press Kennedy, who switched his party affiliation from Democrat to independent in 2023, on a range of views — including his criticism of vaccines and history of supporting abortion rights.\nBut another controversial nominee, Pete Hegseth, the former Fox News co-host whom Trump has tapped to lead the Pentagon, appears to be gaining GOP support.\nRepublican Sen. Markwayne Mullin of Oklahoma said Hegseth would be a \"perfect\" secretary of defense.\nHegseth has been accused of sexual assault in 2017, and new details about the allegation emerged on Wednesday when a police report on the incident was made public. He has denied all wrongdoing and was never charged with a crime.\nAfter Hegseth met with Republicans on Capitol Hill, several Republicans appeared poised to look past the accusations against him.\n\"Since no charges were brought by the authorities, we have only press reports,\" Sen. Roger Wicker of Mississippi, the ranking Republican on the Armed Services Committee, said.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Can Matt Gaetz return to Congress after withdrawing as AG pick?", "link": "https://abcnews.go.com/Politics/matt-gaetz-return-congress-after-withdrawing-ag-pick/story?id=116108799", "content": "A special election to fill the expected vacancy has not yet been scheduled.\nFormerFloridaRep. Matt Gaetzwithdrewhis bid to serve as attorney general in the next Trump administration, but the question remains: Can he go back to his old job as a member of Congress?\nGaetz, for his part, has only expressed an intent not to take the oath of office for the 119th Congress -- which begins on Jan. 3, 2025, and for which Gaetz won reelection. He cannot preemptively resign from a session of Congress that has not yet convened or that he has not taken an oath to serve in -- that means he is still eligible to serve in the 119th Congress although he cannot under any circumstances withdraw his resignation from the 118th Congress to return to the lame duck session, according toHouse rules.\nThe House clerkread a resignation letter from Gaetzon Nov. 14 -- after President-elect Donald Trump named him as his attorney general pick -- which read: \"I hereby resign as a United States representative for Florida's first congressional district, effective immediately. And I do not intend to take the oath of office for the same office in the 119th Congress to pursue the position of Attorney General in the Trump administration.\"\nIf Gaetz changes his mind and alerts the House clerk that he intends to serve in the 119th Congress, then he could be sworn in since a special election to fill the expected vacancy has not yet been scheduled.\nThe rules of the House of Representatives mandates that at the beginning of the first session of Congress, members must make their presence known to occupy their seat. The rule reads: \"House Rules 2. (a): At the commencement of the first session of each Congress, the Clerk shall call the Members, Delegates and Resident Commissioner to order and proceed to record their presence by States in alphabetical order, either by call of the roll or by use of the electronic voting system.\"\nIf Gaetz or another member does not report to the Capitol to record their presence, that district's seat will be designated vacant.\nThe House rules have very few further specifics. ABC News has an inquiry out to the Office of the Clerk for additional guidance.\nAnd Florida's own election laws seem vague on the issue.\nFlorida elections official Paul Lux, the Okaloosa County Supervisor ofElections, which is within Gaetz's district, told ABC News that he anticipates that the primary for the special election to fill Gaetz's seat once he announced his plans to resign would likely be sometime in February, and the general election would likely be in April -- though he stressed nothing is final until the official dates come out of Florida Gov. Ron DeSantis' office.\nDeSantis, for his part, has yet to formally set a date for that special election.\nABC News has reached out to the Division of Elections in the Florida Department of State to inquire whether the language in Gaetz's letter triggers any sort of automatic vacancy or if there is anything within Florida law that bars him from returning to the 119th Congress. Some Republicans in the district have already declared their intent to run, though one candidate, Joel Rudman, said he would support Gaetz if he wanted to return to Congress.\nGaetz has not publicly said what he plans to do next. His wifeGinger Gaetz posted a photo with him earlier Thursdayon the steps of the Capitol with the caption, \"The end of an era.\"\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Gaetz has withdrawn, but Democrats will keep pushing for release of ethics report", "link": "https://abcnews.go.com/Politics/gaetz-withdrawn-democrats-pushing-release-ethics-report/story?id=116104943", "content": "Casten: \"No workplace would allow that information to be swept under the rug.\"\nEven though former Rep. Matt Gaetz has withdrawn from consideration to be President-elect Donald Trump's attorney general, Illinois Democratic Rep. Sean Casten said Thursday that he'll continue to try to compel the House Ethics Committee to release its report on Gaetz.\n“While I welcome the news that Matt Gaetz is withdrawing from consideration for Attorney General, it remains important that the Gaetz report be made available to the American people,” Castensaid in a statement.\nCasten and Rep. Steve Cohen of Tennessee introduced privileged resolutions on Wednesday to try to force the committee to release the report after the Ethics Committee voted along party lines not to disclose it. Under House rules, once a privileged resolution is introduced, the House must take it up within two legislative days. Republicans have the majority in the House and leadership will decide when the resolution is brought up for a vote. Republicans will attempt to block the effort but it's not yet clear how this could play out.\nIn an interview with ABC News Live on Thursday, Kasten pushed back on accusations that continuing to seek the report's release was partisan. He said a precedent had already been set for Ethics to continue its efforts, pointing to the case of former Democratic Rep. Eric Massa, who resigned from the House in 2010 amid accusations he had groped members of his staff. Despite Massa's resignation, the Ethics Committeevoted to reauthorizeits investigation the following year.\nThe Ethics Committee was investigating allegations that Gaetz engaged in sexual misconduct, illicit drug use, shared inappropriate images or videos on the House floor, misused state identification records, converted campaign funds to personal use, and/or accepted a bribe, improper gratuity, or impermissible gift.\n\"No workplace would allow that information to be swept under the rug simply because someone resigned for office,\" Casten said. \"It matters for the integrity of the law, it matters for the integrity of this House and it matters for the respect that we expect the American people to give us that those of us entrusted with this job will uphold the United States as a land where all are treated equally under the law.\"\nOn Thursday, Cohenposted on Xthat the Ethics Committee will have another chance to release the report when it meets in December. \"I hope they'll do the right thing. But we can't count on it. That's why I introduced a resolution yesterday to force the release of the report,\" he wrote.\nSpeaker Mike Johnson has opposed releasing the report, saying that the Ethics Committee customarily drops its investigations once a member has left Congress. Gaetz resigned last week shortly after Trump announced his intention to nominate him for ABC. Johnson said Thursday the House will take up the resolutions after it returns from its Thanksgiving break.\nHouse Democratic leader Hakeem Jeffries said “Yes” when asked if the report should be public, so it's likely the Democratic caucus will stand behind the efforts to force the report's release.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Mayorkas, Wray draw fire for declining to testify in public at threats hearing", "link": "https://abcnews.go.com/Politics/mayorkas-wray-draw-bipartisan-fire-declining-testify-public/story?id=116099226", "content": "Lawmakers reacted with anger at the homeland security chief and FBI director.\nTop officials from the FBI and Department of Homeland Security on Thursday drew bipartisan fire for declining to testify in public at a Senate hearing on \"worldwide threats\" and instead offering to testify in a classified setting.\nBoth Democrats and Republicans on the Senate Homeland Security Committee expressed anger at what they called Homeland Security Secretary Alejandro Mayorkas and FBI Director Christopher Wray's \"refusal\" to testify in public.\n\"In a shocking departure from the Homeland Security and Governmental Affairs Committee's longstanding tradition of transparency and oversight of the threats facing our nation, for the first time in more than 15 years, the Homeland Security and FBI Director have refused to appear before the Committee to provide public testimony at our annual hearing on Threats to the Homeland,\" Chairman Gary Peters, a Michigan Democrat, said in a statement.\nPeters said it was \"their choice\" to not provide public testimony for the American people.\n\"Americans deserve transparency, public answers about the threats we face,\" Peters said.\nSen. Josh Hawley, a Missouri Republican, went a step further and said he \"looked forward to Director Wray's resignation.\"\n\"This is Mayorkas& Wray giving the middle finger to the American people,\" he tweeted.\nWhile it wasn't immediately clear specifically why they declined to testify in public, a Homeland Security spokesperson said in a statement that Mayorkas has appeared before Congress more than 30 times.\n\"DHS and the FBI have offered to the Committee a classified briefing to discuss the threats to the Homeland in detail, providing the Committee with the information it needs to conduct its work in the months ahead,\" a the spokesperson said in a statement. \"DHS and the FBI already have shared with the Committee and other Committees, and with the American public, extensive unclassified information about the current threat environment, including the recently published Homeland Threat Assessment.\"\nThe FBI said in a statement they've \"repeatedly\" showed their commitment to being transparent with the American people.\n\"We remain committed to sharing information about the continuously evolving threat environment facing our nation and the extraordinary work the men and women of the FBI are doing -- here at home and around the world -- to protect the American people and uphold the Constitution of theUnited States,\" according to an FBI statement. \"FBI leaders have testified extensively in public settings about the current threat environment and believe the Committee would benefit most from further substantive discussions and additional information that can only be provided in a classified setting.\"\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Trump team has a message for Republicans who may oppose his Cabinet picks", "link": "https://abcnews.go.com/Politics/trump-team-warns-republicans-support-cabinet-picks-face/story?id=116094924", "content": "Trump's recess appointments demand seems to be meeting resistance with senators.\nAs controversy continues to cloud some of President-elect Donald Trump's Cabinet picks, his team has an ominous warning for Republicans who don't fall in linebehind his nominees.\nABC News Chief Washington Correspondent Jonathan Karl reports that one senior Trump adviser said the message to lawmakers is, \"If you are on the wrong side of the vote, you're buying yourself a primary.\"\n\"That is all,\" the adviser told Karl. \"And there's a guy named Elon Musk who is going to finance it.\"\n\"The president gets to decide his Cabinet. No one else,\" the adviser added.\nThe threat came as Matt Gaetz and Pete Hegseth (tapped for attorney general and defense secretary, respectively)made the rounds on Capitol Hillthis week to shore up support. They were escorted by Vice President-elect JD Vance, the junior senator from Ohio.\nGaetz announced Thursday afternoon he waswithdrawing his name from consideration, stating his confirmation bid was \"unfairly becoming a distraction.\"\nGaetz faces allegations of sexual misconduct and illicit drug use, which he's long denied, that was the subject of a federal investigation and a House Ethics Committee probe. Hegseth has been accused of sexual assaulting a woman in 2017, an encounter Hegseth told police was consensual.\nTrump stood firm with the selections, which also raised eyebrows for their relative lack of experience to lead the Department of Justice and the Department of Defense. Trump said it was ultimately Gaetz's choice to withdraw.\nSome of the president-elect's other picks have similarly faced scrutiny over their qualifications, includingTulsi Gabbard for director of national intelligenceor Robert F. Kennedy Jr. for secretary of Health and Human Services.\nTrump previously made a demand for Republican leadership to back so-called \"recess appointments\" to skirt the traditional confirmation process. That route would require lawmakers to adjourn and for senators to give up the \"advice and consent\" role they play in nominations, as laid out in the Constitution.\nBut his demand is being met with some resistance from some Senate Republicans.\nSen. Thom Tillis, a senior Republican and member of the Senate Judiciary Committee, said recess appointments for Cabinet posts should be \"absolutely off the table.\"\n\"And quite honestly, any serious candidate for Cabinet-level position, I would really have to wonder if they would want it or be willing to accept it under a recess,\" Tillis said. \"These positions are too important. They carry too much weight internationally to take a short cut.\"\nSeveral senators have said they want the full \"process\" and vetting of candidates to play out.\nSen. Josh Hawley said on Wednesday his intention is to vote for all nominees.\n\"The Constitution gives us a role in personnel called advice and consent. My view is that's exactly what will unfold here when these nominees are actually sent forward, and we'll treat them like we've treated all others with the proper vetting,\" said longtime Senate Republican Leader Mitch McConnell, who recently stepped down from the role.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Tulsi Gabbard, Trump’s pick for top intel role, draws scrutiny over Russia comments", "link": "https://abcnews.go.com/Politics/tulsi-gabbard-trumps-pick-top-intel-role-draws/story?id=116058687", "content": "Critics say her echoing of Russian propaganda should be disqualifying.\nPresident-elect Donald Trump's pick for the director of national intelligence, former Rep. Tulsi Gabbard, has little experience working with the nation's spy agencies and a long track record of echoing the Russian disinformation they work to expose and to counter -- a combination her critics claim should be disqualifying.\nGabbard, 43, who represented Hawaii as a Democrat from 2013-2021 and ran for the party's presidential nomination in 2020 before becoming a Republican earlier this year, has been accused of harboring sympathies for the Kremlin and parroting propaganda generated by Russia to justify its invasion of Ukraine.\nAt the outset of the conflict, Gabbard blamed the Biden administration and NATO, claiming they had provoked Russia's aggression by ignoring what she called its \"legitimate security concerns\" about Ukraine potentially becoming a member of the defensive alliance.\nIn March 2022, Gabbard posted a video to Twitter, now X, sharing what she said were \"undeniable facts\" about U.S.-funded biolabs in the war-torn country, claiming that \"even in the best of circumstances\" they \"could easily be compromised.\"\n\"Instead of trying to cover this up, the Biden-Harris administration needs to work with Russia, Ukraine, NATO, the U.N. to immediately implement a ceasefire for all military action in the vicinity of these labs until they're secured,\" she said.\nAbout the same time, a commentator on Kremlin state media referred to her as \"Russia's girlfriend\" and her comments have been featured on the country's state-run TV programs, along with those of Tucker Carlson, an outspoken critic of U.S. involvement with Ukraine.\nGabbard's claims closely mirror a false, decade-old Russian conspiracy theory that Washington is secretly funding the development of biological weapons in former Soviet countries, which has been repeatedly debunked by the U.S. and international organizations.\nAlthough she later claimed her comments were about public health research labs in the conflict zone, she also expressed concerns that Ukraine was in possession of biological weapons during an interview with former Fox News host Carlson a few days before taking to social media.\nDemocrats and opponents of the president-elect were quick to condemn Trump's choice of Gabbard -- who appeared regularly with him in the final months of his campaign.\n\"You really want her to have all the secrets of the United States and our defense intelligence agencies when she has so clearly been in Putin's pocket?\" Sen. Elizabeth Warren, a Massachusetts Democrat, pressed during a recent interview.\n\"Her judgment is non-existent,\" Trump's former national security adviser John Bolton, now a fierce Trump critic, asserted on Sunday on CNN.\n\"The idea that somehow she would be put in charge of this critical function should be giving our adversaries in Moscow and Beijing a lot of relief,\" he continued.\nNikki Haley, the president-elect's most significant challenger in the 2024 Republican primaries and his envoy to the United Nation's during his first term in the White House, also slammed Gabbard -- declaring that director of national intelligence was \"not a place for a Russian, Iranian, Syrian, Chinese sympathizer.\"\n\"DNI has to analyze real threats. Are we comfortable with someone like that at the top of our intelligence agencies?\" Haley said on her SiriusXM radio show, \"Nikki Haley Live.\"\nHaley also emphasized the stark differences between Gabbard and Trump on foreign policy matters.\n\"She opposed ending the Iran nuclear deal. She opposed sanctions on Iran. She opposed designating the Iran military as terrorists who say death to America every single day,\" Haley said. \"She said that Donald Trump turned the U.S. into Saudi Arabia's prostitute. This is going to be the future head of our national intelligence.\"\nBut in their criticisms of Gabbard, some Democrats have made their own unfounded claims.\nFlorida Democrat Rep. Debbie Wasserman Schultz sparked backlash after she claimed Gabbard was a \"Russian asset\" that would \"essentially would be a direct line to our enemies\" in a television appearance on Friday.\nIn 2019, Hillary Clinton suggested, without offering any evidence, that the Russians were \"grooming\" Gabbard to run as a third-party candidate for president in order to spoil Democrat's chances of winning the White House. Gabbard refuted the allegations and sued Clinton for defamation, but later dropped her compliant.\nIn an interview with Fox News following her being named, Gabbard said that some of her former Democratic colleagues had reached out to her in what she hoped \"could be and should be an effort for us to work together.\"\n\"I'm actually pretty heartened,\" Gabbard said.\nIn a statement announcing he had tapped her to lead the intelligence community, Trump lauded what described as \"broad support in both Parties\" for Gabbard.\n\"I know Tulsi will bring the fearless spirit that has defined her illustrious career to our Intelligence Community, championing our Constitutional Rights, and securing Peace through Strength,\" Trump posted on his social media platform. \"Tulsi will make us all proud!\"\nIf Gabbard ultimately becomes the director of national intelligence, she will oversee 18 U.S. intelligence agencies and play a critical role in determining what material is including in the president's daily intelligence briefings.\nShe is expected to face a confirmation battle in the Senate, but some hawkish Republicans in the chamber have expressed tepid support for her nomination.\n\"While we have differences on foreign policy, I think she's extremely bright and capable,\" South Carolina GOP Sen. Lindsey Graham said in an X post on Wednesday.\nGabbard has taken other controversial stances on foreign policy matters. In 2017, she journeyed to Syria to meet with its authoritarian leader Bashar al-Assad, whose government has carried out numerous deadly attacks on Syrian civilians through the course of the country's civil war, according to the U.N.\nThe then-congresswoman said after meeting with al-Assad that he was not an enemy of the U.S. and opposed American intervention in the conflict.\nIn 2015, Gabbard also defended Russian airstrikes in Syria conducted at the request of the Assad regime, echoing Moscow's claim that the operation was focused on terrorist targets when in reality it focused on Syrian opposition strongholds.\nGabbard has taken a much softer approach to China than the president-elect, calling on Trump to end his trade war against Beijing in 2019 and expressing her opposition to the remilitarization of Japan, a response to the strategic challenge posed by China.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Project 2025 seeps into Trump administration despite attempts to distance himself", "link": "https://abcnews.go.com/Politics/trump-project-2025-administration/story?id=116019369", "content": "Trump has nominated several Project 2025 contributors to his team.\nPresident-elect Donald Trump distanced himself fromProject 2025on the campaign trail but has sincenominated several authors or contributorsfrom the controversial conservative presidential wishlist to his administration.\nTrump called the Project 2025 policy proposals -- which include restrictions on abortion pills, birth control pills and Medicare access, as well as eliminating a couple of federal agencies -- \"extreme, seriously extreme\" in a July 20 rally.\n\"I don't know anything about it. I don't want to know anything about it,\" he previously said, despite having many connections to its authors and contributors.\nDemocrats pounced on Trump for Project 2025 during the election season, calling it a warning of what is to come under a second Trump term.\n\"Project 2025 is the plan by Donald Trump's MAGA Republican allies to give Trump more power over your daily life, gut democratic checks and balances, and consolidate power in the Oval Office if he wins,\" the Biden campaign stated.\nProject 2025 is an over 900-page playbook of policy proposals created by conservative think tank The Heritage Foundation intended to guide the next conservative administration. The organization behind the document told ABC News in a past statement that it was not intended to speak for any candidate during the election.\nProject 2025 and Trump's Agenda47 share similarities -- including proposals to eliminate the Department of Education, increase fossil fuel energy production, and begin mass deportations.\nAt the ABC News debate with Vice President Kamala Harris, Trump reiterated his earlier sentiment on the project. \"This was a group of people that got together, they came up with some ideas, I guess some good, some bad, but it makes no difference. I have nothing to do [with it].\"\nNow, several Project 2025 authors and contributors are not just connected to Trump, but also nominated for roles in his administration.\nRuss Vought, who authored a chapter on \"Executive Office of the President\" for Project 2025's \"Mandate for Leadership: The Conservative Promise,\" is also under consideration for a cabinet-level position in the next administration and has been vetted by Trump's transition team, sourcestold ABC News.He was also the RNC platform committee's policy director.\nHere's a look at which Project 2025 contributors may have a place in the incoming Trump administration:\nBrendan Carr, Trump's nomination for chairman of the Federal Communications Commission, is credited as the author of Project 2025's FCC recommendations which include: a ban on TikTok, restrictions on social media moderation, and more.\nCarr would be tasked with regulating broadcasting, telecommunications and broadband. Trump has suggestedthat he would expandthe White House's influence over the FCC and potentially punish TV networks that cover him in a way he doesn't like.\nCarr is a longtime member of the commission and served previously as the FCC's general counsel and as the senior Republican for the FCC. He has been unanimously confirmed by the Senate three times and was nominated by both Trump and President Joe Biden to the commission.\nRatcliffe, listed as a contributor who assisted \"in the development and writing\" of Project 2025, has been nominated to serve as the Director of the Central Intelligence Agency.\nRatcliffeis a three-term Republican congressmanfrom Texas and served as the director of national intelligence from mid-2020 until the end of Trump's first term.\nProject 2025's Intelligence Community chapter, credited to The Heritage Foundation's intelligence research fellow Dustin J. Carmack, notes that the \"CIA's success depends on firm direction from the President and solid internal CIA Director–appointed leadership. Decisive senior leaders must commit to carrying out the President's agenda and be willing to take calculated risks.\"\nFormer Immigration and Customs Enforcement Director Tom Homan has been designated as Trump's \"border czar\" -- which is not an official Cabinet position.\nHoman, who is expectedto be in charge of the mass deportationspromised by the Trump campaign, is listed as a contributor to Project 2025 who assisted in its \"development and writing.\"\nProject 2025's Department of Homeland Security chapter, credited to Trump's former Acting Deputy Secretary of Homeland Security Ken Cuccinelli, calls for full use of ICE's \"expedited removal\" authority and further development of immigrant detention spaces. This all aligns with Trump'simmigration proposals on mass deportationsand funds forthe construction of detention centers.\nChristopher Miller is credited with the project's Department of Defense recommendations. Miller served as Acting Secretary of Defense and Special Assistant to the President under Trump from November 2020 to January 2021.\nBen Carson is credited with the project's Housing and Urban Development recommendations. He served as the Secretary of HUD under Trump's first administration.\nAdam Candeub is credited with the project's Federal Trade Commission recommendations. He served under the Trump administration as Acting Assistant Secretary of Commerce for Telecommunications and Information.\nBernard L. McNamee is credited with recommendations on the Department of Energy and Related Commissions. He was nominated to the Federal Energy Regulatory Commission by Trump in October 2018.\nCuccinelli -- who wrote the Department of Homeland Security section -- was also part of Trump's former administration as the Acting Deputy Secretary of Homeland Security.\nThe RNC platform committee's Deputy Policy Director Ed Martin is also president of the Eagle Forum Education& Legal Defense Fund, which is listed on the project's advisory board.\nOthers connected to Trump, including Trump's United Nations Commission on the Status of Women appointee Lisa Correnti, are listed among the contributors.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Linda McMahon's professional qualifications as Trump's choice for Dept. of Education", "link": "https://abcnews.go.com/Politics/linda-mcmahons-background-trumps-pick-education-secretary/story?id=116058197", "content": "Her nomination has come under scrutiny this week.\nLinda McMahon's background -- in both education and as a co-founder of sports entertainment company World Wrestling Entertainment, Inc. -- has come under scrutiny since President-elect Donald Trump named her as hispick to lead the Department of Educationon Tuesday.\nMcMahon is a longtime ally of Trump who served as his transition co-chair and the former head of the U.S. Small Business Administration.\nThough she is primarily known for founding and leading the WWE, she has had several stints in education -- starting with her nomination to the Connecticut State Board of Education in 2009.\nAt the confirmation hearing in 2009, she said education was her passion and that her work as CEO of the WWE taught her \"firsthand the skills Connecticut students need to obtain through education to be successful.\"\nShe said that youth-oriented programs at WWE -- such as the GET R.E.A.L. Program, which brought WWE stars into schools to teach students messages about \"Respect, Education, Achievement and Leadership\" -- were examples of her past educational pursuits.\nHowever, McMahon had written on her board application that she had a degree in education, even though her degree from East Carolina University was in French, according tolocal reportsfrom that period. Her spokesman at the time called it an \"honest mistake\" in the Connecticut Post.\nRegardless, McMahon stepped down from her post on the Connecticut State Board of Education -- and her position as CEO of WWE -- shortly after, in 2010, to run for the U.S. Senate as a Republican.\nOn her 2010 campaign website, she signaled support for \"competition and choice through charter schools\" and \"secondary school reform\" -- a position that is reflected in her views today.\n\"I believe in local control. I am an advocate for choice through charter schools,\" her campaign website at the time stated.\nShe lost that race, as well as her second attempt in 2012.\nOther forays into education included her role as a member of the board of trustees for Sacred Heart University. She was on the board from January 2004 to February 2017. She returned after serving in Trumps first administration, in 2021.\nMcMahon also co-founded the conservative research group America First Policy Institute in April 2021, which says its mission is to \"provide sound research and carefully crafted policy recommendations to advance the America First agenda,\" according to a press release.\nDuring that time, McMahon vouched to expand Pell Grant access for short-term workforce training programs.\n“The country is facing a historic labor shortage, and a multiyear degree program is not necessary for many Americans to obtain high-paying, fulfilling careers,\" said McMahon.\nWhile announcing her as his choice as secretary of education, Trump said McMahon \"will fight tirelessly to expand 'Choice' to every State in America.\"\nThe nomination was criticized by the National Education Association, which argued that her \"only mission is to eliminate the Department of Education and take away taxpayer dollars from public schools, where 90% of students -- and 95% of students with disabilities -- learn, and give them to unaccountable and discriminatory private schools.\"\nAccording to his Agenda47 policy platform, Trump's top education priorities do include eliminating the Department of Education. They also include expanding school voucher programs and giving more power to parents in classrooms.\nSchool \"choice\" has been a key proponent of conservative education policy in recent years, aiming to expand \"education savings\" policies so that families can redirect public school funding toward private schools or homeschooling.\nArizona passed the country’s first of such program in 2011, and at least eight other states have followed its lead: Arkansas, Florida, Iowa, North Carolina, Ohio, Oklahoma, Utah and West Virginia.\nHowever, voters in three states -- Nebraska, Kentucky and Colorado -- rejected efforts to codify or expand this kind of program.\nAs head of the Department of Education, McMahon would oversee federal policies impacting millions of students in the U.S.\nFor example, the department investigates the handling of sexual misconduct allegations under Title IX.\nAt the same time, McMahon's nomination comes as she and her husband Vince, co-founders of WWE, are facing allegations that they created a culture of tolerating and fostering the alleged sexual abuse against underage “ring boys.”\n“Linda McMahon was in the thick of it, acting as Vince’s wife, confidante, co-leader in running the business, and the leader in trying to conceal the sordid underbelly of WWE’s sexual abuse culture,” according tothe current lawsuit.\nABC News reached out to both Trump's and McMahon's teams for comment.\n\"This civil lawsuit based upon thirty-plus year-old allegations is filled with scurrilous lies, exaggerations, and misrepresentations,\" said McMahon's lawyer in a statement to ABC News. \"The matter at the time was investigated by company attorneys and the FBI, which found no grounds to continue the investigation.\"\n\"Ms. McMahon will vigorously defend against this baseless lawsuit and without doubt ultimately succeed,\" the statement continued.\nOn Wednesday, McMahon accepted the president-elect’s nomination and said she is \"hopeful\" for Senate confirmation, which is a requirement of the role,in a post on X.\nMcMahon wrote, “I look forward to working collaboratively with students -- educators -- parents and communities to strengthen our educational system; ensuring every child regardless of their demographics is prepared for a bright future.\"\nShe added: \"Thank you for this extraordinary opportunity. I am ready to Serve!\"\nT. Michelle Murphy contributed to this report.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "'Kavanaugh on steroids': Gaetz, Vance meet with GOP senators amid questions", "link": "https://abcnews.go.com/Politics/gaetz-vance-meet-senators-ahead-house-ethics-committee/story?id=116048837", "content": "Sen. Graham said that Gaetz deserves a fair nomination process.\nFormer Rep. Matt Gaetz, President-elect Donald Trump's pick to be attorney general, met with Republican senators on Capitol Hill Wednesday morning alongside Vice President-elect JD Vance, making his case for the job hours before the House Ethics Committee discussed its report on him,ultimately deciding against releasing its report.\nSeveral senators hadcalled for the House Ethics Committee to release its report into Gaetzoverallegations of sexual misconduct and illicit drug usebefore they would consider his confirmation.\nThe House Ethics Committee on Wednesday voted against releasing its report on Gaetz after multiple rounds of votes, a source familiar tells ABC News.\nAfter Trump announced Gaetz as his attorney general pick, the Florida congressman resigned from the House, meaning the House Ethics Committee no longer has the jurisdiction to continue its investigation into him -- however Republicans and Democrats had argued whether a break in that precedent was necessary for the Senate to perform its constitutional duty to advise and consent to presidential nominations.\nThe Justice Department also spent years probing sexual misconduct allegations against Gaetz, as well as allegations of obstruction of justice, before informing Gaetz last year that it would not bring charges. Gaetz has long denied any wrongdoing related to the allegations investigated during the congressional and Justice Department probes.\nRepublican Sens. Josh Hawley, Lindsey Graham, Mike Lee, Marsha Blackburn, John Kennedy and John Cornyn met with Vance and Gaetz on Wednesday.\nThe former congressman said the meetings have \"been going great.\"\n\"Senators have been giving me a lot of good advice. I'm looking forward to a hearing. Folks have been very supportive, and they've been saying we are going to get a fair process so it's a great day of momentum for the Trump-Vance administration,\" Gaetz said.\nGaetz said he hasn't spoken to Trump on Wednesday, \"But I had a great time with the vice president-elect talking about how we are going to end weaponization at the Department of Justice, we are going to tackle fentanyl, we are going to ensure that we don't have the DOJ involved in censorship anymore, and make sure that we have the country back on track and are there for President Trump's total fulfillment of his promise on his immigration agenda.\"\nAsked if he was confident he could be confirmed, Gaetz replied, \"It was a great day.\"\nWhen asked how messy Gaetz's confirmation hearing could become, Sen. Cornyn joked to reporters it could be \"Kavanaugh on steroids\" -- a reference to the now-U.S. Supreme Court justice'scontentious confirmation hearings in 2018.\n\"He's a smart guy,\" Cornyn added. \"I'm sure he realizes that.\"\nSen. Graham told reporters that the meeting went well and that Gaetz deserves a fair nomination process.\n\"Here's what I told him, no rubber stamps and no lynch mob. I'm not going to be part of a process that leaks information that shouldn't be leaked,\" Graham said. \"I'm not going to legitimize the process to destroy the man because people don't like his politics. He will be held to account in the confirmation process. He deserves a chance to make his argument why he should be attorney general.\"\nHawley defended Gaetz's nomination.\n\"My intention is to vote for all the president's nominees,\" Hawley said. \"I think for my colleagues who are -- who have concerns about the Attorney General nominee, my message would be, well, let's have a hearing on this. You can ask whatever -- if you're a member of the committee, you can ask whatever question you want, give Gaetz the opportunity to answer questions, lay out his vision, answer concerns.\"\nHawley said Gaetz understands his job, if confirmed, is to \"serve at the pleasure of the president.\"\n\"You gotta remember that cabinet secretary is not an exercise in individuality. I mean, you're there to serve at the pleasure of the president. That's the job, and he has a sense of what the president wants to do in terms of prioritizing law enforcement, getting the department out of the business of political prosecutions. So he wants a chance to lay that out,\" Hawley said.\nDemocrats on the Senate Judiciary Committee wrote to FBI Director Christopher Wray on Wednesday to request the complete evidentiary file in the bureau's closed investigation into Gaetz. Included in the ask is a request for forms that memorialize interviews conducted as part of the investigation.\nThe Democrats argued in the letter that there is precedent for the FBI providing these sorts of documents to Congress, including instances when Republicans obtained these documents.\nAs Vance and Gaetz met with senators, Trump attempted to blame Democrats for the allegations launched against some of his controversial Cabinet picks.\n\"They dirty them up, they destroy them, and then they spit them out. They are trying that right now with some great American Patriots who are only trying to fix the mess that the Democrats have made of our Country,\" Trumpposted on his social media platform Wednesday afternoon.\nABC News' Will Steakin, John Parkinson, Lauren Peller, Jay O'Brien and Chris Boccia contributed to this report.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Democrats try to force Ethics Committee to release Gaetz report", "link": "https://abcnews.go.com/Politics/ethics-committee-meet-clear-vote-gaetz-report-agenda/story?id=116019033", "content": "Ethics Committee Republicans had earlier blocked the release of the report.\nAfter members of the House Ethics Committee deadlocked along party lines whether to release its report on former Rep. Matt Gaetz, two Democrats introduced privileged resolutions to make the report public.\nReps. Steve Cohen of Tennessee and Sean Casten of Illinois introduced resolutions to try to force the committee to release the report. Under House rules, once a privileged resolution is introduced, the House must take it up within two legislative days. Republicans have the majority in the House and leadership will decide when the resolution is brought up for a vote. Republicans will attempt to block the effort but it's not yet clear how this could play out.\nThe Ethics Committee was investigating allegations that Gaetz engaged in sexual misconduct, illicit drug use, shared inappropriate images or videos on the House floor, misused state identification records, converted campaign funds to personal use, and/or accepted a bribe, improper gratuity, or impermissible gift.\nGaetz resigned from Congress last week after President-elect Donald Trump announced he planned to nominate Gaetz to be his attorney general. The Ethics Committee generally drops investigations of members if they leave office, but Republicans and Democrats have argued whether to break that precedent to allow the Senate to perform its role of vetting presidential nominations.\nEarlier Wednesday, the committee voted against releasing the report after multiple rounds of votes, a source told ABC News, with all Republicans on the committee voting against its release.\nRepublican Rep. Michael Guest, the committee chairman, told reporters, “There was not an agreement to release the report,” as he left the meeting.\nBut Rep. Susan Wild, the top Democrat on the committee, disagreed with Guest’s characterization, saying “There was no consensus on the issue.”\n“The chairman has since betrayed the process by disclosing our deliberations within moments after walking out of the committee, and he has implied that there was an agreement of the committee not to disclose the report. That is untrue -- to the extent that suggests that the committee was in agreement or that we had a consensus on that, that is inaccurate,” Wild said.\nWild said “a vote was taken” and suggested it was tied, implying no Republicans crossed party lines. There are five Republicans and five Democrats on the committee.\n“We often vote unanimously. That did not happen with this vote. And I do not want the American public or anyone else to think that Mr. Guest's characterization of what transpired today would be some sort of indication that the committee had unanimity or consensus on this issue not to release the report. That would be an inaccurate portrayal,” she said.\nSources said the committee will complete the report and take it up again in December. Other committee members refused to answer questions.,Gaetz, who along with Vice President-elect JD Vance had beenmeeting with Republican senatorson his nomination, said he hasn't been following developments in the Ethics Committee.\n\"I'll be honest with you I've been focused on what we've got to do to reform the Department of Justice. I've been meeting with senators. I haven't been paying much attention to that,\" Gaetz said.\nGeorge Santos, the former congressman expelled after the Ethics Committee found he violated House rules, made a surprise appearance at the Capitol, telling reporters the investigation into his former colleague was a \"political hit piece.\"\nSantos later pleaded guilty to wire fraud and aggravated identity theft. Asked if he was seeking a pardon, Santos said it was \"not a question, a conversation I've had...I am not entertaining that conversation.\"\nHe also said he had no plans to run for Congress again.\nOn April 9, 2021, the secretive panel announced it had initiated a review into allegations that Gaetz “may have engaged in sexual misconduct and/or illicit drug use, shared inappropriate images or videos on the House floor, misused state identification records, converted campaign funds to personal use, and/or accepted a bribe, improper gratuity, or impermissible gift, in violation of House Rules, laws, or other standards of conduct.”\nThe committee spoke with more than a dozen witnesses, issued at least 25 subpoenas and reviewed thousands of pages of documents in its investigation of Gaetz.\nHouse Ethics initially deferred its consideration of the matter in response to a request from the Department of Justice, which conducted its own multiple-year sex-trafficking probe into the four-term congressman.\nIn February 2023, DOJ informed lawyers representing witnesses that it would not bring charges against Gaetz.\nGaetz blamed former House Speaker Kevin McCarthy when the Ethics Committee reauthorized its investigation in May 2023 after the Department of Justice had withdrawn its deferral request. Gaetz then successfully led the charge to oust McCarthy as speaker.\nThis June, the committee announced it was still investigating whether Gaetz had “engaged in sexual misconduct and illicit drug use, accepted improper gifts, dispensed special privileges and favors to individuals with whom he had a personal relationship, and sought to obstruct government investigations of his conduct.”\nBut it announced it would take “no further action” on the allegations that he may have shared inappropriate images or videos on the House floor, misused state identification records, converted campaign funds to personal use, and/or accepted a bribe or improper gratuity.\nThe House Ethics Committee had nearly completed the inquiry before Gaetz abruptly resigned last week after Trump announced he had selected Gaetz as his attorney general nominee.\nThe committee generally drops investigations of House members if they leave office but Republicans and Democrats have argued whether a break in that precedent is necessary for the Senate to perform its constitutional duty to advise and consent to presidential nominations.\nWhile the clearest above-water path for the report’s release is by agreeing to a majority vote by the Ethics Committee, there is also speculation that any single member could offer a privileged resolution on the House floor to force an up-or-down vote on its disclosure.\nEthics Committee Chairman Michael Guest, R-Miss, has been tight-lipped about the meeting agenda on Wednesday but said he has read the Gaetz report.\nWild told reporters on Monday that the report should be disclosed to the public and said Wednesday that her position had not changed.\n“You either are going to disclose it or you're not going to disclose it. So, and there's plenty of precedents in the Ethics Committee to disclose the report even after a member has resigned,” Wild said Monday.\nJohnson has made clear that he believes the committee should not release an investigative report on a former member of Congress.\n“My job is to protect the institution, and I have made very clear that I think it’s an important guardrail for our institution that we not use the House Ethics Committee to investigate and report on persons who are not members of this body,” Johnson told reporters at the Capitol on Tuesday.\nMeanwhile, during a press conference on Tuesday, House Minority Leader Hakeem Jeffries answered “Yes” when asked if the report should be released.\nThe five Republicans on the committee are: Chairman Guest of Mississippi, David Joyce of Ohio, John Rutherford of Florida, Andrew Garbarino of New York and Michelle Fischbach of Minnesota.\nThe five Democrats are: Wild of Pennsylvania, Veronica Escobar of Texas, Mark DeSaulnier of California, Deborah Ross of North Carolina and Glenn Ivey of Maryland.\n-ABC News' Chris Boccia contributed to this report.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Transgender women won't be allowed to use women’s restrooms in Capitol: Johnson", "link": "https://abcnews.go.com/Politics/speaker-johnson-transgender-women-allowed-womens-restrooms-capitol/story?id=116053769", "content": "This also applies to changing rooms and locker rooms, Johnson said.\nHouse Speaker Mike Johnson said transgender women cannot use women's restrooms in the Capitol and House office buildings. This also applies to changing rooms and locker rooms, Johnson said.\n\"All single-sex facilities in the Capitol and House Office Buildings — such as restrooms, changing rooms, and locker rooms — are reserved for individuals of that biological sex,\" the statement said Wednesday.\nJohnson continued, \"It is important to note that each Member office has its own private restroom, and unisex restrooms are available throughout the Capitol.\"\nAfter winning her election earlier this month to be Delaware's sole representative in the House, Rep.-elect Sarah McBride will be the first openly trans member of Congress.\nMcBride responded to Johnson Wednesday by saying, \"I’m not here to fight about bathrooms. I’m here to fight for Delawareans and to bring down costs facing families. Like all members, I will follow the rules as outlined by Speaker Johnson, even if I disagree with them.\"\nIt's unclear what will happen with South CarolinaGOP Rep. Nancy Mace's billthat would ban transgender women from using women's restrooms in the Capitol, but she celebrated the speaker's decision as a victory for women's rights.\n\"I am proud to be a woman, and today, women won,\" Mace said. \"And I'm not going to stop there. I have another bill that I've drafted, and I will file it when we get back in December -- if you're a federally funded educational institution, school, etcetera, women have to be protected, too, in private spaces. So this is just the start.\"\nDemocratic Rep. Alexandria Ocasio-Cortez called the decision \"disgusting.\"\n\"Because if you ask them, 'What is your plan on how to enforce this?' they won't come up with an answer. And what it inevitably results in are women and girls who are primed for assault because they want, because people are going to want to check their private parts in suspecting who is trans and who is cis and who's doing what,\" she said.\nMace had said earlier that her bill she introduced was \"absolutely\" in response to McBride entering Congress.\n\"Yes, and absolutely. And then some,\" Mace told reporters at the Capitol. \"I'm not going to stand for a man, you know, someone with a penis, in the women's locker room,\" she said.\nAsked by ABC News on Wednesday if she had met with McBride over the issue, Mace said she had not.\n\"She doesn't get a say in this. This is about women's rights, and at some point we have to draw a line in the sand,\" Mace said. \"I'm somebody who's very socially sensible. I voted for gay marriage, not once, but twice.\"\n\"He was born a biological male,\" she said of McBride. \"It's not -- I'm not into pronouns. I don't care. I try to be as respectful as I can. I'll even work with with him or her on legislation. I work with anyone who's willing to work with me, but I'm not going to play into this gender ideology, this wackadoo lunatic, crazy thing that men want to force on women.\"\nIn terms of how Johnson plans to enforce this policy is not entirely clear, but the speaker has \"general control\" of facilities, according to House rules.\n\"This effort to distract from the real issues facing this country hasn't distracted me over the last several days, as I've remained hard at work preparing to represent the greatest state in the union come January,\" McBride said in a statement Wednesday.\nIn response to Mace, McBride has received support from House Minority Leader Hakeem Jeffries and the Democratic Women's Caucus.\n\"Instead of focusing on lowering costs and real solutions to improve the health and safety of women and families, Republicans are cruelly attacking our new Member to distract from their inability to govern. We won't stand for it,\" a post from the women's caucus read on X.\nJeffries said Republicans are bullying McBride.\n\"This incoming, small, House Republican Conference majority is beginning to transition to the new Congress by bullying a member of Congress,\" Jeffries said Tuesday. \"This is what we're doing? This is the lesson that you've drawn from the election in November? This is your priority, that you want to bully a member of Congress, as opposed to welcoming her to join this body so that all of us can work together to get things done and deliver real results for the American people?\"\nABC News' Isabella Murray, John Parkinson and Chris Boccia contributed to this report.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Biden awards Medal of Freedom to former Planned Parenthood President Cecile Richards", "link": "https://abcnews.go.com/Politics/biden-awards-medal-freedom-former-planned-parenthood-president/story?id=116067740", "content": "The Presidential Medal of Freedom is the nation's highest civilian honor.\nPresident Joe Biden on Wednesday awarded the Presidential Medal of Freedom to former Planned Parenthood president Cecile Richards at a private ceremony, the White House said.\nRichards, the daughter of the late Texas Gov. Ann Richards, left the reproductive health care organization in 2018 after leading it for 12 years. Earlier this year, Richards revealed she was battling glioblastoma, an aggressive form of brain cancer – the same that killed Biden’s son Beau.\nBidenposted on Xthat it was his \"honor\" to award Cecile Richards the Medal of Freedom, and shared a photo of him, first lady Jill Biden, Richards and Richards's husband, Kirk Adams.\nThe following commendation praising Richards’s work was delivered at the ceremony, the White House said.\n\"Carrying her parents’ torch for justice, she’s led some of our Nation’s most important civil rights causes - to lift up the dignity of workers, defend and advance women’s reproductive rights and equality, and mobilize Americans to exercise their power to vote,\" the commendation stated. \"A leader of utmost character, she has carved an inspiring legacy that endures in her incredible family, the countless lives she has made better, and a Nation seeking the light of equality, justice, and freedom.”\nThe Presidential Medal of Honor is the nation's highest civilian honor. At a White House ceremony in the spring, Bidenawarded the honor to 19 Americans, including former Speaker of the House Nancy Pelosi, former Vice President Al Gore, Olympic swimmer Katie Ledecky and Oscar-winning actress Michelle Yeoh.\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Pentagon chief Austin makes impassioned defense of women in combat", "link": "https://abcnews.go.com/Politics/pentagon-chief-lloyd-austin-makes-impassioned-defense-women/story?id=116058146", "content": "The comments follow Trump tapping Pete Hegseth to lead the DOD.\nDefense Secretary Lloyd Austin gave an impassioned defense of women in combat on Tuesday following Pete Hegseth, President-elect Donald Trump's pick to lead the Department of Defense, arguing that the United States \"should not have women in combat roles.\"\n\"I don't know the potential nominee, so I can't comment on and won't comment on anything that he said,\" Austin, who was asked about the comments made by Hegseth on women in combat roles, said while in Laos to participate in the Association of Southeast Asian Nations' Defense Ministers Meeting. \"I don't know what his experiences are, but I can tell you about my experiences with women in the military and women in combat, and they're pretty good.\"\nAustin's comments are the strongest statement from the military since Hegseth, an Army veteran who did tours in Iraq and Afghanistan, was tapped by Trump tolead the DOD.\nTheFox News host has saidhis concerns are with women specifically in ground combat positions, not with pilots or those in other military roles, because he claims they have led to the military's physical standards being lowered and changed capabilities of combat units.\n\"I'm OK with the idea that you maintain the standards where they are for everybody. And if there's some ... hard-charging female that meets that standard, great, cool, join the infantry battalion,\" Hegseth said during a podcast appearance days before his nomination. \"But that is not what's happened. What has happened is the standards have lowered.\"\nSpeaking on his experience in his tours, Austin said, \"Every place I went, there were women doing incredible things, and they were adding value to to the overall effort, whether they were pilots, whether they were operational experts, whether they were intel experts. You know, I see things differently and I see that because of my experience, and that experience is extensive. And so, I think our women add significant value to the United States military, and we should never change that.\"\n\"And if I had a message ... to our women, I would say I would tell them that you know we need you. We have faith in you. We are appreciative of your service, and you add value to the finest and most lethal fighting force on earth,\" he said.\nOf the active-duty military personnel, 17.5% are women, and women make up 21.6% of the selected reserve, according to thePentagon's latest statistics.\n\"I love women service members, who contribute amazingly,\" Hegseth saidduring the podcast appearanceearlier this month. But three minutes later, he added, \"I'm straight up just saying we should not have women in combat roles. It hasn't made us more effective, hasn't made us more lethal, has made fighting more complicated.\"\nHegseth's selection has drawn controversy as some service members express concerns about their futures in the military. Women began being able to be in ground combat units in 2013 after then-Defense Secretary Leon Panetta rescinded a ban on women in these roles. Over 2,500 women serve in previously closed ground combat jobs, ABC Newspreviously reported.\nPanetta has come out in opposition to Hegseth's position on women in combat roles.\n\"Those kinds of comments come from a past era, and I think it's important for him to take the time to really look at how our military is performing in an outstanding fashion,\" Panetta told ABC News. \"We've got the best military in the world, and the reason is because we have the best fighting men and women in the world who are part of it.\"\n24/7 coverage of breaking news and live events"}, {"source": "abcnews", "title": "Trump promised to disrupt Washington. His Cabinet picks would do just that: ANALYSIS", "link": "https://abcnews.go.com/Politics/trump-promised-disrupt-washington-cabinet-picks-analysis/story?id=116049353", "content": "He says they'll remake government. Others worry it'll be burned to the ground.\nSome say it's hardly a surprise.\nPresident-electDonald Trumpcampaigned relentlessly on a radical overhaul of the federal government.\nHis Cabinet picks, being unveiled at a breakneck pace, reflect he's determined to keep the promises he made to millions of Americans who voted to put him back in the White House.\n\"I don't think he's been very nuanced about it,\" Ty Cobb, a former Trump White House lawyer, told ABC News. \"Trump has been consistently saying that he's going to shake it up, that he's going to dismantle the Department of Education, that he's going to blow up the DOJ. All of these things are real.\"\nAt first, his choices toed a more traditional line. Sen. Marco Rubio, who serves on foreign intelligence and relations committees, for secretary of state. Rep. Michael Waltz, a Green Beret who also sits on related House panels, for national security adviser.\nSeveral immigration hard-liners were quickly -- but still somewhat predictably -- tapped to implement his call for mass deportations, including Stephen Miller as deputy chief of staff, South Dakota Gov. Kristi Noem as homeland security secretary and former acting ICE Director Tom Homan as \"border czar.\"\nBut after that came a series of namesthat shockedeven Trump's close Republican allies in Congress: former Fox News host Pete Hegseth for defense secretary, Tulsi Gabbard for director of national intelligence, Matt Gaetz for attorney general and Robert F. Kennedy Jr. to oversee Health and Human Services.\nWhile those four lack conventional bona fides to lead some of the country's top political institutions, all possess a skill Trump is said to highly value: being experienced on TV communicating and defending his biggest political goals.\n\"This will absolutely be a brand-new era in Washington, from the pledge to remake the civil service to a top-to-bottom change in federal policies. There's nothing like it in recent memory,\" said Donald Kettl, a professor emeritus at the University of Maryland and former dean of its school of public policy.\n“The job of a Cabinet secretary involves a lot more than giving interviews,\" Kettl said. \"These are very large, sprawling agencies on which Americans deeply depend. It would take little for them to drift into major crises that would both hurt Americans and give the administration a black eye.\"\nTrump recently said the biggest regret of his first term was installing \"disloyal people.\"\nInternal strife with his own staff was well-documented. He lambasted his first attorney general, Jeff Sessions, for recusing himself from the department's Russia investigation. He expressed anger at Defense Secretary Mark Esper for disagreeing with his suggestion to use active-duty military to quell street protests over George Floyd in 2020. They are now viewed as having been key guardrails -- keeping Trump's more controversial demands inside traditional lines.\nIn Gabbard, Gaetz and Hegseth, Trump has found potential agency heads (pending Senate confirmation, which could prove tricky for some) who similarly want to root out what he's long accused of being a \"weaponized\" justice system and a rebellious military.\n“The last time the transition was very traditional but I think that’s because President Trump really had not been exposed that much to Washington,” said Ron Nicol, who in 2016 directed the agency action team in charge of Trump’s transition. “What he’s doing now is choosing a team that will be focused on getting things done.”\nHegseth, an Army veteran, has said in interviews before being named that he advocated a \"frontal assault\" on the DOD, including firing what he called \"woke\" generals and eliminating the Pentagon's diversity goals.\nGabbard, a former congresswoman who also served in the National Guard, has long railed against the so-called \"deep state\" Trump has blamed for undermining him in his first term and she's called Democrats a \"cabal of warmongers.\"\nGaetz, a conservative firebrand who resigned from Congress just after being named, has claimed the Justice Department is corrupt and even called for the FBI to be abolished. Gaetz himself was the subject of a federal investigation into potential sex trafficking, which ended without charges against Gaetz. He's denied the allegations.\nMany in the defense andjustice communities have balkedat the choices -- Gaetz for the nation's top law enforcement official, especially -- while Trump has said they would carry out his desire for reform.\n\"If what he means by that is burning them to the ground, then maybe,\" said Matthew Waxman, who served in senior positions at the state and defense departments during the George W. Bush administration.\n\"But if we're talking about serious institutional reform based on American values and careful deliberation, organization management and effectiveness, I don't see them as possessing any of those virtues,\" Waxman added.\nTrump on Wednesday attempted to blame Democrats for allegations levied against some of his more controversial Cabinet picks.\n\"They dirty them up, they destroy them, and then they spit them out. They are trying that right now with some great American Patriots who are only trying to fix the mess that the Democrats have made of our Country,\" Trump posted on his social media platform.\nBarbara Perry, co-chair of the presidential oral history program at the University of Virginia's Miller Center, said Trump appears to be running with what he perceives as a \"mandate\" from voters.\n\"He won, if not by a landslide, decisively. He views that as a compelling case for putting the people he wants who are the most MAGA in his mind,\" Perry said.\n\"No one could argue in terms of presidents putting people they support into these positions, that's their prerogative,\" Perry added. \"What is arguable is in the cases of at least four of these picks, they are unqualified.\"\nDonald TrumpJr., speaking with Fox News, said his father's picks will be \"actual disrupters\" and \"that's what the American people want.\"\nCobb, who worked for the Trump administration in 2017 and 2018, contended the president-elect may be \"overestimating\" the mandate.\n\"The three overwhelming issues of consequence in the last election were inflation, immigration and abortion,\" Cobb said. \"Obviously, immigration and inflation are things that people expect Trump to do. I think they discounted the persistent warnings of Trump being on a crusade for vengeance and for his own needs.\"\n24/7 coverage of breaking news and live events"}]