[{"source": "foxnews", "title": "Matt Gaetz says he will not serve in the upcoming session of Congress", "link": "https://www.foxnews.com/politics/matt-gaetz-says-he-not-serve-upcoming-session-congress", "content": "Fox News senior congressional correspondent Chad Pergram has the latest on the resignation on 'Special Report.'\nFormer Florida Rep. Matt Gaetz said on a podcast Friday he will not be joining Congress next year,settling an issuethat had been the subject of intense speculation in the hours after he withdrew his name from consideration as attorney general.\nGaetz had resigned last week from the 118th session of Congress, but it was unclear whether he would serve in the 119th session, beginning in January.\nPrior to resigning, Gaetz had been under a monthslong investigation by the House Ethics Committee, and the suggestion he might return to Congress touched off a flurry of speculation from members.\nMATT GAETZ WITHDRAWS FROM CONSIDERATION TO SERVE AS ATTORNEY GENERAL\nRep. Matt Gaetz, R-Fla., is seen after a meeting of the House Republican Conference in the U.S. Capitol on Tuesday, October 3, 2023.(Tom Williams/CQ-Roll Call, Inc via Getty Images)\nGaetz dismissed that speculation Friday in an interview with podcaster Charlie Kirk.\n\"There are a number of fantastic Floridians who’ve stepped up to run for my seat, people who have inspired with their heroism, with their public service,\"  GaetztoldKirk in an interview on his eponymous podcast. \"And I’m actually excited to see Northwest Florida go to new heights and have great representation.\"\nGaetz did say he planned to be part of staffing the incoming Trump administration and praised Trump's pick of former Florida Attorney General Pam Bondi to replace him as the top U.S. prosecutor if confirmed by the Senate.\n\"My good friend Pam Bondi is going to be a phenomenal attorney general for Donald Trump,\" Gaetztold Kirk. \"She has the legal acumen. She hates criminals. She is a bright legal mind and a fellow Floridian.\"\nThe interview comes hours after Gaetz withdrew his name from consideration as Trump's nominee for attorney general on Thursday,citing what he describedas the \"distraction\" his nomination had caused due to a swirl of allegations about paying underage women for sex.\nThen-Rep. Matt Gaetz, R-Fla., talks to reporters just after House Speaker Kevin McCarthy's last-ditch plan to keep the government temporarily open collapsed, at the Capitol in Washington, Friday, Sept. 29, 2023.(AP Photo/J. Scott Applewhite)\n\"While the momentum was strong, it is clear that my confirmation was unfairly becoming a distraction to the critical work of the Trump/Vance Transition,\" Gaetzsaid in announcing the decision.\nThe House Ethics Committee haddeadlocked days earlier on whether to release their reporton their investigation into Gaetz, which kicked off following a Justice Department investigation in 2021 stemming from allegations related to sex trafficking. The DOJ did not press charges in the matter, and attorneys for Gaetz said in 2023 that the Justice Department had dropped the investigation.\n\"We have just spoken with the DOJ and have been informed that they have concluded their investigation into Congressman Gaetz and allegations related to sex trafficking and obstruction of justice, and they have determined not to bring any charges against him,\" Gaetz attorneys Marc Mukasey and Isabelle Kirshner said in a statement in February 2023 reported by multiple news outlets.\nCLICK HERE TO GET THE FOX NEWS APP\nGaetz has denied all accusations. In an interview Friday, he stressed that he plans to continue to fight on behalf of the president-elect, despite his decision to resign from Congress.\n\"I’m going to be fighting for President Trump,\" Gaetzsaid,adding: \"I’m going to be doing whatever he asks of me, as I always have. But I think that eight years is probably enough time in the United States Congress.\"\nBreanne Deppisch is a politics reporter for Fox News Digital covering the 2024 election and other national news."}, {"source": "foxnews", "title": "Trump's sway over Republicans stronger than ever, but Sununu says GOP still a 'big-tent party'", "link": "https://www.foxnews.com/politics/trumps-sway-over-republicans-stronger-than-ever-sununu-argues-gop-still-a-big-tent-party", "content": "Republican Gov. Chris Sununu of New Hampshire in a Fox News Digital interview says he’s excited to get back to the private sector, but \"we'll see what political chapters write themselves down the road.\"\nMARCO ISLAND, Fla. — With his convincing White House victory this month,President-elect Donald Trump'sgrip over the Republican Party is firmer than ever.\nBut a popularRepublican governorwho has long been a vocal critic of the former and future president says that there's still room in the GOP for those outside of the MAGA and America First base.\n\"The party is a big-tent party. There's no question about it,\" Sununu said in a Fox News Digital interview this week along the sidelines of the Republican Governors Association winter meeting, which was held at a waterfront resort in southwest Florida.\nSununu, who was a top surrogate and supporter of former U.N. ambassador and former South Carolina Gov. Nikki Haley, Trump's final challenger in the 2024 GOP presidential primaries, backed the Republican nominee in the general election.\nEXCLUSIVE: WHAT THE NEW REPUBLICAN GOVERNORS CHAIR TOLD FOX NEWS\nRepublican presidential candidate Nikki Haley and New Hampshire Gov. Chris Sununu visit a polling location on Jan. 23, 2024, in Hampton, N.H.(Joe Raedle/Getty Images)\n\"It was a huge victory across the country, and the people of this country have spoken very loudly and unequivocally,\" Sununu said of Trump's electoral college and popular vote victory.\nAnd the governor acknowledged that Trump is \"the standard-bearer of the party\" and \"the voice of the party.\"\n\"But this is a very large party. If it wasn't, he (Trump) wouldn't have won. If it wasn't, we wouldn't have had convincing wins all across this country in a variety of different states,\" Sununu said.\nREPUBLICAN GOVERNORS SAY WITH TRUMP ELECTION, ‘WE’VE GOT A FRIEND IN THE WHITE HOUSE'\nAsked about the president-elect's flurry of announcements on Cabinet nominations this month, Sununu said that \"he definitely has a couple of controversial Cabinet picks that … I don't mind saying I'm not the biggest fan of, but the vast majority of them are terrific.\" (Sununu was interviewed before former Rep. Matt Gaetz, R-Fla., withdrew his name from consideration as attorney general amid a growing scandal.)\nPresident-elect Donald Trump is shown after speaking at the America First Policy Institute gala at his Mar-a-Lago residence in Palm Beach, Fla., on Nov. 14, 2024.(AP Photo/Alex Brandon)\n\"He's bringing folks from the private sector, he's bringing in governors, he's bringing in folks that have real experience in all of these issues and that understand the mission, which is fiscal responsibility,\" Sununu said, \"getting regulations out of the way, which effectively lowers costs on business, lowers costs on consumers, lowers costs for everyday citizens.\"\nSununu didn't stump on Trump's behalf in swing state New Hampshire, but he crisscrossed the campaign trail on behalf of down-ballot Republicans. The governor was a top surrogate for former Sen.Kelly Ayotte, the GOP gubernatorial nominee who emerged victorious on Election Day and has pledged to continue the Sununu agenda.\nAsked if Ayotte's nearly nine and half point win was also a victory for him, Sununu said, \"It was a victory forNew Hampshire.\"\nGov.-elect Kelly Ayotte and Gov. Chris Sununu meet in the New Hampshire governor's office at the State House in Concord on Nov. 7, 2024.(Office of New Hampshire governor)\n\"Kelly's going to be phenomenal. She has that experience as an attorney general, as U.S. senator. She understands how the systems work,\" Sununu said. \"Our transition is already going incredibly smoothly; discussions virtually every single day about all aspects of government, where it's going, how to build good teams and, most importantly … the opportunities to listen to what's happening in the communities.\"\n\"She'll have my cell number. I don't know if she'll need it, because I think she's going to be fantastic on her own, but she'll always have my cell number,\" Sununu said when asked if he'd be offering advice to his successor.\nFORMER AND FUTURE GOP RISING STAR SPEAKS WITH FOX NEWS\nAnd pointing to his two Democrat predecessors as governor, who Sununu said shared their cellphone numbers with him: \"We want New Hampshire to be successful. So it's not just me helping Kelly out. It is always a team effort. She's going to have a host of people that she can lean on for any advice when she needs it.\"\nAfter mulling a 2024 White House run, Sununu announced in the summer of 2023 that he would launch a presidential campaign, and weeks later he also said he wouldn't seek an unprecedented fifth two-year term steering the Granite State. (New Hampshire and neighboring Vermont are the only two states in the nation to hold gubernatorial elections every two years.)\nGov. Chris Sununu of New Hampshire speaks at a news conference at the State House in Concord on Nov. 15, 2023.(Fox News/Paul Steinhauser)\n\"I'm excited to get back to the private sector. I like businesses, I like deal sourcing,\" he said. \"I'm not sure exactly what the private sector is going to bring, but I think it's going to be pretty exciting.\"\nNew Hampshire will likely have a competitive Senate contest in 2026 when longtime Democrat Sen. Jeanne Shaheen, a former governor, is up for re-election.\nBut Sununu reiterated what he told Fox News Digital in July.\n\"Definitely ruling out running for the Senate in 2026. Yeah, definitely not on my dance card,\" he said.\nCLICK HERE TO GET THE FOX NEWS APP\nBut the governor predicted that Republicans will \"have a good candidate. There's no question about it. A couple of different folks that might be interested in running. I think that'd be fantastic. We've had an all-Democrat [congressional] delegation for a long time. I think the people in the state, especially with Kelly's convincing win, would love a different voice, would love just some sort of change.\"\nAsked if there's another run for office in his future, the 50-year-old governor said he's \"not thinking about that at all, excited for the private sector. And that's all … that's in my windshield.\"\nBut he didn't entirely shut the door, adding, \"We'll see what political chapters write themselves down the road.\""}, {"source": "foxnews", "title": "Pam Bondi could fix the DOJ and help provide justice for all", "link": "https://www.foxnews.com/opinion/pam-bondi-could-fix-doj-help-provide-justice-all", "content": "Fox News’ Brooke Singman reports on Trump’s latest Cabinet pick after Matt Gaetz withdraws his attorney general nomination.\nTune out the noise and know this: former Florida attorney generalPam Bondiis the force we need to fix the Department of Justice, and Americans can rest assured that weaponizing any part of our nation’s criminal justice system will soon come to a decisive end.\nStrong, intelligent and a dear friend and colleague,Bondi is a litigatorI’ve always respected and admired. She served as Florida’s first AG for eight years after a successful 18 years as a county prosecutor where she followed the rule of law and actively listened to constituents who wanted strong and safe communities.\nAs a former Democrat, she witnessed first-hand the elitism and divisive politics from grassroots to national policy before switching to the GOP in 2000.  Bondi championedanti-human-trafficking legislationwhile helping to bring the issue into the national spotlight, and she justifiably demanded the Department of Justice be diligent and transparent in their investigations of Hunter Biden.\n1.4 MILLION ILLEGAL IMMIGRANTS IN US HAVE BEEN ORDERED DEPORTED, BUT HAVE YET TO BE REMOVED: OFFICIAL\nI have great confidence that Bondi andPresident-elect Donald Trumprecognize that the hallmark of justice is the equal application of the law, and that this month’s \"red sweep\" of the election is evidence that voters want politicians to stop the rhetoric and solve problems.\nFormer Florida Attorney General Pam Bondi is Trump's new pick as AG. FILE: Bondi stands on stage in an empty Mellon Auditorium while addressing the Republican National Convention on August 25, 2020, in Washington, DC.(Chip Somodevilla/Getty Images)\nWhen it comes to conservative criminal justice solutions, any crime rate data is meaningless if Americans don’t feel safe. One victim or any single crime-riddled community is one too many. And with the permeation of social media, all of it feels imminent to our own families and neighborhoods.\nWhile some Republicans are reacting to constituents' fears with knee-jerk, ineffective tough-on-crime policies, history has shown us, responding to crime with overly punitive policies doesn’t make any of us safer.\nAs a former U.S. attorney, I worked closely with the Trump administration to help craft and pass the landmark, bipartisan 2018 First Step Act, and I can tell you that thoughtful, conservative criminal justice solutions work.\nCLICK HERE FOR MORE FOX NEWS OPINION\nThrough improved federal prison programming, targeted sentencing reforms, and other First Step Act directives, public safety has improved. Of the 44,000 individuals released from federal prison under the First Step Act, only 9.7% have been rearrested or reconvicted — an incredible improvement from 46.2% prior to 2018.\nJust as the name implies, this landmark law was a first step for Trump and other conservative criminal justice advocates to use smart on crime policy solutions to improve public safety. Conservatives can build on that success by promoting thoughtful conservative policy ideas in our states, counties and at the federal level.\nNo matter what your party affiliation, we can all agree that one victim is one too many and that criminals must be held accountable. Haphazardly creating new crimes or stiffer sentencing do not deter individual criminals — rather, it is the predictability of being caught that deters individuals from committing a crime.\nFurther, boots-on-the-ground law enforcement in every capacity needs our support and resources. When forces are stretched too thin with outdated technology and policies, it’s no surprise that only 57.8% of murders and 26.9% of rapes are being solved. Victims deserve better.\nCLICK HERE TO GET THE FOX NEWS APP\nAs a former U.S. attorney, I worked closely with the Trump administration to help craft and pass the landmark, bipartisan 2018 First Step Act, and I can tell you that thoughtful, conservative criminal justice solutions work.\nAs America’s next attorney general, Bondi will empower Americans to work together to find solutions to solve criminal justice problems unique to their own communities and to stand their ground against any attempted weaponization of our justice system.\nWith Pam Bondi at the helm, the DOJ is on notice that transparency and an equal application of the law is non-negotiable. And with that, conservatives have a real opportunity to be the grown-ups in the room and create criminal justice solutions that are equitable for all Americans today and for generations to come.\nCLICK HERE TO READ MORE FROM BRETT TOLMAN\nBrett Tolman is executive director for Right on Crime and former United States attorney for the District of Utah. Tolman was a leading figure in the drafting and passage of the First Step Act, one of the most sweeping reforms of the federal criminal justice system in decades."}, {"source": "foxnews", "title": "Trump's ICE nominee decision could be imminent as deportation plan takes spotlight", "link": "https://www.foxnews.com/politics/trumps-ice-nominee-decision-could-be-imminent-deportation-plan-takes-spotlight", "content": "National Border Patrol Council President Paul Perez reacts to pushback on President-elect Trump’s deportation promises on ‘America Reports.’\nFIRST ON FOX:A decision on whom President-elect Trump will nominate to leadImmigration and Customs Enforcement (ICE)is expected within the coming days, sources familiar with proceedings tell Fox News Digital – ahead of what could be significant opposition to mass deportations from some Democratic states next year.\nDiscussions have been held at Mar-a-Lago this week, and a decision could be made as early as Friday. Whoever is nominated will require Senate confirmation.\nWho is in the running is unclear. One source said on Thursday that there are still multiple candidates being discussed and that the Trump team has yet to whittle the list down.\nWHO ELSE COULD BE ON PRESIDENT-ELECT TRUMP'S IMMIGRATION ‘DREAM TEAM?’\nFormer President Trump speaks during a campaign event in Mint Hill, North Carolina, on Sept. 25.(AP Photo/Evan Vucci, File)\nSources hadpreviously suggestedthat John Fabbricatore, a former ICE field officer, and Todd Lyons, currently leading the agency’s Enforcement and Removal Operation (ERO) unit in Boston, were among the top contenders. The transition team is understood to be looking for someone with a deep law enforcement background to lead the agency.\nBut Fabbricatore is now understood to be out of the running to lead the agency. Lyons is believed to be held in high regard within the agency and by a number of people on the transition team, given his leadership of the Boston unit and his teams’ work in chasing down criminal illegal immigrants who had been released from custody in the sanctuary city.\n‘100% ON BOARD': BORDER STATE OFFERS TRUMP MASSIVE PLOT OF LAND TO AID MASSIVE DEPORTATION OPERATION\nAn ICE agent monitors hundreds of asylum seekers being processed upon entering the Jacob K. Javits Federal Building in New York City on June 6, 2023.(David Dee Delgado/Getty Images)\nWhoever leads the agency will be in the media and political spotlight in the next year as they spearhead what President-elect Trump has promised will be a historic mass deportation operation.\nTrump has appointed formerICE Director Thomas Homanas \"border czar,\" and he is expected to take a leadership role in the efforts to secure the border and launch the mass deportation operation. He has also announced that South Dakota Gov. Kristi Noem will be his nominee to lead the Department of Homeland Security.\nThe transition team has already been eyeing asignificant expansion of detentionin order to facilitate the operation, with an increase in beds and expanded detention capacity near major metropolitan areas.\nCLICK HERE TO GET THE FOX NEWS APP\nThose efforts are already drawing significant opposition from Democratic officials in some states. The governors of Illinois, Arizona and Massachusetts have said they won’t assist the administration in the operation. But someRepublican stateshave offered support, with Texas offering more than 1,400 acres of land to stage mass deportations near the border.\nAdam Shaw is a politics reporter for Fox News Digital, primarily covering immigration and border security.\nHe can be reached atadam.shaw2@fox.comor onTwitter."}, {"source": "foxnews", "title": "Ex-CNN anchor who ran for Congress says Democrats have become 'party of the status quo'", "link": "https://www.foxnews.com/media/ex-cnn-anchor-ran-congress-says-democrats-become-party-status-quo", "content": "Former CNN host and Democratic congressional candidate John Avlon blasted his party in the wake of its electoral losses this November, including his own.\nFormer CNN host andfailed Democratic congressional candidateJohn Avlon blasted his party in the wake of its electoral losses this November, including his own.\nAvlon, who lost to incumbentRep. Nick LaLota, R-N.Y., in New York's Congressional District 1 race on Election Day, told MSNBC’s \"Morning Joe\" on Friday that voters see the Democratic Party as the \"status quo\" and not strong enough on the issues most urgent most urgent to Americans.\n\"They can’t be the default party of the status quo. I think that’s the most dangerous place to be. And I think right now they are seen that way,\" Avlon told co-hosts Joe Scarborough and Mika Brzezinski.\nNO TRUMP BUMP: MSNBC HEMORRHAGING VIEWERS SINCE ELECTION DAY, SHEDS MORE THAN HALF OF PRIMETIME AUDIENCE\nFormer CNN host and former Democratic Party congressional candidate John Avlon said that his party has became perceived as \"status quo.\"(Screenshot/MSNBC)\nThe show brought Avlon on to weigh in on what happened to the Democratic Party this cycle, especially as popular liberal candidates were beaten by Republicans. One major loss they brought up was Sen. Bob Casey, D-Pa., who conceded toRepublican candidate Dave McCormickon Thursday, following more than two weeks of vote counting in Pennsylvania.\n\"Morning Joe\" characterized Casey’s loss as a \"shot across the bow\" from a formidable GOP, and asked Avlon for a postmortem on that loss and others.\nThe former CNN anchor gave an honest assessment, noting that his party failed in speaking to the most important concerns of American voters.\n\"I kept thinking of one of my favorite quotes from Bill Clinton,\" he began. \"He said, ‘People will vote for strong and wrong every time.’ And I think the Democratic Party has a strength problem on the issues that matter most – personal safety and economic security. I think those are the fundamentals.\"\nAvlon argued that Democrats were too focused on defense compared to aggressive GOP messaging and then were seen as the status quo. \"Democrats got to get off defense and play offense,\" he said, elsewhere noting that Republicans were able to appear more appealing.\nROSIE O'DONNELL CONDEMNS 'MORNING JOE' CO-HOSTS FOR MEETING WITH TRUMP: 'LAST TIME I EVER WATCH'\nFreshman GOP Rep. Nick LaLota defeated former CNN anchor John Avlon in U.S. congressional race for New York on Election Day this year.(Getty Images)\n\"And so, people will take a chance if they seem like there are bold solutions on the other side.\"\nAvlon also suggested that his party did not do enough to address the \"civic decline\" that Americans have been feeling. \"But if people feel that that civic decline is going on, Democrats have to be taking that on and being the leaders of that reform, otherwise they’re gonna get caught up in a wave,\" he said.\nLater on in the segment, Scarborough pushed back, saying that the Democratic Party had to address other serious issues, like the \"authoritarian\" threat of the Republican Party and President-elect Donald Trump’s so-called \"threats of retribution\" to his political enemies.\nCLICK HERE TO GET THE FOX NEWS APP\nAvlon, who repeatedly hammered Trump on such topics during hismedia tenure,admitted that those issues simply weren’t as \"urgent\" as the economy and border security.\n\"Look, I think life is a struggle between the urgent and the important. And I think for a lot of people the urgent issues they face are about affordability, right... and about feelings of personal safety.\"\nHe continued, \"And here’s where Democrats gotta get the big things right. If people don’t feel safe, if they don’t feel economically secure, everything else is secondary.\"\nGabriel Hays is an associate editor for Fox News Digital."}, {"source": "foxnews", "title": "Trump taps Texan Brooke Rollins as agriculture secretary", "link": "https://www.foxnews.com/politics/trump-taps-brooke-rollins-agriculture-secretary", "content": "Former Burgum 2024 campaign spokesman Lance Trover and Democratic strategist Harley Lippman align on Trump's Treasury and attorney general picks.\nPresident-elect Trumptapped Brooke Rollins as his agriculture secretary.\nIn a statement on Saturday, Trump lauded Rollins' \"commitment to support the American Farmer, defense of American Food Self-Sufficiency, and the restoration of Agriculture-dependent American Small Towns.\"\n\"A proud Graduate of Texas A&M University, Brooke earned a Bachelor’s of Science Degree in Agriculture Development, and J.D., with Honors,\" the announcement said. \"From her upbringing in the small and Agriculture-centered town of Glen Rose, Texas, to her years of leadership involvement with Future Farmers of America and 4H, to her generational Family Farming background, to guiding her four kids in their show cattle careers, Brooke has a practitioner’s experience, along with deep Policy credentials in both Nonprofit and Government leadership at the State and National levels.\"\n\"As our nextSecretary of Agriculture, Brooke will spearhead the effort to protect American Farmers, who are truly the backbone of our Country,\" Trump said. \"Congratulations Brook!\"\nGET TO KNOW DONALD TRUMP'S CABINET: WHO HAS THE PRESIDENT-ELECT PICKED SO FAR?\nBrooke Rollins, president and CEO of AFPI, is seen during the America First Policy Institute's America First Agenda Summit at the Marriott Marquis, July 26, 2022.(Tom Williams/CQ-Roll Call, Inc via Getty Images)\nRollins, who grew up on a farm in Glen Rose, Texas, was a surprise pick for the position. Former Sen. Kelly Loeffler, R-Ga., who met with the president-elect at Mar-a-Lago on Friday afternoon, was rumored to fill the position prior to the official Trump announcement on Saturday.\nRollins was previously rumored to be on the short-list for Trump's pick of chief of staff – which ultimately was given to longtime allySusie Wiles.\nTRUMP NAMES SUSIE WILES AS FIRST FEMALE WHITE HOUSE CHIEF OF STAFF IN HISTORY\nRollins served as director of the Office of American Innovation and acting director of the Domestic Policy Council during the first Trump administration.\nSince her time in the TrumpWhite House, Rollins co-founded the pro-Trump America First Policy Institute think tank.\nPresident-elect Trump tapped Brooke Rollins as his agriculture secretary.(Fox News)\nIf confirmedby the Senate,Rollins would lead a 100,000-person agency with offices in every county in the country. The role includes managing farm and nutrition, forestry, food safety, rural development, agricultural research and more.\nCLICK HERE TO GET THE FOX NEWS APP\nIt had a budget of $437.2 billion in 2024.\nSarah Rumpf-Whitten is a breaking news writer for Fox News Digital and Fox Business.\nStory tips and ideas can be sent to sarah.rumpf@fox.com and on X:@s_rumpfwhitten."}, {"source": "foxnews", "title": "Trump will appoint 'dozens' of judges, experts say, despite Dems ramming through nominees in lame-duck session", "link": "https://www.foxnews.com/politics/trump-appoint-dozens-judges-experts-say-despite-dems-ramming-through-nominees-lame-duck-session", "content": "Fox News correspondent Mark Meredith has more on Senate Democrats pushing to approve judicial nominees ahead of Trump's return to White House on 'Special Report.'\nExperts sayPresident-elect Donald Trump'schances of appointing judges to the federal bench remain positive, despite Senate Democrats' push to confirm as many of President Biden's picks as possible.\nAmid their efforts to appointBiden's judicial picksahead of Trump's administration and a new Congress starting in January, both parties struck a midnight deal Wednesday after Republicans planned to slow down judicial confirmations earlier this week.\nThe agreement would allowDemocrats to holdvotes on four district court judges in exchange for pulling four higher-tier circuit court judicial nominees, a senior Senate source familiar with the matter told Fox News Digital.\nDEMOCRATS ADVANCE 5 MORE BIDEN JUDICIAL NOMINEES\nThe four vacancies would then be Trump's to fill.\nASenate Majority Leader Chuck Schumerspokesperson told Fox News Digital the trade included four circuit nominees – all of which lack votes to get confirmed – \"for more than triple the number of additional judges moving forward.\"\nSenate Majority Leader Chuck Schumer addressed the floor Thursday, saying they had confirmed six new judges this past week alone.(Getty Images)\n\"I’m glad that Republican senators are starting to show up to vote because some of the worst nominees are still awaiting confirmation precisely because they didn't have adequate support,\" Carrie Severino, president of JCN, told Fox News Digital.\nWhen asked about the deal, Devon Ombres, senior director of courts and legal policy at CAPAction said, \"Frankly, I'm at a loss as to why they would get here.\"\n\"It would be nice to see Democratic leadership and the White House try and push through and fill those vacancies where possible,\" Ombres said.\nSchumer addressed the floor Thursday, saying they had confirmed six new judges this past week alone – one circuit court judge and five district court judges, bringing Biden's total number of confirmations to 220. Trump notably secured 234 confirmations during his first term.\nSENATE SHOWDOWN: GOP SECURES DEAL WITH SCHUMER TO SAVE COVETED APPELLATE JUDGES FOR TRUMP\nDespite the push, Ombres stated he predicts circuit judges appointed primarily by former president George W. Bush will take senior status, which would then give Trump additional vacancies to fill. Likewise, Ombres said those appointed by former Presidents Bill Clinton and Barack Obama will avoid taking senior status.\n\"[Trump will] still have a handful of vacancies that he'll be able to appoint,\" Ombres said. \"But if the Senate Republicans maintain the blue slip process, it will be tougher sledding to appoint in those in blue states, but he will still have an opportunity to bolster where there is already strength, especially the 11th Circuit.\"\nExperts say President-elect Donald Trump's chances of appointing judges to the federal bench remain positive despite Senate Democrats' push to confirm as many President Biden picks as possible.(AP Photo/Evan Vucci, File)\n\"When Trump comes into office, he's going to have dozens more vacancies to fill,\" Severino said. \"And that's not even counting the judges who will take senior status over the next four years.\"\nAccording to a Senate Democrat leadership aide familiar with the agreement reached, the deal allowed for the Senate to vote on cloture on nine district court judges this week and vote to confirm them when they return after Thanksgiving.\nThe source also noted that the new deal did not mean Republicans were going to allow the Biden district judges to sail through without opposition.GOP senatorsare still expected to fight and vote against the Democrat-nominated judges as they have done throughout Biden's term.\nSPRINT TO CONFIRM TRUMP NOMINEES KICKS OFF IN JANUARY\n\"I think certainly appellate judges are always going to be more important in our judicial system than district court judges,\" Ombres said. \"But district court judges are still capable of instituting nationwide injunctions and striking down programs and issuing sweeping opinions.\"\nThe Senate slowdown was spearheaded bySenate Minority Whip John Thune, R-S.D., who was recently elected as the next Republican Senate leader. Republicans sought to delay the confirmation process through tactical maneuvers on the floor.\nThe Senate slowdown was spearheaded by Senate Minority Whip John Thune.(Reuters)\nTrump has previously been vocal about not wanting judicial confirmations during the lame-duck session, writing on Truth Social, \"No more Judges confirmed before Inauguration Day!\"\nCLICK HERE TO GET THE FOX NEWS APP\nShortly after Senate Dems began to ramp up energy to confirm Biden's judicial picks after the Nov. 5 election, Trump-Vance transition spokesperson Brian Hughes told Fox News Digitalin a statement,\"In his first term, President Trump appointed constitutionalist judges who interpret the law as written. He will do so again.\"\n\"He had a wonderful record last time around, and I hope he's going to have a similar track record this time of putting up principled and highly qualified nominees,\" Severino said.\nFox News Digital's Julia Johnson contributed to this report.\nHaley Chi-Sing is a Writer for Fox News Digital. You can reach her at @haleychising on X."}, {"source": "foxnews", "title": "Abolish the ATF?: Rep. Burlison wants to eliminate 'disaster agency' he says has been violating 2nd Amendment", "link": "https://www.foxnews.com/politics/abolish-atf-rep-burlison-wants-eliminate-disaster-agency-he-says-has-been-violating-2nd-amendment", "content": "Rep. Eric Burlison, R-Mo., discusses why he believes the ATF should be abolished and names other federal entities he thinks should be nixed.\nRep. Eric Burlison, R-Mo., wants to abolish the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) and plans to put forward a measure that would do just that.\n\"The ATF is a disaster,\" Burlison, a member of the conservative House Freedom Caucus, told Fox News Digital on Thursday, adding that \"for decades they've been a disaster agency\" which has \"been violating the…Second Amendment.\"\nThe congressman suggested that states should be allowed to handle matters themselves, without federal interference.\n\"There's very few ATF officials,\" he said, accusing the agency of \"co-opting or commandeering [local] law enforcement to enforce laws\" which state lawmakers did not pass.\nCONGRESSMAN ERIC BURLISON: IN THE BIDEN ADMINISTRATION, ‘THE INMATES ARE RUNNING THE PRISON’\nLeft: Rep. Eric Burlison, R-Mo., leaves a meeting of the House Republican Conference at the Capitol Hill Club in Washington, D.C., on Jan. 25, 2023; Right: The letters \"ATF\" are seen on a Department of Justice ATF Explosive and Fire Investigation vehicle at the Marine Corps Air Station Airshow in San Diego, California, on Sept. 28.(Getty Images)\nThe legislator plans to introduce a proposal previously put forward in 2023 bythen-Rep. Matt Gaetz, R-Fla.\nBurlison, a freshman who took office last year, was one of the Republicans who joined Gaetz's measure as a cosponsor.\nGOP Reps. Lauren Boebert of Colorado, Paul Gosar of Arizona, Mary Miller of Illinois, Andy Biggs of Arizona, Cory Mills of Florida, Mike Collins of Georgia, Barry Moore of Alabama, Thomas Massie of Kentucky and Bob Good of Virginia also joined as cosponsors, according to congress.gov.\nMATT GAETZ URGES COLLEAGUES TO ABOLISH THE ATF BEFORE IT STRIPS AMERICANS OF GUN RIGHTS: ‘CANNOT BE TRUSTED’\nA vest worn by special agents from the U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives is seen during a training session near San Marcos, Texas, on Aug. 19, 2010.(Michael Paulsen/Houston Chronicle via Getty Images)\nFox News Digital reached out to the ATF for comment on Friday.\n\"ATF provides enormous benefits to the American public through all of its efforts fighting violent crime every day,\" ATF spokesperson Kristina Mastropasqua said in an emailed statement.\nBurlison also thinks theDepartment of Educationand the Environmental Protection Agency (EPA) should be abolished.\nGAETZ INTRODUCES ‘ABOLISH THE ATF ACT’ AFTER RULING AGAINST STABILIZING BRACES\nATF seal(Ted Soqui/Corbis via Getty Images)\nCLICK HERE TO GET THE FOX NEWS APP\n\"The EPA is making one-size-fits-all rules for the entire United States\" and is \"being more harmful than… helpful,\" he said.\nAlex Nitzberg is a writer for Fox News Digital."}, {"source": "foxnews", "title": "'Conveyor belt of radicals': GOP slammed over Senate absences that helped Biden score more judges in lame duck", "link": "https://www.foxnews.com/politics/conveyor-belt-radicals-gop-slammed-over-senate-absences-helped-biden-score-more-judges-lame-duck", "content": "Fox News senior congressional correspondent Chad Pergram looks at the incoming vice president's efforts to counter potential roadblocks in Congress for some of President-elect Donald Trump's administration picks on 'Special Report.'\nSenate Republicans faced criticismover several vote absences this week that allowed Democrats to confirm judges or agree to end debate on nominees that otherwise could have been blocked if each of the missing GOP lawmakers were there.\nOne particularly crucial vote was on Monday for a lifetime appointment to the 11th U.S. Circuit Court, a coveted appeals court slot to which Democrats did not have the votes to confirm President Biden's nominee, since outgoing Sen. Joe Manchin, I-W.Va., voted against.\nHowever, since Sens. Mike Braun, R-Ind., Steve Daines, R-Mont., Bill Hagerty, R-Tenn., JD Vance, R-Ohio, and Marco Rubio, R-Fla., did not vote, the nominee was confirmed by 49 votes to 45 votes.\nDSCC HOPEFUL GILLIBRAND SAYS DEMS SHOULD HAVE PUT IMMIGRATION FIX ON TABLE '2 YEARS AGO'\nJoe Biden and Chuck Schumer scored judicial wins as a result of GOP Senate absences.(Reuters)\n\"This leftist judge would have been voted down and the seat on the important 11th circuit would have been filled by Donald Trump next year had Republicans showed up,\" wrote Gov. Ron DeSantis, R-Fla., on X. \"Now, the leftist judge will have a lifetime appointment and the people of FL, AL and GA will suffer the consequences.\"\nMike Davis, the former chief counsel for nominations to former Senate Judiciary Chairman Chuck Grassley, R-Iowa, told Fox News Digital, \"A senator’s only job is to show up and vote.\"\n\"President Biden is jamming through bottom-of-the-barrel radical left-wing judges for lifetime appointments to the federal bench after the American people voted for dramatic change. Senate Republicans must do everything they can to stop this lame-duck conveyor belt of radicals. But if these Senate Republicans cannot even show up to vote, let alone debate for four hours on each judge, why should we vote for these deadbeat senators?\"\nDavis is also founder and president of the Article III Project.\nGOP SENATOR DEBUTS BILL TO ABOLISH EDUCATION DEPARTMENT FOLLOWING TRUMP CAMPAIGN PROMISE\nDeSantis criticized Republicans over a circuit court confirmation.(AP Photo/Charlie Neibergall)\nA senior Senate source confirmed to Fox News Digital that there was irritation among the Republican conference about their colleagues' absences. The most vocal about it was Sen. Thom Tillis, R-N.C., they said.\nIn a statement,Vice President-elect Vancesaid, \"As a co-chairman of the transition, it’s vital that I’m focused on making sure President Trump’s government is fully staffed with people who support his America First agenda and will be ready to hit the ground running on January 20th.\"\n\"However, it’s also important to me to do everything in my power to block more radical judges from getting confirmed. So while it may be outside of the norm for an incoming VP to take Senate votes in the lame duck period, if my colleagues here in the Senate tell me that we have a real chance of beating one of these nominees, I’ll move heaven and earth to be there for the vote,\" he added.\nSENATE SHOWDOWN: GOP SECURES DEAL WITH SCHUMER TO SAVE COVETED APPELLATE JUDGES FOR TRUMP\nIn a separate statement, Brian Hughes, Trump-Vance Transition spokesman said, \"We cannot allow Chuck Schumer to play games with the transition’s ability to staff the incoming administration. Under no circumstances should we allow radical left judges to be jammed through the Senate at the 11th hour, but the Vice President-elect is needed for the transition to continue working ahead of schedule.\"\nVance is notably the first senator in over a century to vote on a judicial nomination after being elected to be vice president.\nThe vice president-elect was at the Capitol during the latter part of the week facilitating meetings between senators and Trump selections for key administration posts.\nVance was in attendance for pivotal votes on Wednesday, while some Republicans were still absent.\nA spokesperson for Daines pointed Fox News Digital to an X post from the senator, in which he detailed travel issues he ran into on his way to Washington, D.C. \"Runway closed due to ice, then prolonged de-icing, then a medical emergency…then Delta flight attendants timed out. Landed DC at 10 pm and voting until ~ midnight,\" he said.\nVance said he would ‘move heaven and earth’ to be at crucial votes.(Stephen Maturen/Getty Images)\nDaines' office said he went immediately to the Senate floor to vote once he finally landed in the capital.\nThe offices of Braun, Hagerty and Rubio did not provide comment to Fox News Digital in time for publication. Rubio was recently selected by Trump to be his nominee for Secretary of State.\nWhile the circuit court confirmation was the most important vote that GOP absences helped to advance, it wasn't the only case of it happening this week.\nBraun, Hagerty, Vance, Rubio and Sens. Kevin Cramer, R-N.D., and Ted Cruz, R-Texas were absent for a vote on a district court nominee on Tuesday that was ultimately confirmed, despite Manchin opposing and Democrats not otherwise having enough votes.\nCruz was in Texas on the day of the vote with Trump and billionaire Elon Musk for the launch of a SpaceX rocket. The senator is the soon-to-be chairman of the Senate Committee on Commerce, Science, and Transportation and told reporters this week that space legislation \"will be a significantly higher priority of the full committee.\"\nDEMOCRAT TAMMY BALDWIN DETAILS RECIPE FOR RUNNING IN A SWING STATE AFTER VICTORY IN TRUMP-WON WISCONSIN\nHe cited his trip to the launch, saying, \"My number-one priority is jobs. And commercial space generates tens of thousands of jobs across Texas and across the country.\"\nCramer's office did not provide comment in time for publication.\nOn Wednesday, both Cruz and Braun missed another district judge confirmation that Manchin opposed, handing Majority Leader Chuck Schumer, D-N.Y., and Biden another accomplishment.\nBraun further missed another Wednesday vote on a district judge that was opposed by outgoing Sen. Kyrsten Sinema, I-Ariz., allowing the nominee to be confirmed.\nBraun was elected to be Indiana's next governor.(Kevin Dietsch/Getty Images)\nOn Wednesday, Tillis spoke on the Senate floor on the subject. \"Schumer's trying to ram through Biden's liberal judicial nominees. We can block some of them, but it requires ALL GOP senators to be here. VP-elect [Vance] is a busy man right now, but he's still here on the Senate floor holding the line, and so should all of our GOP colleagues,\" he wrote on X.\nThe outgoing Indiana senator returned on Wednesday evening before Republicans managed to make a deal with Schumer on further judicial confirmation votes, securing four vacancies on valuable circuit courts for Trump in exchange for allowing votes on a number of district court judges without further stalling.\nCLICK HERE TO GET THE FOX NEWS APP\nOne GOP senator told Fox News Digital thatSenate Minority Whip John Thune, R-S.D., who was recently elected to be the next GOP Senate leader, applied pressure to absent senators such as Vance, Rubio and Braun, which resulted in the ultimate deal with Schumer.\nA senior Senate Republican source familiar told Fox News Digital that Thune underscored the importance of attendance at the GOP conference, especially concerning judicial confirmation votes.\nJulia Johnson is a politics writer for Fox News Digital and Fox Business, leading coverage of the U.S. Senate. She was previously a politics reporter at the Washington Examiner.\nFollow Julia's reporting on X at@JuliaaJohnson_and send tips toJulia.Johnson@fox.com."}, {"source": "foxnews", "title": "Hochul spearheads plan to pay NYers to switch to green appliances amid state money woes", "link": "https://www.foxnews.com/politics/hochul-spearheads-plan-pay-nyers-switch-green-appliances-amid-state-money-woes", "content": "Fox News Flash top headlines are here. Check out what's clicking on Foxnews.com.\nNew York is rolling out a new incentive for residents who switch togreen alternativesfor their household appliances.\nIn an announcement Thursday, Gov. Kathy Hochul revealed that her state will be the first to offer a rebate under a new Appliance Upgrade Program.\nThe rebate, funded by the Inflation Reduction Act (IRA), offers low- and moderate-income households up to $840 if they switch out their fossil fuel-powered clothes dryers with heat pump-powered alternatives.\n\"New York is demonstrating its continued commitment to ensuring an equitable energy transition by leveraging all federal funds available to incentivize consumers to make energy-efficient appliance purchases a priority,\" Hochul said in a statement.\nEXPERTS RIP ‘TRIPLE CROWN OF BAD REGS’ AS BIDEN ADMIN POSTS GAS STOVE RULE IT DENIED WAS A BAN\nNew York Gov. Kathy Hochul speaks during an announcement on the inclusion of money for the Mental Health and Public Safety Budget for fiscal year 2025 at Midtown Community Justice Center in New York City on April 24.(Lev Radin/Pacific Press/LightRocket)\n\"As a result of these new rebates, low- and moderate-incomeNew Yorkerswill save energy and money while doing their laundry with modern technology that will reduce emissions,\" she added.\n5 INSANE BIDEN-HARRIS APPLIANCE REGULATIONS HEADING YOUR WAY\nThe New York State Energy Research and Development Authority (NYSERDA) also praised the new initiative.\n\"NYSERDA is pleased to start distributing this IRA funding for home appliance rebates through a customer-centric approach that ensures low-and moderate-income New Yorkers can easily upgrade inefficient clothes drying equipment or purchase a dryer for the first time,\" NYSERDA said.\nThe handout comes as New York ranks as having the second-highest debt burden in the nation in 2021, according to the New York State Comptroller.\nNew York Gov. Kathy Hochul revealed that her state will be the first to offer a rebate under a new Appliance Upgrade Program.(George Frey)\nThe comptroller's office released a report on the state's financing plan, which projected New York would issue over 3.4 times more debt than it will retire over the next five years.\nNew York has been pushing to phase out fossil fuels in the state but has been previously criticized for its initiatives.\nOfficials announced in May 2023 that beginning in 2026, New York will prohibit gas stoves and heating systems for new construction of buildings seven stories or fewer, according to reports.\nCLICK HERE TO GET THE FOX NEWS APP\n\"I think it's ridiculous, and I think the danger is that it almost seems comedic and so people can take it, you know, maybe not as seriously as they should,\" New York Senate Minority Leader Rob Ortttold Fox News Digitalin an interview before the ban. \"It is going to increase people's utility rates in the state of New York, it is going to decrease energy reliability in the state of New York, and it will do nothing to fight climate change.\"\nAubrie Spady is a Writer for Fox News Digital."}, {"source": "foxnews", "title": "Trump taps Texan Brooke Rollins as agriculture secretary", "link": "https://www.foxnews.com/politics/trump-taps-brooke-rollins-agriculture-secretary", "content": "Former Burgum 2024 campaign spokesman Lance Trover and Democratic strategist Harley Lippman align on Trump's Treasury and attorney general picks.\nPresident-elect Trumptapped Brooke Rollins as his agriculture secretary.\nIn a statement on Saturday, Trump lauded Rollins' \"commitment to support the American Farmer, defense of American Food Self-Sufficiency, and the restoration of Agriculture-dependent American Small Towns.\"\n\"A proud Graduate of Texas A&M University, Brooke earned a Bachelor’s of Science Degree in Agriculture Development, and J.D., with Honors,\" the announcement said. \"From her upbringing in the small and Agriculture-centered town of Glen Rose, Texas, to her years of leadership involvement with Future Farmers of America and 4H, to her generational Family Farming background, to guiding her four kids in their show cattle careers, Brooke has a practitioner’s experience, along with deep Policy credentials in both Nonprofit and Government leadership at the State and National levels.\"\n\"As our nextSecretary of Agriculture, Brooke will spearhead the effort to protect American Farmers, who are truly the backbone of our Country,\" Trump said. \"Congratulations Brook!\"\nGET TO KNOW DONALD TRUMP'S CABINET: WHO HAS THE PRESIDENT-ELECT PICKED SO FAR?\nBrooke Rollins, president and CEO of AFPI, is seen during the America First Policy Institute's America First Agenda Summit at the Marriott Marquis, July 26, 2022.(Tom Williams/CQ-Roll Call, Inc via Getty Images)\nRollins, who grew up on a farm in Glen Rose, Texas, was a surprise pick for the position. Former Sen. Kelly Loeffler, R-Ga., who met with the president-elect at Mar-a-Lago on Friday afternoon, was rumored to fill the position prior to the official Trump announcement on Saturday.\nRollins was previously rumored to be on the short-list for Trump's pick of chief of staff – which ultimately was given to longtime allySusie Wiles.\nTRUMP NAMES SUSIE WILES AS FIRST FEMALE WHITE HOUSE CHIEF OF STAFF IN HISTORY\nRollins served as director of the Office of American Innovation and acting director of the Domestic Policy Council during the first Trump administration.\nSince her time in the TrumpWhite House, Rollins co-founded the pro-Trump America First Policy Institute think tank.\nPresident-elect Trump tapped Brooke Rollins as his agriculture secretary.(Fox News)\nIf confirmedby the Senate,Rollins would lead a 100,000-person agency with offices in every county in the country. The role includes managing farm and nutrition, forestry, food safety, rural development, agricultural research and more.\nCLICK HERE TO GET THE FOX NEWS APP\nIt had a budget of $437.2 billion in 2024.\nSarah Rumpf-Whitten is a breaking news writer for Fox News Digital and Fox Business.\nStory tips and ideas can be sent to sarah.rumpf@fox.com and on X:@s_rumpfwhitten."}, {"source": "foxnews", "title": "Ric Grenell under consideration to be Trump's point man on Ukraine: report", "link": "https://www.foxnews.com/politics/ric-grenell-under-consideration-trumps-point-man-ukraine-report", "content": "Fox News senior strategic analyst Gen. Jack Keane (Ret.) joins 'Fox & Friends' to discuss the escalation after a former Ukrainian military official declared 'WWIII has begun.'\nRichard \"Ric\" Grenell, the former actingdirector of National Intelligencein President-elect Trump's first administration, is reportedly under consideration to be special envoy for the Russia-Ukraine conflict.\nCurrently, there is no special envoy responsible for bringing an end to the war in Eastern Europe. Trump is strongly considering whether to create the role, Reuters reported, citing four sources familiar with the president's deliberations.\nIf he does create the new position, Grenell is said to be a leading candidate, though Trump may select someone else, the sources told Reuters. There is also no guarantee that Grenell would accept the position if it were offered to him, the sources reportedly said.\nHERE ARE THE MOST TALKED-ABOUT CANDIDATES FOR TOP POSTS IN TRUMP'S ADMINISTRATION\nRic Grenell, former acting director of National Intelligence, during the closing campaign event with former US President Donald Trump, not pictured, at Van Andel Arena in Grand Rapids, Michigan, on Monday, Nov. 4, 2024.(Sarah Rice/Bloomberg via Getty Images)\nFox News Digital was previously told Grenell was under consideration to be U.S. Secretary of State. Florida Sen.Marco Rubiowas instead named to lead the State Department.\nNeither Grenell nor the Trump transition team responded to requests for comment.\nGET TO KNOW DONALD TRUMP'S CABINET: WHO HAS THE PRESIDENT-ELECT PICKED SO FAR?\nFormer Acting Director of National Intelligence of the U.S. Richard Grenell, Sen. Mike Lee (R-UT), U.S. Republican presidential nominee, former President Donald Trump and conservative radio host Glenn Beck participate in a private roundtable discussion during a campaign rally at Findlay Toyota Center on October 13, 2024, in Prescott Valley, Arizona.(Rebecca Noble/Getty Images)\nTrump repeatedly made campaign promises to quickly resolve the conflict between Russia and Ukraine, if elected, although he has never laid out a specific plan to end the war.\nGrenell, an outspoken Trump loyalist, has made statements in the past that may be of concern to Ukrainian leadership.\n‘NEW’ RUSSIAN MISSILE USED AGAINST UKRAINE NOT HYPERSONIC, DEFENSE OFFICIALS SAY\nFormer Acting Director of National Intelligence Ric Grenell speaks on stage on the third day of the Republican National Convention at the Fiserv Forum on July 17, 2024, in Milwaukee, Wisconsin.(Chip Somodevilla/Getty Images)\nDuring a Bloomberg round table in July, he advocated for the creation of \"autonomous zones\" as a means of settling the conflict, which began after Russia invaded Ukrainian sovereign territory. He also suggested he would not be in favor of Ukraine joining the North Atlantic Treaty Organization in the immediate future, a position he shares with many Trump allies.\nGrenell's supporters note he has had a long diplomatic career and has a deep knowledge of European affairs. In addition to serving as ambassador to Germany, Grenell was also a special presidential envoy for Serbia and Kosovo peace negotiations.\nCLICK TO GET THE FOX NEWS APP\nPrior to working for the first Trump administration, Grenell was a U.S.State Departmentspokesman to the United Nations under President George W. Bush. He has advised various Republican candidates and was a foreign policy spokesman for Mitt Romney during the 2012 presidential campaign.\nGrenell was previously a Fox News contributor.\nReuters contributed to this report.\nChris Pandolfo is a breaking news reporter for Fox News Digital. Send tips to chris.pandolfo@fox.com and follow him on Twitter @ChrisCPandolfo."}, {"source": "foxnews", "title": "MSNBC contributor trashes network, shreds 'Morning Joe' colleagues over Trump meeting: 'This is not working'", "link": "https://www.foxnews.com/media/msnbc-contributor-trashes-network-shreds-morning-joe-colleagues-trump-meeting", "content": "Washington Post columnist Jennifer Rubin went viral for the messaging advice she offered to Democrats.\nMSNBC contributor Jennifer Rubin went on an unprecedented tear against her own network as well as her \"Morning Joe\" colleagues Joe Scarborough and Mika Brzezinski on her podcast, defiantly criticizing her employer's business model and ratcheting up her attacks towards the duo for revealing their meeting with President-elect Donald Trump.\nOn Friday's installment of \"Jen Rubin's Green Room,\" Rubin accused Scarborough and Brzezinski of \"forgetting\" that their audience \"despises Trump\" and that viewers wanted them to \"hold the line against Trump\" instead of engaging with the incoming president.\n\"What were they thinking? Who do they think their audience was?\" Rubin asked. \"Well, perhaps this wasn't about their audience. Perhaps this was them trying to defend themselves or avoid retribution that they thought was coming their way. But really, these are rich, famous people. What have they got to worry about? It was just an appalling example at how eager so many elites are to fall in line, to curry favor, to deflect attention, to deflect any kind of incoming criticism that might come their way from the White House.\"\nMSNBC CONTRIBUTOR FUELS ‘MORNING JOE’ BOYCOTT AFTER TRUMP MEETING: THEY DON'T ‘APPRECIATE’ THEIR AUDIENCE\nMSNBC contributor Jennifer Rubin continued lobbing attacks towards her \"elite\" colleagues Mika Brzezinski and Joe Scarborough over their meeting with President-elect Donald Trump.(William B. Plowman/NBC/NBC Newswire/NBCUniversal via Getty Images; Dia Dipasupil/Getty Images)\n\"So they are getting hammered for it. They are hemorrhaging their audience. And this, of course, only exacerbates the reason and the problem why MSNBC and its other cable networks are being spun off. And that is, cable television is dying,\" Rubin said. \"Most of you probably haven't watched MSNBC since the election either, and not understanding your audience and continuing to serve up the same chewed-over talking points with the same panels, essentially same program day, after day, after day, hour after hour, is no longer working. So Comcast has said, 'Fine, spin you off. You guys go fend for yourselves. And the question after the spin-off is completed will be whether that's a viable business model. Can they afford to pay Rachel Maddow, God bless her, 20 plus million dollars a year? Is there advertising to support that? Are there cable fees to support that? We don't know. We don't know if MSNBC, a year from now, is gonna exist, or whether it's gonna be in some slim down fashion.\"\nWASHINGTON POST COLUMNIST CLAIMS ‘REPUBLICANS WANT TO KILL YOUR KIDS: ’IT'S ACTUALLY TRUE'\nRubin, also a Washington Post columnist, went on by offering suggestions on how MSNBC can \"rethink their model.\"\n\"Get rid of the pattern of chewing over the same three or four stories all day long with a shuffling of panelists all parroting back the same line to the host, this is not working. It's boring. It's not good TV. They need to do something else, and they should look to models that are successful,\" Rubin said. \"They should look to people like The Onion. Hey, they've purchased Info Wars. I can't wait to watch what they're gonna program. They should look to shows that, yes, are perhaps lighter on the news, but actually have much more information than they do.\"\nRubin took several swipes at her employer MSNBC on her podcast.(Kim Kulish/Corbis via Getty Images)\nShe went on to say that viewers \"get more from a John Oliver monologue\" than they do \"from a day or two of watching CNN or MSNBC.\"\n\"And by the way, I'm an MSNBC contributor,\" Rubin reminded her liberal audience. \"At least I have the honesty, I have the candor, to tell you this is not gonna work, and this is not continuing to work. And what's more, by hanging on to these legacy outlets that are failing, I think Democrats fail to explore other options. They fail to look for other avenues to communicate with the public. They are relying on dying outlets in a dying industry, cable TV news, and they have to be way more innovative, way more creative in figuring out ways to reach people, including people who don't like politics all that much, and that's the big challenge. Those were the people who, frankly, went along voting for Trump because they did not know too much about what he had in mind and what he had planned, and really his threat to their well-being.\"\nMSNBC'S FUTURE A ‘BIG CONCERN’ FOR STAFFERS AS COMCAST MOVES TO SEPARATE LIBERAL NETWORK FROM NBCUNIVERSAL\n\"So I think once we get past a stage in which we are doing the same thing over and over again, otherwise known as the definition of insanity- if you expect a different result, then perhaps we can experience some innovation, and maybe we can expect something better from news… But you know one thing, you can always come here, because I'm gonna tell you what I think. I'm gonna be provocative…  We're gonna tell the truth. We're gonna talk to you. I want to hear from you, because unlike Mika and Joe, I care about my audience, and I wanna hear what you think,\" Rubin added.\nRubin did not immediately respond toFox News Digital's request for comment. A spokesperson for MSNBC declined to comment.\nRubin said viewers \"get more from a John Oliver monologue\" than they do \"from a day or two of watching CNN or MSNBC.\"(William B. Plowman/NBC/NBC Newswire/NBCUniversal via Getty Images)\nWhile Rubin is currently urging MSNBC to get rid of the formula of \"panelists all parroting back the same line to the host,\" she was notablyvocal against NBC's hiringof former RNC chairwoman Ronna McDaniel (she was fired following swift backlash from the network's liberal stars).\nRuben previously fueled a boycott against \"Morning Joe.\"\n\"The market works great. You can stop watching Morning Joe anytime,\" Rubinwroteon social media Monday.\nShe then added on thesocial media site BlueSky:, \"On MJ: If you don't appreciate the audience you have, betray that audience and lose their trust you are [going] to lose lots of them. I have seen this movie.\"\nCLICK HERE TO GET THE FOX NEWS APP\nRubin was also outspoken against her other employer The Washington Post and its billionaire over Jeff Bezos over his decision to halt the paper's endorsement of Vice President Kamala Harris just days before the election.\n\"First of all, I do not believe the reason stated. I don't believe they have suddenly decided— he has suddenly decided that we should endorse everybody except presidential candidates, and that of all the elections, this is the one to start with this new policy,\" Rubinsaid on her podcast last month. \"We endorsed a presidential candidate in 2020 no problem. And I perceive this, and even if it's not intended, it is inevitably perceived as bending the knee to Donald Trump at the worst possible moment when democracy is on the line.\"\n\"You have a billionaire who has a business aside from the Post that does business with the federal government deciding not to run afoul of a man who has declared war on democracy and on the free press, and I still find it absolutely inconceivable that someone who owns a newspaper would do this,\" she continued.\"\nJoseph A. Wulfsohn is a media reporter for Fox News Digital. Story tips can be sent to joseph.wulfsohn@fox.com and on Twitter: @JosephWulfsohn."}, {"source": "foxnews", "title": "Bill Maher vows he won't 'pre-hate' incoming Trump administration: 'Let's see what the disruptors can do'", "link": "https://www.foxnews.com/media/bill-maher-says-he-wont-pre-hate-incoming-trump-administration-lets-see-what-disruptors-can-do", "content": "‘Outnumbered' panelists discuss the newly formed Department of Government Efficiency’s plans to overhaul government spending.\n\"Real Time\" hostBill Mahervowed that he wouldn't \"pre-hate\" the incoming Trump administration despite his own personal animosity towards President-elect Donald Trump.\n\"They are calling themselves the ‘disruptors,'\" Maher began during a panel discussion Friday night. \"The country does need disrupting. I mean, the country needs a colonic and a slap in the face so bad.\n\"This is not who I would choose to administer the colonic, but it's not like the bureaucracy isn't bloated. It's not like the debt isn't $36 trillion. It's not like there aren't thousands of regulations that do stop people from living lives that they could live better and don't do anything. There is woke in the military. Whatever they're going after… I'm not going to pre-hate anything,\" Maher said.\n\"Do I have really good, optimistic feelings about it? No, I don't. I'm just not gonna pre-hate. I can't get into that mind[set]. Let's see what the disruptors can do. Because, quite frankly, the experts have just sort of, like, let something go for so long that it's just sclerotic now and constipated.\"\nBILL MAHER SAYS ‘MY HEAD’S NOT EXPLODING' OVER TRUMP PICKING RFK JR. FOR HHS: ‘WE DO NEED SHAKING UP’\n\"Real Time\" host Bill Maher vowed to not \"pre-hate\" the incoming Trump administration, saying \"Let's see what the disruptors can do.\"(Screenshot/HBO)\nThe HBO star offered some skepticism towards how effective the \"disruptors\" will be when the \"corn lobby,\" \"pharmaceutical industry\" and \"defense contractors\" begin voicing their objections towards the administration's policies.\n\"Let's see what happens,\" Maher said.\nMAHER BLASTS LEFT ‘DOUBLING DOWN’ ON WHAT ‘F---ED’ THEM IN ELECTION: ‘TAKE ONE WEEK TO ASK WHAT YOU DID WRONG’\nLater in the conversation, Maher conceded that Trump was correct in his assessment on how to resolve the Russia-Ukraine war after mentioning the Biden administration allowing Ukraine to fire US-made missiles into Russia, fueling fears of further escalation by the Kremlin.\n\"It just looks like everybody's coming on board to the idea that, I hate to admit it, Trump said at the beginning, it's gonna be a negotiated settlement. Marco Rubio was saying- he's going to be Secretary of State,\" Maher said. \"And I feel like – that they are losing the war, Ukraine. And they are noble, and we support them, certainly in spirit, should we do it as we have been?\"\nMaher admitted that President-elect Donald Trump was right about his stance that the Russia-Ukraine war ends through negotiations versus aiding Ukraine.(AP Photo/Evan Vucci, File)\nHe went on to compare the ongoing war to last week'shighly-watched boxing matchbetween 27-year-old influencer Jake Paul and 58-year-old boxing legend Mike Tyson.\n\"I remember a week ago, and I was leaving here, everyone was talking about it. 'Oh, what's gonna happen?' And then you saw the fight and you realize- we kind of really knew in the rational part of our brain from the beginning that a 58-year-old man who was over the hill in the '90s was not gonna beat this [27]-year-old behemoth. And yet we all were like, ‘Maybe – oh, I’m gonna go home and watch it!' Maher said.\nCLICK HERE FOR THE LATEST MEDIA AND CULTURE NEWS\nMaher compared the ongoing Russia-Ukraine war to the recent boxing match between 27-year-old Jake Paul and 58-year-old Mike Tyson.(AP Photo/Julio Cortez)\nCLICK HERE TO GET THE FOX NEWS APP\nLast week, Maher appeared open-minded about the prospect of Robert F. Kennedy Jr.leading the Department of Health and Human Services, saying \"we do need shaking up.\"\n\"Well, the system as it is, the way we do health, is already very f---ed,\" Maher said. \"So maybe he'll make it worse. But, like, my head is not exploding about it.\"\nJoseph A. Wulfsohn is a media reporter for Fox News Digital. Story tips can be sent to joseph.wulfsohn@fox.com and on Twitter: @JosephWulfsohn."}, {"source": "foxnews", "title": "Who is Pam Bondi, Trump's new pick for attorney general?", "link": "https://www.foxnews.com/politics/who-pam-bondi-trumps-new-pick-attorney-general", "content": "Fox News’ Brooke Singman reports on Trump’s latest Cabinet pick after Matt Gaetz withdraws his attorney general nomination.\nJust hours afterformer Florida Congressman Matt Gaetzwithdrew his name from consideration to be attorney general, President-elect Trump tapped former Florida Attorney General Pam Bondi as his AG nominee.\n\"For too long, the partisanDepartment of Justicehas been weaponized against me and other Republicans – Not anymore,\" Trump wrote in his announcement. \"Pam will refocus the DOJ to its intended purpose of fighting Crime, and Making America Safe Again.\n\"I have known Pam for many years – She is smart and tough, and is an AMERICA FIRST Fighter, who will do a terrific job as Attorney General!\"\nBondi chairs the Center of Litigation and co-chairs the Center for Law and Justice at the America First Policy Institute.\nPRESIDENT-ELECT TRUMP ANNOUNCES PAM BONDI AS HIS NEW PICK FOR US ATTORNEY GENERAL\nHere's what to know about Trump's new AG pick:\nBondi, 59, is a Tampa native and earned her bachelor's degree in criminal justice from the University of Florida and her law degree from Stetson Law School. She was admitted to the Florida Bar in 1991.\nShe worked as a prosecutor out of the Hillsborough County State Attorney's Office for more than 18 years, trying a variety of cases fromdomestic violence to murder.\nAfter former Florida Congressman Matt Gaetz withdrew his name from consideration to be attorney general, President-elect Trump tapped former Florida Attorney General Pam Bondi as his AG nominee.(Tom Williams/CQ-Roll Call, Inc via Getty Images)\nBondi made history in 2010 as the state's first female attorney general. Her campaign emphasized challenging the Affordable Care Act, also known as Obamacare, and later focused on human trafficking issues once in office. She also notably shut down pill mills and tackled the state's opioid crisis.\nShe held the post until 2019.\nBondi worked as one ofTrump's defense lawyersin 2020 after he was first impeached on allegations that he had abused his power and obstructed Congress.\n\"They have not charged the president with any crime because the president did nothing wrong,\" Bondi said when articles of impeachment were sent by the House to the Senate. \"There was no crime. The transcript of that phone call speaks for itself.\"\nMATT GAETZ WITHDRAWS FROM CONSIDERATION TO SERVE AS ATTORNEY GENERAL\nBondi also worked on Trump's Opioid and Drug Abuse Commission during his first administration. In her role on the commission, Bondi collaborated with national leaders on drug prevention and treatment.\nBondi is a partner at Ballard Partners, a Florida-based lobbying firm founded by Brian Ballard. Bondi splits her time between Florida and Washington, D.C., chairing the firm's corporate regulatory practice.\nTrump's incoming chief of staff, Susie Wiles, is also linked to the firm after becoming a partner there after Trump's 2016 victory.(Getty)\nThe D.C. office notably earned more than $70 million in lobbying fees during Trump's first term by representing various corporate clients, according to federal disclosures.\nTrump's incoming chief of staff, Susie Wiles, also works for the firm after becoming a partner there following Trump's 2016 victory.\nWITH GAETZ DROPPING OUT, DO HEGSETH, RFK JR. AND GABBARD NOW HAVE BIGGER TARGETS ON THEIR BACKS?\nBondi has been vocal in her criticism about Trump's prosecutions, going so far as appearing alongside Trump inNew York Cityduring his hush money trial.\nBondi has been vocal in her criticism over prosecutions of Trump, going as far as appearing alongside the former president in New York City during his hush money trial.(Getty)\n\"They make it sound like it's a first-degree murder case, and I've tried plenty of trial cases, Trace, and never seen anything like this,\" Bondi told Fox News host Trace Gallagher in April, shortly after Trump was issued a gag order in his New York case.\nCLICK HERE TO GET THE FOX NEWS APP\n\"They're trying to gag him not only of his First Amendment rights but of defending himself,\" Bondi said at the time.\nFox News Digital's Chris Pandolfo contributed to this report.\nHaley Chi-Sing is a Writer for Fox News Digital. You can reach her at @haleychising on X."}, {"source": "foxnews", "title": "Director of iconic Cold War thriller ‘Red Dawn’ is 'very happy' Trump won, daughter says", "link": "https://www.foxnews.com/media/director-iconic-cold-war-thriller-red-dawn-john-milius-very-happy-trump-won-daughter-says", "content": "Actor Robert Davi reacts to President-elect Trump's victory and the reactions from Hollywood.\nIconic director John Milius was thrilled about President-electDonald Trump's victory, according to his daughter.\n\"Obviously he was very happy,\" Amanda Milius, a filmmaker and former Trump administration official, toldFox News Digitalin an exclusive interview. \"We agreed that we both had – and I think a lot of people who felt this way – had like more of a sense of relief than this, like, exuberant, overjoyed excitement, which is what we all felt in 2016.\"\nJohn Milius, the director of 1980s classics like \"Red Dawn\" and \"Conan the Barbarian\" as well as the Oscar-nominated screenwriter of \"Apocalypse Now,\" has kept a relatively lower profile in recent years following a stroke he suffered in 2010. But Amanda says he keeps up with politics as much as ever.\n\"My dad's been a Trump guy, honestly, since 2014,\" Amanda said. \"My dad has been on Team Trump since, like, the moment you could be.\"\n‘FAMILY TIES’ STAR JUSTINE BATEMAN SAYS TRUMP'S ELECTION LIFTED ‘SUFFOCATING CLOUD’ ON FREE SPEECH\n\"Red Dawn\" director John Milius was \"very happy\" about President-elect Donald Trump's victory, according to his daughter Amanda.(Greg Doherty/Getty Images for Asian World Film Festival)\nAmanda told Fox News Digital that unlike most in liberal Hollywood, her father didn't think so fondly of Vice PresidentKamala Harris.\n\"He hated her!\" Amanda chuckled. \"I mean, he was just laughing at the idea of it. He just thought it was ridiculous. He thought the concept of Kamala Harris being president… he has a very over-the-top way of putting things… but he basically said that anyone who would consider voting for her for president was just an idiot. He's like, 'There's no – there's no way this can be serious.' Like, it was just as unserious as Joe Biden. It was the whole thing was unserious.\"\n\"He had, I think, a bit more vitriol for Hillary [Clinton] because, you know, she'd been around longer and he'd had more time to form opinions about her. But he was not impressed, I guess we can say that,\" she added.\nMAHER BLASTS LEFT ‘DOUBLING DOWN’ ON WHAT ‘F---ED’ THEM IN ELECTION: ‘TAKE ONE WEEK TO ASK WHAT YOU DID WRONG’\nAmanda Milius says her father, filmmaker John Milius, has been a \"Trump guy\" before the president-elect even launched his first bid for the White House.(Joshua Blanchard/Getty Images for EPIX)\nAmanda described her father as \"always [being] on the outside politically of Hollywood\" but was never fond of fellow filmmakers and entertainers weighing in on politics. And in 2024, Harris had some of the biggest names rallying behind her from Oprah Winfrey, Meryl Streep, George Clooney, and Julia Roberts to music stars like Beyoncé, Bruce Springsteen and Lady Gaga.\n\"He's always felt free to be even more outwardly right wing than I think he normally would have if Hollywood wasn't so overtly left wing. Because he's like a very contrarian personality,\" Amanda told Fox News Digital. \"If Hollywood was just sort of a mix of normal people, he probably wouldn't have felt such a need to be so vocally right wing. But because it was so left, he just went farther to the right.\"\n\"He rolls his eyes with the rest of us when Hollywood comes out and supports a candidate,\" she said.\nBILL MAHER PANS MEDIA'S EXCUSES FOR KAMALA HARRIS' DEFEAT: AMERICA JUST ‘DIDN’T LIKE' HER\nMartin Sheen (L) and John Milius attend the \"Apocalypse Now\" Final Cut 40th Anniversary Special Screening at ArcLight Cinemas Cinerama Dome on August 12, 2019 in Hollywood, California.(Michael Kovac/Getty Images for myCinema)\nCLICK HERE TO GET THE FOX NEWS APP\nAmanda Milius served in the first Trump administration in the White House and the State Department, something she said made her father \"very thrilled.\"\nShe also followed in her father's footsteps as the director of the 2020 documentary \"The Plot Against the President.\"\nJoseph A. Wulfsohn is a media reporter for Fox News Digital. Story tips can be sent to joseph.wulfsohn@fox.com and on Twitter: @JosephWulfsohn."}, {"source": "foxnews", "title": "Get to know Donald Trump's Cabinet: Who has the president-elect picked so far?", "link": "https://www.foxnews.com/politics/trumps-picks-so-far-heres-who-advising-new-president", "content": "Former Deputy Assistant Defense Secretary Elbridge Colby discusses what to expect in the Middle East under President-elect Trump on ‘The Story.’\nSince winning the election last week,President-elect Donald Trumphas begun evaluating and rolling out his picks for his Cabinet and other top roles.\nHere’s a roundup of whom Trump has picked to fill top jobs in his administration:\nWhite House Chief of Staff – Susie WilesU.S. Ambassador to the United Nations – Elise StefanikNational Security Adviser – Michael Waltz\"Border Czar\" – Tom HomanAmbassador to Israel – Mike HuckabeeEnvironmental Protection Agency Administrator – Lee ZeldinMiddle East Envoy – Steven WitkoffWhite House Counsel – William McGinleyCIA Director – John RatcliffeDepartment of Government Efficiency – Elon Musk, Vivek RamaswamySecretary of Defense – Pete HegsethHomeland Security Secretary – Kristi NoemDeputy Chief of Staff – Dan ScavinoDeputy Chief of Staff for Policy and Homeland Security Advisor – Stephen MillerDeputy Chief of Staff for Legislative, Political and Public Affairs – James BlairDeputy Chief of Staff for Communications and Personnel – Taylor BudowichDirector of National Intelligence – Tulsi GabbardSecretary of State – Marco RubioU.S. Attorney General – Pam BondiSecretary of Health and Human Services – Robert F. Kennedy Jr.U.S. Attorney for Southern District of New York – Jay ClaytonSecretary of Veterans Affairs – Doug CollinsU.S Solicitor General – Dean John SauerDeputy Attorney General – Todd BlancheSecretary of the Interior – Doug BurgumCommunications Director – Steven CheungDirector of Presidential Personnel – Sergio GorPress Secretary – Karoline LeavittAssistant to the President and Staff Secretary – William Owen ScharfSecretary of Energy – Chris WrightChairman of the Federal Communications Commission – Brendan CarrSecretary of Transportation – Sean DuffySecretary of Commerce – Howard LutnickCenters for Medicare and Medicaid Services Administrator – Dr. Mehmet OzSecretary of Education – Linda McMahonAmbassador to NATO – Matthew WhitakerTreasury Secretary – Scott BessentOffice of Management and Budget – Russ VoughtSecretary of the Department of Housing and Urban Development – Scott TurnerLabor Secretary –Lori Chavez-DeRemerDirector of CDC – Dave WeldonFDA commissioner – Marty MakarySurgeon General – Janette NesheiwatDeputy Assistant to the President and Senior Director for Counterterrorism – Sebastian GorkaAssistant to the President and Principal Deputy National Security Advisor – Alex WongSecretary of Agriculture – Brooke Rollins\nWiles has been widely laudedfor heading Trump’s successful campaign this year, having run Trump’s campaign operations in Florida in 2016 and 2020. She maintained close ties with the president-elect throughout the Biden administration and signed on as CEO of Trump’s Save America PAC in 2021.\n\"Susie is tough, smart, innovative and is universally admired and respected. Susie will continue to work tirelessly to Make America Great Again. It is a well deserved honor to have Susie as the first-ever female Chief of Staff in United States history. I have no doubt that she will make our country proud,\" Trump said in a statement.\nTrump picked campaign manager Susie Wiles for his chief of staff.(AP Photo/Alex Brandon)\nTHESE ARE THE TOP NAMES IN CONTENTION FOR DEFENSE SECRETARY UNDER TRUMP\nElise Stefanik, the New York Republican representative and current House GOP Conference Chair has been an attack dog for Trump in Congress.\nShe is a staunch supporter of Israel, having made headlines for her combative lines of questioning of Ivy League university presidents over their handling of anti-Israel protests, some of which prompted the presidentsto resign.\nPresident-elect Trump picked Rep. Elise Stefanik, R-N.Y., to be the next ambassador to the United Nations.(Angela Weiss/AFP via Getty Images)\nOn Tuesday, Trump announced the Florida Republican representative and former Army Green Beret would be his national security adviser. He’s decidedly a hawkon Chinaand Iran.\n\"Mike retired as a Colonel, and is a nationally recognized leader in National Security, a bestselling author, and an expert on the threats posed by China, Russia, Iran, and global terrorism,\" Trump said in a statement.\n\"Mike has been a strong champion of my America First Foreign Policy agenda, and will be a tremendous champion of our pursuit of Peace through Strength!\"\nOn Tuesday, Trump announced Rep. Michael Waltz, a Florida Republican and former Army Green Beret, would be his national security adviser.(John Nacion/Getty Images)\nHoman, theformer acting director of U.S. Immigration and Customs Enforcement, was an architect of Trump's zero-tolerance policy during his first administration, one that led to backlash from family separations at the border.\nHoman has served under six administrations and presidents in both parties, dating back to the Reagan era, as a rank-and-file Border Patrol agent. He was appointed to the position of executive associate director of enforcement and removal operations for ICE under President Obama.\nWhile serving at a \"czar\" level rather than in an official Cabinet position, Homan will be in charge of \"the Southern Border,the Northern Border, all Maritime, and Aviation Security,\" Trump announced on Truth Social.\n\"I’ve known Tom for a long time, and there is nobody better at policing and controlling our Borders,\" Trump wrote. \"Likewise, Tom Homan will be in charge of all Deportation of Illegal Aliens back to their Country of Origin. Congratulations to Tom. I have no doubt he will do a fantastic, and long awaited for, job.\"\nTom Homan has been tapped by President-elect Trump to be his \"border czar.\"(Bill Clark/CQ-Roll Call, Inc via Getty Images)\nHuckabee, the former governor of Arkansas, is a staunch supporter of Israel, prompted by his evangelical faith.\n\"Mike has been a great public servant, Governor, and Leader in Faith for many years. He loves Israel, and the people of Israel, and likewise, the people of Israel love him\", a statement attached to Trump’s Truth Social post said. \"Mike will work tirelessly to bring about Peace in the Middle East!\"\nFormer Arkansas Gov. Mike Huckabee will be Trump's ambassador to Israel.(Chip Somodevilla/Getty Images)\nZeldin, a former House Republican from New York, had a notably strong, but unsuccessful, showing in the race for governor against Kathy Hochul in 2022.\nDuring that race, he called for New York to lift its ban on fracking.\nPrior to running for governor, Zeldin served as a U.S. Congressman for eight years. During that time, Zeldin served on the House Foreign Affairs and House Financial Services committees. He also championed infrastructure and research projects like the preservation of Plum Island and Army Corps of Engineers initiatives.\nLee Zeldin will lead the EPA.(Lev Radin/Pacific Press/LightRocket via Getty Images)\nWitkoff, a real estate investor, landlord, and the founder of the Witkoff Group, was tapped as Trump's Middle East enjoy. He campaign with Trump during the campaign.\nIn his announcement, Trump said that Witkoff would be an \"unrelenting Voice for PEACE\" in the highly-contentious region.\nSteve Witkoff, founder and chief executive officer of Witkoff Group LLC, speaks during a campaign event for Republican presidential nominee former President Trump at Madison Square Garden in New York City, Oct. 27.(Adam Gray/Bloomberg via Getty Images)\nMcGinley, whoserved in Trump's first presidential termas White House cabinet secretary, returns to the White House for Trump's second term. The White House Counsel conducts key behind-the-scene research into potential Supreme Court nominees.\nWilliam J. McGinley speaks at an event in Washington, D.C.(Tom Williams/Roll Call/Getty Images)\nRatcliffe previously served under Trumpduring his first term as Director of National Intelligence (DNI). He will head the Central Intelligence Agency (CIA).\nIn 2020, he was awarded the National Security Medal, the nation’s highest honor for distinguished achievement in the field of intelligence and national security.\nJohn Ratcliffe is President-elect Trump's pick to lead the CIA.(Getty Images)\nBillionaireElon Muskand former GOP presidential candidate Vivek Ramaswamy were tapped to lead the Department of Government Efficiency, or DOGE.\nTrump said that the pair will work together to \"dismantle Government Bureaucracy, slash excess regulations, cut wasteful expenditures, and restructure Federal Agencies.\"\n\"It will become, potentially, ‘The Manhattan Project’ of our time,\" the announcement on Tuesday evening said. \"Republican politicians have dreamed about the objectives of ‘DOGE’ for a very long time.\"\nVivek Ramaswamy and Elon Musk have been tapped by President-elect Donald Trump to lead the Department of Government Efficiency.(Getty Images/AP Images)\nTrump nominated Hegseth to lead the Department of Defense. He would need to be confirmed by the Senate to assume the position. Hegseth has long championed a strong military and veterans causes.\nHe served in Iraq and Afghanistan as an Army infantry officer, being awarded two Bronze Stars and the Combat Infantryman's Badge. Hegseth was a host on \"FOX & Friends Weekend\" and FOX Nation until his last day on Tuesday.\n\"Nobody fights harder for the Troops, and Pete will be a courageous and patriotic champion of our ‘Peace through Strength’ policy,\" Trump said.\nPete Hegseth has been tapped by Trump to be his secretary of defense.(Roy Rochlin/Getty Images)\nTrump announced on Tuesday that South Dakota GovernorKristi Noemis his pick for secretary of the Department of Homeland Security. Noem would need to be approved by the Senate to assume the position.\nDHS oversees U.S. Customs and Border Protection, Immigration and Customs Enforcement, the U.S. Secret Service and the Federal Emergency Management Agency.\n\"She was the first Governor to send National Guard Soldiers to help Texas fight the Biden Border Crisis, and they were sent a total of eight times,\" the Trump transition team said in a statement on Tuesday. \"She will work closely with ‘Border Czar’ Tom Homan to secure the Border, and will guarantee that our American Homeland is secure from our adversaries.\"\nGov. Kristi Noem, R-N.D., speaking during the Republican National Convention in Milwaukee, July 15.(AP Photo/J. Scott Applewhite)\nGOP REP. MIKE WALTZ TAPPED TO BE TRUMP'S NATIONAL SECURITY ADVISER\nTrump announced that his longtime aide Dan Scavino Jr. will return to the White House as an assistant to the president and deputy chief of staff.\n\"Scavino was a Trump Campaign Senior Advisor and remains one of President Trump's longest serving and most trusted aides,\" the Trump transition team said.\nFormer White House deputy chief of staff Dan Scavino arrives at the Republican National Convention in Milwaukee, July 15.(AP Photo/Paul Sancya)\nTrump announced Stephen Miller would serve as deputy chief of staff for policy in his administration. Miller was a senior adviser in Trump’s first term. He helped craft many of Trump’s hard-line speeches and plans on immigration.\nSince Trump left office, Miller has served as the president ofAmerica First Legal, an organization of former Trump advisers fashioned as a conservative version of the American Civil Liberties Union, challenging the Biden administration, media companies, universities and others over issues such as freedom of speech and religion and national security.\nMiller has advocated for mass deportations during the second Trump term.\nStephen Miller, former Senior Advisor to President Trump, speaks at a campaign rally for Trump in Detroit, Oct. 18.(Win McNamee/Getty Images)\nTrump announced James Blair would serve in the White House as an assistant to the president and deputy chief of staff for legislative, political and public affairs.\n\"Blair was the Trump Campaign and Republican National Committee Political Director, managing hundreds of staff and overseeing a wide portfolio of political operations and programs,\" the Trump transition team said.\nBlair was in charge of the Trump campaign's get-out-the-vote operations in key battleground states, which Trump swept on Election Day.\nTrump announced that Taylor Budowich will join him in the White House as an assistant to the president and deputy chief of staff for communications and personnel.\n\"Prior to joining the Trump Campaign, Budowich served in a senior role in President Trump’s Leadership PAC, Save America, and as CEO of the pro-Trump Super PAC, MAGA Inc.,\" the Trump transition team said.\n\"Dan, Stephen, James, and Taylor were 'best in class' advisors on my winning campaign, and I know they will honorably serve the American people in the White House,\" Trump said in a statement announcing his senior campaign aides would be promoted to the White House. \"They will continue to work hard to Make America Great Again in their respective new roles.\"\nTaylor Budowich, a former spokesman for President-elect Trump and founder of MxM News app.(X)\nTulsi Gabbard,a former Democratic congresswoman from Hawaii, is Trump's pick for the position of director of national intelligence. The announcement was made on Wednesday.\nThe cabinet-level position involves overseeing the intelligence community and advising Trump and the National Security Council on intelligence matters. Gabbard is an Iraq War veteran and a U.S. Army reservist.\n\"As a former Candidate for the Democrat Presidential Nomination, she has broad support in both Parties - She is now a proud Republican!\" Trump said in a statement. \"I know Tulsi will bring the fearless spirit that has defined her illustrious career to our Intelligence Community, championing our Constitutional Rights, and securing Peace through Strength. Tulsi will make us all proud!\"\nTulsi Gabbard, former U.S. Representative from Hawaii, speaks during the Palmetto Family Council's Vision 24 national conservative policy forum in North Charleston, S.C., March 18, 2023.(Sam Wolfe/Bloomberg via Getty Images)\nPresident-electDonald Trumpnominated Sen. Marco Rubio, R-Fla., to serve as his Secretary of State.\n\"It is my Great Honor to announce that Senator Marco Rubio, of Florida, is hereby nominated to be The United States Secretary of State. Marco is a Highly Respected Leader, and a very powerful Voice for Freedom,\" Trump said in a statement. \"He will be a strong Advocate for our Nation, a true friend to our Allies, and a fearless Warrior who will never back down to our adversaries.\"\nRubio is knownas anIran and China hawk. He is a top GOP member of the Senate Intelligence Committee and ran for president in 2016.\nSen. Marco Rubio, R-Fla., attends a campaign rally for former President Donald Trump at the Trump National Doral Golf Club in Doral, Fla., July 9.(Joe Raedle/Getty Images)\nTrumpannounced Thursday evening that he's nominating former attorney general of Florida Pam Bondi as the next attorney general of the United States.\nTrump's latest Cabinet pick replaces Matt Gaetz, the former Florida representative and nominee for attorney general, who on Thursday withdrew as Trump's pick for the top prosecutor after the \"distraction\" his nomination had caused due to a swirl of allegations about paying underage women for sex.\n\"For too long, the partisan Department of Justice has been weaponized against me and other Republicans - Not anymore. Pam will refocus the DOJ to its intended purpose of fighting Crime, and Making America Safe Again,\" Trump said. \"I have known Pam for many years — She is smart and tough, and is an AMERICA FIRST Fighter, who will do a terrific job as Attorney General!\"\nShortly after the announcement, Gaetz said on X that Bondi is \"a stellar selection\" by Trump for attorney general.\n\"Pam and I worked closely together when she was Florida’s Attorney General and I chaired Criminal Justice in the state house,\" Gaetz wrote. \"She’s a proven litigator, an inspiring leader and a champion for all Americans. She will bring the needed reforms to DOJ.\"\nFormer Florida Attorney General Pam Bondi stands on stage in an empty Mellon Auditorium while addressing the Republican National Convention on August 25, 2020 in Washington, DC. The novel coronavirus pandemic has forced the Republican Party to move away from an in-person convention to a televised format, similar to the Democratic Party's convention a week earlier.(Chip Somodevilla/Getty Images)\nTrump named his personal criminal defense attorney Todd Blanche as deputy attorney general. The president-elect said that the 50-year-old lawyer has experience prosecuting gangs – as well as representing Trump in his 2024 criminal trial in New York.\n\"I am pleased to announce that Todd Blanche will serve as Deputy Attorney General in my Administration. Todd is an excellent attorney who will be a crucial leader in the Justice Department, fixing what has been a broken System of Justice for far too long,\" Trump announced in a news release.\nAttorney Todd Blanche listens as his client former U.S. President Donald Trump speaks as he arrives for his hush money trial at Manhattan Criminal Court on May 30, 2024 in New York City.(Michael M. Santiago/Getty Images)\nTrump announced he will tap former 2024 Democratic presidential candidate Robert F. Kennedy Jr. to lead the Department of Health and Human Services.\n\"I am thrilled to announce Robert F. Kennedy Jr. as The United States Secretary of Health and Human Services (HHS). For too long, Americans have been crushed by the industrial food complex and drug companies who have engaged in deception, misinformation, and disinformation when it comes to Public Health,\" Trump said in his announcement Thursday.\n\"The Safety and Health of all Americans is the most important role of any Administration, and HHS will play a big role in helping ensure that everybody will be protected from harmful chemicals, pollutants, pesticides, pharmaceutical products, and food additives that have contributed to the overwhelming Health Crisis in this Country. Mr. Kennedy will restore these Agencies to the traditions of Gold Standard Scientific Research, and beacons of Transparency, to end the Chronic Disease epidemic, and to Make America Great and Healthy Again!\" Trump added.\nKennedy dropped out of the presidential race in August and quickly endorsed the Trump-Vance ticket, and has since repeatedly vowed to \"Make America Healthy Again.\"\nRepublican presidential nominee former President Trump shakes hands with Independent presidential candidate Robert F. Kennedy Jr. at a campaign rally in Glendale, Ariz., Aug. 23.(AP Photo/Evan Vucci)\nPresident-elect Trumpannounced Thursday that he is nominating Jay Clayton to serve as U.S. attorney for the Southern District of New York.\n\"I am pleased to announce that Jay Clayton, of New York, the Chairman of the U.S. Securities and Exchange Commission during my first term, where he did an incredible job, is hereby nominated to be the U.S. Attorney for the Southern District of New York,\" Trump wrote in a post on Truth Social. \"Jay is a highly respected business leader, counsel, and public servant.\n\"Jay is going to be a strong Fighter for the Truth as we, Make America Great Again,\" the president-elect added.\nAnchor Maria Bartiromo interviews chairman of the U.S. Securities and Exchange Commission Jay Clayton during \"Mornings With Maria\" at Fox Business Network Studios on February 24, 2020 in New York City.\nPresident-elect Trumpannounced on Thursday his intent to nominate former Rep. Doug Collins, R-Ga., to serve as secretary of veterans affairs.\n\"Doug is a Veteran himself, who currently serves our Nation as a Chaplain in the United States Air Force Reserve Command, and fought for our Country in the Iraq War,\" Trump wrote on Truth Social. \"We must take care of our brave men and women in uniform, and Doug will be a great advocate for our Active Duty Servicemembers, Veterans, and Military Families to ensure they have the support they need.\n\"Thank you, Doug, for your willingness to serve our country in this very important role,\" the president-elect added.\nDean John Sauer, special assistant to the Louisiana attorney general, listens during a hearing with the House Judiciary Subcommittee in Washington, D.C., in 2023.(Anna Moneymaker/Getty Images)\nTrump announced Dean John Sauer as his pick for U.S. solicitor general.\n\"John is a deeply accomplished, masterful appellate attorney, who clerked for Justice Antonin Scalia in the United States Supreme Court, served as Solicitor General of Missouri for six years, and has extensive experience practicing before the U.S. Supreme Court and other Appellate Courts,\" Trump said in the announcement.\nSauer served as solicitor general of Missouri from 2017 to 2023, and represented Trump in his successful appeal to the U.S. Supreme Court in Trump v. United States.\nNorth Dakota Gov. Doug Burgum encourages voters to support Republican presidential candidate former President Trump during a campaign rally in Laconia, N.H.(Chip Somodevilla/Getty Images)\nPresident-elect Trump announced that North Dakota Gov. Doug Burgum will lead the Department of the Interior during a speech at the Americans for Prosperity Gala at Mar-a-Lago.\n\"He's going to be announced [Friday]…I look forward to doing the formal announcement, although this is a pretty big announcement right now, actually,\" Trump said. \"He's going to head the Department of Interior, and he's going to be fantastic.\"\nBurgum, a multi-millionaire former software company CEO turned two-term governor, launched a White House bid in June 2023. The governor made energy and natural resources a key part of his campaign for the GOP nomination.\nCLICK HERE TO GET THE FOX NEWS APP\nAfter he dropped out of the race, Burgum became a high profile surrogate for the former president, appearing on the campaign trail and in media hits on Trump’s behalf. He was in consideration as Trump’s running mate this past summer before Sen. JD Vance of Ohio was picked as the Republican Party’s vice presidential nominee.\nTrump announced Friday, Nov. 15, that Steven Cheung would return to the White House as assistant to the president and director of communications. Cheung previously served as communications director for the Trump-Vance campaign and was the White House director of strategic response in Trump's first term.\nSteven Cheung, spokesman for former US President Donald Trump, during a news conference with former US President Donald Trump, not pictured, at Trump National Golf Club in Bedminster, New Jersey, on Thursday, Aug. 15, 2024.(Bing Guan/Bloomberg via Getty Images)\nTrump also confirmed Fridaythat Sergio Gor will join the White House as director of the presidential personnel office. Gor, an ally and business partner of Donald Trump Jr.'s, was in charge of the pro-Trump political action committee Right For America and previously worked in RepublicanSen. Rand Paul's office.\n\"Steven Cheung and Sergio Gor have been trusted Advisors since my first Presidential Campaign in 2016, and have continued to champion America First principles throughout my First Term, all the way to our HIstoric Victory in 2024,\" Trump said in a statement. \"I am thrilled to have them join my White House, as we Make America Great Again!\"\nSergio Gor is reportedly President-elect Trump's choice to lead the Presidential Personnel Office in the new administration. (Andrew Kelly)(Andrew Kelly)\nTrump announced campaignspokesperson Karoline Leavittwill serve as White House press secretary for his upcoming administration.\n\"Karoline Leavitt did a phenomenal job as the National Press Secretary on my Historic Campaign, and I am pleased to announce she will serve as White House Press Secretary,\" Trump said in a statement Friday evening.\n\"Karoline is smart, tough, and has proven to be a highly effective communicator. I have the utmost confidence she will excel at the podium, and help deliver our message to the American People as we, Make America Great Again.\"\nLeavitt, 27, will be the youngest White House press secretary in U.S. history, unseating Nixon administration press secretary Ron Ziegler, who was 29 when he served in the role from 1969-1974.\nKaroline Leavitt will serve as White House press secretary.(MEGA/GC Images)\nWilliam Owen Scharf, one of Trump's lawyers, will serve as Assistant to the President and Staff Secretary starting in January.\nIn a statement on Saturday, the President-elect wrote that Scharf \"is a highly skilled attorney who will be a crucial part of my White House team.\"\n\"[Scharf] has played a key role in defeating the Election Interference and Lawfare waged against me, including by winning the Historic Immunity Decision in the Supreme Court,\" Trump's statement read.\nWill Scharf, attorney for former President Donald Trump speaks during a news conference at Trump Tower in New York City, Sept. 6.(Cheney Orr/Bloomberg via Getty Images)\nChris Wright,the CEO and founder of Liberty Energy, has been picked to lead the Department of Energy, according to a statement President-elect Trump released on Saturday.\n\"I am thrilled to announce that Chris Wright will be joining my Administration as both United States Secretary of Energy, and Member of the newly formed Council of National Energy,\" Trump's statement read, adding that Wright \"has been a leading technologist and entrepreneur in Energy.\"\nWright graduated from MIT with a degree in mechanical engineering, according to Liberty Energy's website. He also completed graduate work in electrical engineering at University of California, Berkeley and MIT.\n\"[Wright] is a self-described tech nerd turned entrepreneur and a dedicated humanitarian on a mission to better human lives by expanding access to abundant, affordable, and reliable energy,\" the company's website reads.\nLiberty Oilfield Services Inc. CEO Chris Wright has been tapped by President-elect Trump to lead the Energy Department.(Reuters/Lucas Jackson)\nPresident-elect Trumpannounced on Sundaythat he has picked Brendan Carr to serve as Chairman of the Federal Communications Commission (FCC) starting in January.\n\"Commissioner Carr currently serves as the senior Republican on the FCC. Before that, he was the FCC’s General Counsel,\" Trump's statement read. \"I first nominated Commissioner Carr to the FCC in 2017, and he has been confirmed unanimously by the United States Senate three times.\"\nAs a current member of the FCC, Carr recently called out \"Saturday Night Live\" for platforming Kamala Harris without inviting Trump, which violates FCC rules.\n\"NBC has structured this in a way that's plainly designed to evade the FCC's rules,\" Carr said to Fox News Digital. \"We're talking 50 hours before Election Day starts, without any notice to other candidates, as far as I can tell.\"\nCommissioner of the Federal Communications Commission Brendan Carr speaks during the 2024 Conservative Political Action Conference (CPAC) in National Harbor, Md.(Celal Gunes/Anadolu via Getty Images)\nPresident-elect Trumpannounced that he is nominating former Congressman Sean Duffy of Wisconsin, who is also a Fox News contributor and FOX Business co-host, to serve as the U.S. Secretary of Transportation.\n\"Sean has been a tremendous and well-liked public servant, starting his career as a District Attorney for Ashland, Wisconsin, and later elected to the U.S. House of Representatives for Wisconsin's 7th Congressional District,\" Trump said in his announcement on Monday. \"Sean will use his experience and the relationships he has built over many years in Congress to maintain and rebuild our Nation’s Infrastructure, and fulfill our Mission of ushering in The Golden Age of Travel, focusing on Safety, Efficiency, and Innovation. Importantly, he will greatly elevate the Travel Experience for all Americans!\"\nWhile in Congress, Duffy helped advocate for fiscal responsibility, economic growth and rural development.\nDuffy joined FOX News Media as a contributor in 2020. He currently serves as the co-host of FOX Business’The Bottom Linealongside Dagen McDowell. He also provides political analysis across all FOX News Media platforms.\nRep. Sean Duffy, R-Wis., leaves the House Republican Conference meeting in the U.S. Capitol in 2018.(Bill Clark/CQ Roll Call)\nCantor Fitzgerald CEOHoward Lutnickhas been nominated by President-elect Trump to serve as Secretary of Commerce.\n\"I am thrilled to announce that Howard Lutnick, Chairman & CEO of Cantor Fitzgeral, will join my Administration as the United States Secretary of Commerce,\" Trump said in a statement. \"He will lead our Tariff and Trade agenda, with additional direct responsibility for the Office of the United States Trade Representative.\"\n\"In his role as Co-Chair of the Trump-Vance Transition Team, Howard has created the most sophisticated process and system to assist us in creating the greatest Administration America has ever seen,\" Trump's statement added.\nHoward Lutnick, Chairman and CEO of Cantor Fitzgerald and Co-Chair of the Trump 2024 Transition Team speaks at a rally for former US President and Republican presidential candidate Donald Trump at Madison Square Garden in New York, October 27, 2024.(ANGELA WEISS/AFP via Getty Images)\nPresident-elect Trump plans to nominateDr. Mehmet Ozto serve as the Centers for Medicare and Medicaid Services (CMS) Administrator starting in January, he announced on Tuesday.\n\"America is facing a Healthcare Crisis, and there may be no Physician more qualified and capable than Dr. Oz to Make America Healthy Again,\" Trump said in a Truth Social post. \"He is an eminent Physician, Heart Surgeon, Inventor, and World-Class Communicator, who has been at the forefront of healthy living for decades.\"\nTrump wrote that Dr. Oz is expected to \"work closely\" withRobert F. Kennedy, Jr.,who the president-elect nominated to run the Department of Health and Human Services (HHS).\nPennsylvania GOP Senate candidate and former TV personality Dr. Mehmet Oz speaks before an appearance by former president Donald Trump to endorse local candidates at the Mohegan Sun Arena on September 03, 2022 in Wilkes-Barre, Pennsylvania.(Spencer Platt/Getty Images)\nPresident-elect Trump isappointing Linda McMahon,former CEO of World Wrestling Entertainment (WWE), to lead the Department of Education.\nHis announcement, which was posted on Truth Social, came hours after two sources told Fox News that McMahon was likely to be picked. Trump cited the businesswoman's expertise when he made the announcement.\n\"Linda will use her decades of Leadership experience, and deep understanding of both Education and Business, to empower the next Generation of American Students and Workers, and make America Number One in Education in the World,\" Trump's statement read. \"We will send Education BACK TO THE STATES, and Linda will spearhead that effort.\"\nLinda McMahon, former Administrator of Small Business Administration, speaks on Day 4 of the Republican National Convention (RNC), at the Fiserv Forum in Milwaukee, Wisconsin, U.S., July 18, 2024.(REUTERS/Mike Segar)\nTrump is tapping former Acting Attorney GeneralMatthew Whitakerto become U.S. ambassador to the North Atlantic Treaty Organization (NATO) in his new administration.\nTrump described Whitaker, who is from Iowa, as \"a strong warrior and loyal Patriot, who will ensure the United States' interests are advanced and defended.\"\nFormer U.S. Attorney General Matthew Whitaker speaks during a rally for Republican presidential nominee, former U.S. President Donald Trump at the Brick Breeden Fieldhouse at Montana State University on August 9, 2024 in Bozeman, Montana.(Michael Ciaglo/Getty Images)\n\"Matt will strengthen relationships withour NATO Allies, and stand firm in the face of threats to Peace and Stability - He will put AMERICA FIRST,\" Trump said in a statement. \"I have full confidence in Matt’s ability to represent the United States with Strength, Integrity, and unwavering Dedication. I look forward to working closely with him as we continue to promote PEACE THROUGH STRENGTH, Freedom, and Prosperity around the World.\"\n\"Matt is also the former U.S. Attorney for theSouthern District of Iowa, and is a graduate of the University of Iowa with a B.A., MBA and J.D., where he played football, and received the Big Ten Medal of Honor,\" Trump added.\nScott Bessent, founder of Key Square Group, was chosen for the coveted post of Treasury secretary. Bessent was a key economic policy adviser and fundraiser for theTrump campaign.\n\"Scott is widely respected as one of the World’s foremost International Investors and Geopolitical and Economic Strategists. Scott’s story is that of the American Dream,\" Trump said on Friday.\nTRUMP NOMINATES SCOTT BESSENT AS TREASURY SECRETARY; PICKS RUSS VOUGHT TO LEAD BUDGET OFFICE\nHe has been an advocate for economic policies like lower taxes, spending restraint and deregulation that have long made up the core of the Republican Party's platform, and has also been supportive of Trump's use of tariffs in trade negotiations.\nScott Bessent, founder and chief executive officer of Key Square Group LP, at an interview during the Republican National Convention (RNC) near the Fiserv Forum in Milwaukee, Wisconsin, US, on Tuesday, July 16, 2024.(Vincent Alban/Bloomberg via Getty Images)\nOn Friday, Trump tapped Russ Vought to lead the White House's Office of Management and Budget (OMB). Vought served as OMB director during Trump's first term. He also served as deputy OMB director and acting director.\n\"He did an excellent job serving in this role in my First Term - We cut four Regulations for every new Regulation, and it was a Great Success!\" Trump wrote on Truth Social.\nVought is a contributor to theHeritage Foundation's Project 2025and a close Trump ally.\nRussell Vought, Trump's director of the Office of Management and Budget from July 2020 to January 2021, openly supports the former president on Twitter. \"Enormously important paradigm shift back to the Founder’s Constitution! President Trump is the only one with the courage to take this fight on and deal with the original sin of our spending woes,\" Vought said in a tweet.(Al Drago)\nTrump nominated Scott Turner as the secretary of the Department of Housing and Urban Development (HUD). Turner, who is chair of the Center for Education Opportunity and is a former professional football player, previously served as executive director of the White House Opportunity and Revitalization Council (WHORC).\nTRUMP PICKS SCOTT TURNER AS SECRETARY OF DEPARTMENT OF HOUSING AND URBAN DEVELOPMENT\n\"Scott is anNFL Veteran, who, during my First Term, served as the First Executive Director of the White House Opportunity and Revitalization Council (WHORC), helping to lead an Unprecedented Effort that Transformed our Country’s most distressed communities,\" Trump said in a Friday statement. \"Those efforts, working together with former HUD Secretary, Ben Carson, were maximized by Scott’s guidance in overseeing 16 Federal Agencies which implemented more than 200 policy actions furthering Economic Development. Under Scott’s leadership, Opportunity Zones received over $50 Billion Dollars in Private Investment!\"\nTurner, a former Texas state lawmaker, played nine seasons in the NFL as a member of the Washington Redskins, San Diego Chargers and the Denver Broncos.\nScott Turner, former executive director of the White House Opportunity and Revitalization Council, during the America First Policy Institute's America First Agenda summit in Washington, D.C., US, on Monday, July 25, 2022.(Al Drago/Bloomberg via Getty Images)\nTrump nominated Rep. Lori Chavez-DeRemer, R-Ore., on Friday for secretary of labor.\n\"I am proud to hereby nominate Congresswoman Lori Chavez-DeRemer, from the Great State of Oregon, as United States Secretary of Labor,\" Trump wrote in an official statement. \"Lori has worked tirelessly with both Business and Labor to build America’s workforce, and support the hardworking men and women of America. I look forward to working with her to create tremendous opportunity for American Workers, to expand Training and Apprenticeships, to grow wages and improve working conditions, to bring back our Manufacturing jobs. Together, we will achieve historic cooperation between Business and Labor that will restore the American Dream for Working Families.\"\nChavez-DeRemer was first elected to Congress in 2022, andlost re-electionin a close race against Democrat Janelle Bynum earlier this month. Her candidacy was backed by the Teamsters Union.\nLori Chavez-DeRemer, Republican candidate from Oregon, running for the U.S. House of Representatives in the 2022 U.S. midterm elections, appears in an undated handout photo provided October 11, 2022.(Ben Lee/Handout via REUTERS )\nPresident-elect Trump announced that former Rep. Dr. Dave Weldon, R-Fla., is his pick as the director of the Centers for Disease Control and Prevention (CDC).\n\"In addition to being a Medical Doctor for 40 years, and an Army Veteran, Dave has been a respected conservative leader on fiscal and social issues, and served on the Labor/HHS Appropriations Subcommittee, working for Accountability on HHS and CDC Policy and Budgeting,\" Trump said in the Friday evening announcement.\nTrump said that Dr. Weldon would restore trust in the agency and transparency.\nTrump on Friday nominated Dr. Marty Makary, a pancreatic surgeon at Johns Hopkins University, as commissioner of the Food and Drug Administration.\nMakary is the chief of Islet Transplant Surgery at Johns Hopkins, according tothe university’s website, and was a Fox News medical contributor.\n\"FDA has lost the trust of Americans, and has lost sight of its primary goal as a regulator. The Agency needs Dr. Marty Makary, a Highly Respected Johns Hopkins Surgical Oncologist and Health Policy Expert, to course-correct and refocus the Agency,\"Trump said on Truth Social.\nTRUMP PICKS DR. JANETTE NESHEIWAT AS NATION'S NEXT SURGEON GENERAL\n\"He will work under the leadership of Robert F. Kennedy Jr. to, among other things, properly evaluate harmful chemicals poisoning our Nation's food supply and drugs and biologics being given to our Nation's youth, so that we can finally address the Childhood Chronic Disease Epidemic,\" Trump said.\nDr. Janette Nesheiwat, a New York City-based double board-certified doctor, and, Dr. Marty Makary, a Johns Hopkins health policy expert and surgeon, right.(Fox News)\nTrump also nominatedDr. Janette Nesheiwatas surgeon general, saying that she would be a \"fierce advocate and strong communicator for preventative medicine and public health.\"\n\"I am proud to announce that Dr. Janette Nesheiwat will be the Nation’s Doctor as the United States Surgeon General. Dr. Nesheiwat is a double board-certified Medical Doctor with an unwavering commitment to saving and treating thousands of American lives,\" he said.\nNesheiwat is a former Fox News medical contributor.\nDr Janette Nesheiwat attends the 2023 FOX Nation Patriot Awards at The Grand Ole Opry on November 16, 2023 in Nashville, Tennessee.(Photo by Terry Wyatt/Getty Images)\nTrump announced Friday that his former White House adviser, Sebastian Gorka, will serve in his incoming administration. Gorka will serve as deputy assistant to the president and senior director for counterterrorism.\nGorka, a former Trump aide, previously served as deputy assistant to the president during Trump's first term. He's also a former Fox News contributor.\n\"Since 2015, Dr. Gorka has been a tireless advocate for the America First Agenda and the MAGA Movement, serving previously as Strategist to the President in the first Trump Administration,\" Trump said.\nSebastian Gorka and Alex Wong will serve under President-elect Trump for a second term.( (L) Getty Images, (R) Department of State)\nSimilarly to Gorka, Alex Wong served under Trump during his first term.\nWong served in the State Department as deputy special representative for North Korea, and the deputy assistant secretary for East Asian and Pacific affairs.\nBrooke Rollins, president and CEO of AFPI, is seen during the America First Policy Institute's America First Agenda Summit at the Marriott Marquis, July 26, 2022.(Tom Williams/CQ-Roll Call, Inc via Getty Images)\nSecretary of Agriculture – Brooke RollinsPresident-elect Trump tapped Brooke Rollins as his agriculture secretary. Rollins, the president and CEO of AFPI, previously served in Trump's first administration as director of the Office of American Innovation and acting director of the Domestic Policy Council.\nTrump lauded Rollins' \"commitment to support the American Farmer, defense of American Food Self-Sufficiency, and the restoration of Agriculture-dependent American Small Towns.\"\n\"A proud Graduate of Texas A&M University, Brooke earned a Bachelor’s of Science Degree in Agriculture Development, and J.D., with Honors,\" Trump's official announcement said. \"From her upbringing in the small and Agriculture-centered town of Glen Rose, Texas, to her years of leadership involvement with Future Farmers of America and 4H, to her generational Family Farming background, to guiding her four kids in their show cattle careers, Brooke has a practitioner’s experience, along with deep Policy credentials in both Nonprofit and Government leadership at the State and National levels.\""}, {"source": "foxnews", "title": "US scrambles as drones shape the landscape of war: 'the future is here'", "link": "https://www.foxnews.com/world/us-scrambles-drones-shape-landscape-war-future-here", "content": "US Army beefs up short reconnaissance program with thousands of new drone systems. (Credit: Red Cat)\nFIRST ON FOX:The U.S. Army this week took steps to advance American military capabilities by ordering a potential of 5,880 drone systems small enough to fit in a backpack as the reality of battle shifts in favor of electronic warfare. The contract period is over five years.\nConflicts around the globe, particularly the war in Ukraine, have drastically changed how major nations think about conducting war, explained drone expert and former U.S. Army intelligence and special operations soldier Brett Velicovich to Fox News Digital.\nThe nearly three-year-long war inUkraine has often depicted scenesnot witnessed since World War II, with children loaded onto trains, veins of trenches scarring the eastern front and renewed concern over how the geopolitics of this conflict could ensnare the entire Western world.\n1,000 DAYS OF WAR IN UKRAINE AS ZELENSKYY DOUBLES DOWN ON AERIAL OPTIONS WITH ATACMS, DRONES AND MISSILES\nA UJ-22 Airborne (UkrJet) reconnaissance drone prepares to land during a test flight in the Kyiv region of Ukraine on Aug. 2, 2022.(Sergei Supinsky/AFP via Getty Images)\nBut Ukraine’s scrappy response to its often outnumbered and at times outgunned reality has completely changed how major nationslook at the modern-day battlefield.\n\"Think about how we fought wars in the past,\" Velicovich, a Fox News contributor, said, pointing to the Vietnam War. \"When you were fighting the enemy over that trench line, you didn't know who was over that hill. You saw a red hat and you fired at it.\"\n\"Now you have the ability to see what's over that hill and maneuver your forces quickly based on that,\" he added.\nAreport by The Wall Street Journalthis week said the U.S. Army secured potentially its largest-ever purchase of small surveillance drones from Red Cat Holding’s Utah-based Teal Drones.\nThis move is a significant step that the U.S. has been eyeing for more than a decade after terrorists first began employing small-drone tactics against the U.S. military in the Middle East.\nAccording to Velicovich, who routinely visits Ukraine to advise on drone technology, the U.S. is trailing its top adversaries like Russia andChina when it comes investment in dronecapabilities.\nUkrainian soldiers look for a drone in a trench at their infantry position in the direction of Kupiansk, Kharkiv Oblast, Ukraine, on March 10.(Diego Herrera Carcedo/Anadolu via Getty Images)\nUS BRIEFED UKRAINE AHEAD OF PUTIN'S 'EXPERIMENTAL INTERMEDIATE-RANGE BALLISTIC' ATTACK\nWhile the U.S. invested heavily in sophisticated systems like Predator and Reaper drones — which are multimillion-dollar systems designed for intelligence collection and lengthy navigation flight times and possess missile strike capabilities — it is the small, cheaply made unmanned aerial vehicles (UAVs) which are changing battlefield dynamics.\n\"These handheld, small UAS systems that you are able to take a drone with a bomb strapped to it [have become] basically an artillery shell now. It's guided artillery shells,\" Velicovich said in reference to Unmanned Aircraft Systems, which include not only the UAV, but also the controller manned from the ground. \"Frankly, it's changing how countries are going to fight wars in the future, and the U.S. has been so slow to get ahead of this.\"\nIt has reportedly taken the U.S. Army some 15 years to start beefing up its Short Range Reconnaissance program with these backpack-sized drones, in part because there was a mental hurdle the Department of Defense needed to push through.\n\"It's the mentality of senior leaders,\" Velicovich explained. \"These guys are hardened battle infantry guys. They didn't grow up with fancy technology.\"\n\"It really takes a lot of people understanding, changing their thought process. And that's happening now because of the accelerating war in Ukraine, where they've seen how effective drones are,\" he said, noting that drones can no longer be dismissed as gimmicks or toys of the future.\n\"Now it's real. Now it's here, the future is here,\" Velicovich said. \"We will never fight another war without drones.\"\nThe U.S. Army has acquired the drone systems from Red Cat's Teal Drones in a move to beef up its short-range reconnaissance capabilities as battlefield realities turn to electronic warfare.(Red Cat Holdings)\nTeal Drones worked to develop a UAS system based on battlefield needs identified by the U.S. Army, and eventually created the drone that has been dubbed the Black Widow, explained Red Cat CEO Jeff Thompson to Fox News Digital.\nBIDEN ADMINISTRATION TO ANNOUNCE $275 MILLION UKRAINE WEAPONS PACKAGE THIS WEEK\nThis sophisticated system is capable of being operated by a single man, can resist Russian jammers, has strike capabilities, and can fly in GPS-denied zones — an important factor that has been highlighted by the war in Ukraine.\n\"The Short Range Reconnaissance drone is really going to be able to help the warfighter be more lethal and be a safer soldier,\" Thompson said.\nThe U.S. Army greenlighted the purchase of the drones. Each soldier kitted out with the Black Widow technology will be given what is called a \"system,\" which includes two drones and one controller — all of which can fit in one's rucksack.\nEach system, including the drones and controller, costs the U.S. government about $45,000.\nBut, as Johnson pointed out, Ukraine’s armed forces are going throughabout 10,000 drones a month— which suggests the U.S. will need to acquire far more than at the present level.\nA soldier with the 58th Independent Motorized Infantry Brigade of the Ukrainian Army catches a drone while testing it so it can be used nearby as Russia's invasion of Ukraine continues, near Bakhmut, Ukraine, on Nov. 25, 2022.(Reuters/Leah Millis)\nThe war in Ukraine has shown that affordably made drones, particularly FPV drones, which stands for \"first-person view,\" can be made for as low as $1,000 a drone and frequently strapped with explosives and utilized as kamikaze drones.\nCLICK HERE TO GET THE FOX NEWS APP\nBut drone warfare is about significantly more than sheer quantity — it’s a \"power game.\"\n\"This is a cat and mouse game,\" Velicovich said, explaining that drone and counter-drone technology, like jamming systems, are constantly evolving. \"This is playing out at a level that most people don't realize.\"\n\"It's like we were almost peering into the future,\" he continued. \"We are seeing what's happening on the ground now, there in Ukraine, and eventually we'll have to fight a war similar to it, and we just need to be ready.\"\nCaitlin McFall is a Reporter at Fox News Digital covering Politics, U.S. and World news."}, {"source": "foxnews", "title": "Trump will appoint 'dozens' of judges, experts say, despite Dems ramming through nominees in lame-duck session", "link": "https://www.foxnews.com/politics/trump-appoint-dozens-judges-experts-say-despite-dems-ramming-through-nominees-lame-duck-session", "content": "Fox News correspondent Mark Meredith has more on Senate Democrats pushing to approve judicial nominees ahead of Trump's return to White House on 'Special Report.'\nExperts sayPresident-elect Donald Trump'schances of appointing judges to the federal bench remain positive, despite Senate Democrats' push to confirm as many of President Biden's picks as possible.\nAmid their efforts to appointBiden's judicial picksahead of Trump's administration and a new Congress starting in January, both parties struck a midnight deal Wednesday after Republicans planned to slow down judicial confirmations earlier this week.\nThe agreement would allowDemocrats to holdvotes on four district court judges in exchange for pulling four higher-tier circuit court judicial nominees, a senior Senate source familiar with the matter told Fox News Digital.\nDEMOCRATS ADVANCE 5 MORE BIDEN JUDICIAL NOMINEES\nThe four vacancies would then be Trump's to fill.\nASenate Majority Leader Chuck Schumerspokesperson told Fox News Digital the trade included four circuit nominees – all of which lack votes to get confirmed – \"for more than triple the number of additional judges moving forward.\"\nSenate Majority Leader Chuck Schumer addressed the floor Thursday, saying they had confirmed six new judges this past week alone.(Getty Images)\n\"I’m glad that Republican senators are starting to show up to vote because some of the worst nominees are still awaiting confirmation precisely because they didn't have adequate support,\" Carrie Severino, president of JCN, told Fox News Digital.\nWhen asked about the deal, Devon Ombres, senior director of courts and legal policy at CAPAction said, \"Frankly, I'm at a loss as to why they would get here.\"\n\"It would be nice to see Democratic leadership and the White House try and push through and fill those vacancies where possible,\" Ombres said.\nSchumer addressed the floor Thursday, saying they had confirmed six new judges this past week alone – one circuit court judge and five district court judges, bringing Biden's total number of confirmations to 220. Trump notably secured 234 confirmations during his first term.\nSENATE SHOWDOWN: GOP SECURES DEAL WITH SCHUMER TO SAVE COVETED APPELLATE JUDGES FOR TRUMP\nDespite the push, Ombres stated he predicts circuit judges appointed primarily by former president George W. Bush will take senior status, which would then give Trump additional vacancies to fill. Likewise, Ombres said those appointed by former Presidents Bill Clinton and Barack Obama will avoid taking senior status.\n\"[Trump will] still have a handful of vacancies that he'll be able to appoint,\" Ombres said. \"But if the Senate Republicans maintain the blue slip process, it will be tougher sledding to appoint in those in blue states, but he will still have an opportunity to bolster where there is already strength, especially the 11th Circuit.\"\nExperts say President-elect Donald Trump's chances of appointing judges to the federal bench remain positive despite Senate Democrats' push to confirm as many President Biden picks as possible.(AP Photo/Evan Vucci, File)\n\"When Trump comes into office, he's going to have dozens more vacancies to fill,\" Severino said. \"And that's not even counting the judges who will take senior status over the next four years.\"\nAccording to a Senate Democrat leadership aide familiar with the agreement reached, the deal allowed for the Senate to vote on cloture on nine district court judges this week and vote to confirm them when they return after Thanksgiving.\nThe source also noted that the new deal did not mean Republicans were going to allow the Biden district judges to sail through without opposition.GOP senatorsare still expected to fight and vote against the Democrat-nominated judges as they have done throughout Biden's term.\nSPRINT TO CONFIRM TRUMP NOMINEES KICKS OFF IN JANUARY\n\"I think certainly appellate judges are always going to be more important in our judicial system than district court judges,\" Ombres said. \"But district court judges are still capable of instituting nationwide injunctions and striking down programs and issuing sweeping opinions.\"\nThe Senate slowdown was spearheaded bySenate Minority Whip John Thune, R-S.D., who was recently elected as the next Republican Senate leader. Republicans sought to delay the confirmation process through tactical maneuvers on the floor.\nThe Senate slowdown was spearheaded by Senate Minority Whip John Thune.(Reuters)\nTrump has previously been vocal about not wanting judicial confirmations during the lame-duck session, writing on Truth Social, \"No more Judges confirmed before Inauguration Day!\"\nCLICK HERE TO GET THE FOX NEWS APP\nShortly after Senate Dems began to ramp up energy to confirm Biden's judicial picks after the Nov. 5 election, Trump-Vance transition spokesperson Brian Hughes told Fox News Digitalin a statement,\"In his first term, President Trump appointed constitutionalist judges who interpret the law as written. He will do so again.\"\n\"He had a wonderful record last time around, and I hope he's going to have a similar track record this time of putting up principled and highly qualified nominees,\" Severino said.\nFox News Digital's Julia Johnson contributed to this report.\nHaley Chi-Sing is a Writer for Fox News Digital. You can reach her at @haleychising on X."}, {"source": "foxnews", "title": "From CDC to labor secretary: See Trump's top picks for Cabinet roles", "link": "https://www.foxnews.com/politics/from-cdc-labor-secretary-see-trumps-top-picks-cabinet-roles", "content": "Fox News' Chad Pergram reports on pushback from some lawmakers on the president-elect's Cabinet picks and potential recess appointments.\nA clearer picture emerged of who will serve in the Cabinet ofAmerica's 47th President, with President-elect Trump assembling more of his top cabinet picks on Friday evening.\nAll of Trump’s Cabinet choices must be confirmed by the Senate, with the process set to begin in January. The confirmation process will be made easier by a 53-seat Republican majority, after GOP candidates flipped four seats in this election.\nThe president-elect chose a slew of key Trump supporters who assisted in his election.\nGET TO KNOW DONALD TRUMP'S CABINET: WHO HAS THE PRESIDENT-ELECT PICKED SO FAR?\nPresident-elect Donald Trump on Friday announced his choices to lead the Food and Drug Administration, the Centers for Disease Control and Prevention, as well as his pick for the surgeon general post.(Getty Images)\nScott Bessent, founder of Key Square Group, was chosen for the coveted post of Treasury secretary. Bessent was a key economic policy adviser and fundraiser for theTrump campaign.\n\"Scott is widely respected as one of the World’s foremost International Investors and Geopolitical and Economic Strategists. Scott’s story is that of the American Dream,\" Trump said on Friday.\nTRUMP NOMINATES SCOTT BESSENT AS TREASURY SECRETARY; PICKS RUSS VOUGHT TO LEAD BUDGET OFFICE\nHe has been an advocate for economic policies like lower taxes, spending restraint and deregulation that have long made up the core of the Republican Party's platform, and has also been supportive of Trump's use of tariffs in trade negotiations.\nRuss Vought, director of the White House Office of Management and Budget (OMB), listens during an American Workforce Policy Advisory Board meeting in the East Room of the White House in Washington, D.C., June 26, 2020.\nOn Friday, Trump tapped Russ Vought to lead the White House's Office of Management and Budget (OMB). Vought served OMB director during Trump's first term. He also served as deputy OMB director and acting director.\n\"He did an excellent job serving in this role in my First Term - We cut four Regulations for every new Regulation, and it was a Great Success!\" Trump wrote on Truth Social.\nVought is a contributor to theHeritage Foundation's Project 2025and a close Trump ally.\nScott Turner, former executive director of the White House Opportunity and Revitalization Council, during the America First Policy Institute's America First Agenda summit in Washington, D.C., US, on Monday, July 25, 2022.(Al Drago/Bloomberg via Getty Images)\nTrump nominated Scott Turner as the secretary of the Department of Housing and Urban Development (HUD). Turner, who is chair of the Center for Education Opportunity and is a former professional football player, previously served as executive director of the White House Opportunity and Revitalization Council (WHORC).\nTRUMP PICKS SCOTT TURNER AS SECRETARY OF DEPARTMENT OF HOUSING AND URBAN DEVELOPMENT\n\"Scott is anNFL Veteran, who, during my First Term, served as the First Executive Director of the White House Opportunity and Revitalization Council (WHORC), helping to lead an Unprecedented Effort that Transformed our Country’s most distressed communities,\" Trump said in a Friday statement. \"Those efforts, working together with former HUD Secretary, Ben Carson, were maximized by Scott’s guidance in overseeing 16 Federal Agencies which implemented more than 200 policy actions furthering Economic Development. Under Scott’s leadership, Opportunity Zones received over $50 Billion Dollars in Private Investment!\"\nTurner, a former Texas state lawmaker, played nine seasons in the NFL as a member of the Washington Redskins, San Diego Chargers and the Denver Broncos.\nTrump nominated Rep. Lori Chavez-DeRemer, R-Ore., on Friday for secretary of labor.\n\"I am proud to hereby nominate Congresswoman Lori Chavez-DeRemer, from the Great State of Oregon, as United States Secretary of Labor,\" Trump wrote in an official statement. \"Lori has worked tirelessly with both Business and Labor to build America’s workforce, and support the hardworking men and women of America. I look forward to working with her to create tremendous opportunity for American Workers, to expand Training and Apprenticeships, to grow wages and improve working conditions, to bring back our Manufacturing jobs. Together, we will achieve historic cooperation between Business and Labor that will restore the American Dream for Working Families.\"\nChavez-DeRemer was first elected to Congress in 2022, andlost re-electionin a close race against Democrat Janelle Bynum earlier this month. Her candidacy was backed by the Teamsters union.\nPresident-elect Trump announced that former Rep. Dr. Dave Weldon, R-Fla., is his pick as the director of the Centers for Disease Control and Prevention (CDC).\n\"In addition to being a Medical Doctor for 40 years, and an Army Veteran, Dave has been a respected conservative leader on fiscal and social issues, and served on the Labor/HHS Appropriations Subcommittee, working for Accountability on HHS and CDC Policy and Budgeting,\" Trump said in the Friday evening announcement.\nTrump said that Dr. Wedlon would restore trust in the agency and transparency.\nDr. Janette Nesheiwat, a New York City-based double board-certified doctor, and, Dr. Marty Makary, a Johns Hopkins health policy expert and surgeon.(Fox News)\nTrump on Friday nominated Dr. Marty Makary, a pancreatic surgeon at Johns Hopkins University, as commissioner of the Food and Drug Administration.\nMakary is the chief of Islet Transplant Surgery at Johns Hopkins, according tothe university’s website, and was a Fox News medical contributor.\n\"FDA has lost the trust of Americans, and has lost sight of its primary goal as a regulator. The Agency needs Dr. Marty Makary, a Highly Respected Johns Hopkins Surgical Oncologist and Health Policy Expert, to course-correct and refocus the Agency,\"Trump said on Truth Social.\nTRUMP PICKS DR. JANETTE NESHEIWAT AS NATION'S NEXT SURGEON GENERAL\n\"He will work under the leadership of Robert F. Kennedy Jr. to, among other things, properly evaluate harmful chemicals poisoning our Nation's food supply and drugs and biologics being given to our Nation's youth, so that we can finally address the Childhood Chronic Disease Epidemic,\" Trump said.\nTrump also nominatedDr. Janette Nesheiwatas surgeon general, saying that she would be a \"fierce advocate and strong communicator for preventative medicine and public health.\"\n\"I am proud to announce that Dr. Janette Nesheiwat will be the Nation’s Doctor as the United States Surgeon General. Dr. Nesheiwat is a double board-certified Medical Doctor with an unwavering commitment to saving and treating thousands of American lives,\" he said.\nNesheiwat is a former Fox News medical contributor.\nSebastian Gorka and Alex Wong will serve under President-elect Trump for a second term.(Getty Images; Department of State)\nTrump announced Friday that his former White House adviser, Sebastian Gorka, will serve in his incoming administration. Gorka will serve as deputy assistant to the president and senior director for counterterrorism.\nGorka, a former Trump aide, previously served as deputy assistant to the president during Trump's first term. He's also a former Fox News contributor.\n\"Since 2015, Dr. Gorka has been a tireless advocate for the America First Agenda and the MAGA Movement, serving previously as Strategist to the President in the first Trump Administration,\" Trump said.\nSimilarly to Gorka, Alex Wong served under Trump during his first term.\nCLICK HERE TO GET THE FOX NEWS APP\nWong served in the State Department as deputy special representative for North Korea, and the deputy assistant secretary for East Asian and pacific affairs.\nFox News Digital's Brie Stimson and Louis Casiano Jr. contributed to this report.\nSarah Rumpf-Whitten is a breaking news writer for Fox News Digital and Fox Business.\nStory tips and ideas can be sent to sarah.rumpf@fox.com and on X:@s_rumpfwhitten."}, {"source": "foxnews", "title": "JESSE WATTERS: You know Pam Bondi's a winner because the deep state sounds awfully nervous", "link": "https://www.foxnews.com/media/jesse-watters-you-know-pam-bondis-winner-because-deep-state-sounds-awfully-nervous", "content": "Fox News host Jesse Watters discusses President-elect Donald Trump's latest Cabinet picks and why the nomination process proves he's not the dictator Democrats made him out to be.\nFox News host Jesse Watters reacts to President-elect Donald Trump choosingPam Bondias his attorney general and argues the nomination process proves he's not the dictator Democrats made him out to be.\nJESSE WATTERS:Trump said his revenge will be success, not liberal work camps. Trump got some pretty bad news this week, and he didn't react like a dictator. The Senate wasn't going to confirm Matt Gaetz. So did Trump thrash about and dissolve the Senate? No. He respected the check and balance and picked a new attorney general, not something Hitler would have done…\nTrump swapped out Gaetz with someone who has a much better chance of getting confirmed, former Florida AG Pam Bondi. JD Vance says attorneys general are the most important job in the government, only behind President Trump, had his eye on Bondi for awhile… Just like with every nomination, they're going to try to dig up dirt on Bondi. But all they've found so far, she's got a great resumé… You know, Bondi's a winner because the deep state sounds awfully nervous.\nMSNBC CONTRIBUTOR WARNS ‘WE SHOULD ALL FEAR’ TRUMP'S NEW AG PICK PAM BONDI ‘BECAUSE SHE’S COMPETENT'\n…\nTrump wants to radically transform the government. It's what he campaigned on, is what Americans voted for in 2016. His agenda got swallowed up by D.C. bureaucrats and rabid Democrats. But Politico reports, all the forces that were coming for him have been kind of defanged and obliterated.\nThis time, it feels like Trump found his footing in Washington, and he has his people around him. They believe in his plan. Reporters have been covering Trump for a decade. So, after two assassination attempts, four indictments and a landslide, Trump has a \"different sort of confidence and nerve.\" Trump's carrying the momentum from the election all the way to the inauguration. Then it's time for him to execute his vision without delay.\nThis article was written by Fox News staff."}, {"source": "foxnews", "title": "Trump picks Dr. Marty Makary as Food and Drug Administration commissioner", "link": "https://www.foxnews.com/politics/trump-picks-dr-marty-makary-food-drug-administration-commissioner", "content": "Fox News host Laura Ingraham and Fox News contributor Raymond Arroyo react to the latest nomination from President-elect Donald Trump.\nPresident-elect Trumpon Friday announced he is nominating Johns Hopkins School of Medicine professor Dr. Marty Makary for Food and Drug Administration (FDA) commissioner.\n\"I am very pleased to nominate Marty Makary MD, MPH, FACS, for FDA Commissioner,\" Trump said in a statement. \"FDA has lost the trust of Americans, and has lost sight of its primary goal as a regulator. The Agency needs Dr. Marty Makary, a Highly Respected Johns Hopkins Surgical Oncologist and Health Policy Expert, to course-correct and refocus the Agency.\"\nMakary’s nomination comes after Trump nominatedRobert F. Kennedy, Jr. to leadthe Department of Health and Human Services (HHS) to \"Make America healthy again.\"\nTRUMP APPOINTS DR. OZ TO KEY HHS POSITION IN NEW ADMINISTRATION\nDr. Marty Makary was picked for FDA commissioner in the Trump administration.(Fox News)\nTrump said Makary will \"work under the leadership of Robert F. Kennedy Jr. to, among other things, properly evaluate harmful chemicals poisoning our Nation’s food supply and drugs and biologics being given to our Nation’s youth, so that we can finally address the Childhood Chronic Disease Epidemic.\"\nTrump in his statement added that Makary, who was a Fox News medical contributor, is also a \"member of the prestigious National Academy of Medicine\" and \"has devoted his career to improving Medical Quality and lowering Hospital and Drug Costs for all Americans. In addition, Dr. Makary is an accomplished Professor at the Johns Hopkins School of Medicine and Johns Hopkins Carey Business School, and a leading advocate for Healthcare Transparency. He has authored more than 300 scientific articles and three New York Times bestselling books on Healthcare.\n\"I am very pleased to nominate Marty Makary MD, MPH, FACS, for FDA Commissioner,\" Trump said in a statement.(Noam Galai/Getty Images for HBO)\nTRUMP NOMINATES SCOTT BESSENT AS TREASURY SECRETARY; PICKS RUSS VOUGHT TO LEAD BUDGET OFFICE\nTrump called Makary a \"pioneer in the fields of Public Health, Cancer Care, and Surgery, and a tireless voice for vulnerable populations. He is the recipient of the Nobility in Science Award from the National Pancreas Foundation and numerous teaching awards. Dr. Makary currently leads the Evidence-Based Medicine and Public Policy Research Group at Johns Hopkins.\"\nMakary will work under HHS nominee Robert F. Kennedy Jr., above.(AP Photo/Alex Brandon)\nHe added, \"I am confident that Dr. Makary, having dedicated his career to High-Quality, Lower-Cost Care, will restore FDA to the Gold Standard of Scientific Research, and cut the bureaucratic red tape at the Agency to make sure Americans get the Medical Cures and Treatments they deserve.\"\nCLICK HERE TO GET THE FOX NEWS APP\nTrump made several other announcements Friday evening as he continueshis transition, including Dr. Janette Nesheiwat as surgeon general, and Dr. Dave Weldon to head the U.S. Centers for Disease Control and Prevention (CDC)."}, {"source": "foxnews", "title": "Trump picks Scott Turner as secretary for Department of Housing and Urban Development", "link": "https://www.foxnews.com/politics/trump-picks-scott-turner-secretary-department-housing-urban-development", "content": "Fox News senior White House correspondent Peter Doocy reports on the roadmap for President-elect Donald Trump to secure his Cabinet nominations on ‘Special Report.’\nPresident-elect Trumpnominated former NFL player Scott Turner as the secretary for the Department of Housing and Urban Development (HUD).\nTurner, who is chair of the Center for Education Opportunity, previously served as executive director of the White House Opportunity and Revitalization Council (WHORC).\n\"Scott is an NFL Veteran, who, during my First Term, served as the First Executive Director of the White House Opportunity and Revitalization Council (WHORC), helping to lead an Unprecedented Effort that Transformed our Country’s most distressed communities,\" Trump said in a Friday statement.\nGET TO KNOW DONALD TRUMP'S CABINET: WHO HAS THE PRESIDENT-ELECT PICKED SO FAR?\nScott Turner, former executive director of the White House Opportunity and Revitalization Council, attends the America First Policy Institutes America First Agenda summit in Washington, D.C., July 25, 2022.(Al Drago/Bloomberg via Getty Images)\n\"Those efforts, working together with former HUD Secretary, Ben Carson, were maximized by Scott’s guidance in overseeing 16 Federal Agencies which implemented more than 200 policy actions furthering Economic Development,\" he added. \"Under Scott’s leadership, Opportunity Zones received over $50 Billion Dollars in Private Investment!\"\nTurner, a graduate of the University of Illinois, played cornerback for theWashington Redskinsbefore winning a state house race in Texas. He served in the Texas House of Representatives from 2013 to 2017.\nDuring Trump's first term, Turner served as the executive director of the WHORC — aimed at helping the country’s \"distressed communities across America,\" according to its website.\nWhite House Opportunity and Revitalization Council Executive Director Scott Turner speaks at the invitation of then-President Trump during the National Historically Black Colleges and Universities Week Conference at the Renaissance Hotel, in Washington, D.C., Sept. 10, 2019.(Chip Somodevilla/Getty Images)\n\"Scott is the Founder & CEO of his Family's Foundation, Community Engagement & Opportunity Council (CEOC), working to revitalize communities across America through Sports, Mentorship, and Economic Opportunity,\" he said. \"He is also on the Board of the American Cornerstone Institute, and an Associate Pastor at Prestonwood Baptist Church.\"\n\"Scott will work alongside me to Make America Great Again for EVERY American,\" Trump said. \"Congratulations to Scott, his wonderful wife, Robin, and his son, Solomon!\"\nOn X, Turner thanked Trump, saying he was \"humbled\" by the nomination, and former HUD chief, Dr. Ben Carson, whom he called a mentor.\nExecutive Director of the White House Opportunity and Revitalization Council Scott Turner speaks as then-President Trump and senior adviser Jared Kushner listen during a meeting.(Getty Images)\n\"Few people are as compassionate and gracious as he is, and I am aware that I have big shoes to fill,\" Turner wrote. \"The forgotten men and women of this great country over the past four years will be honored in the Trump administration.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"We have an important mission ahead,\" he added. \"To God be the glory. Let’s get to work!\"\nSarah Rumpf-Whitten is a breaking news writer for Fox News Digital and Fox Business.\nStory tips and ideas can be sent to sarah.rumpf@fox.com and on X:@s_rumpfwhitten."}, {"source": "foxnews", "title": "Fox News captures 73% of primetime cable news audience as MSNBC, CNN face post-election tumble", "link": "https://www.foxnews.com/media/fox-news-captures-73-primetime-cable-news-audience-msnbc-cnn-face-post-election-tumble", "content": "The 'Outnumbered' panel reacted to the news that 'Morning Joe' hosts Joe Scarborough and Mika Brzezinski met with President-elect Donald Trump despite years of 'disgusting' criticism.\nFox News Channelhas seen a surge in its share of primetime cable news viewers as the audiences of liberal networks MSNBC and CNN continue bleeding following the presidential election.\nSince the Nov. 5 election through Thursday, Fox News has captured a whopping 73% of all cable news primetime viewers, including 71% in the advertiser-coveted demo ages 25-54, according to Nielsen Media Research.\nFox News has averaged 3.2 million total primetime viewers, a 34% increase from before the election of President-elect Donald Trump and 417,000 in the key demo, a hefty 46% increase.\nFOX NEWS MEDIA LIGHTS ‘ALL-AMERICAN CHRISTMAS TREE’ IN NYC, KICKING OFF HOLIDAY SEASON\nFox News Channel's primetime viewership has surged since the presidential election.(Fox News)\nCNN, meanwhile, has averaged only 469,000 total primetime viewers, shedding 35% of its pre-election audience, and just 99,000 in the key demo, a 36% loss.\nHowever, MSNBC has endured the biggest losses over CNN despite having a larger total audience. Its primetime programming has averaged 702,000 total viewers since the election, a whopping 47% drop, and only 69,000 in the key demo, hemorrhaging more than half versus pre-election.\nFox News maintains its dominance across total daytime programming, averaging 2 million total viewers since the election, while MSNBC and CNN have averaged just 368,000 and 527,000 respectively.\nFOX NEWS DIGITAL CRUSHES CNN, NY TIMES, OTHER MAJOR NEWS BRANDS IN KEY METRICS DURING OCTOBER\nMSNBC and CNN continue hemmeroging viewers since President-elect Donald Trump won the election earlier this month.(Evan Vucci/AP)\nPerhaps getting the most attention this week is the viewership revolt against MSNBC's marquee morning program \"Morning Joe\" after its co-hosts Joe Scarborough and Mika Brzezinskirevealed they had met with Trumpat Mar-a-Lago, something that has upset its far-left fan base.\nMSNBC’s \"Morning Joe\" has averaged 1.1 million total viewers from 6-9 a.m. ET in 2024, but Monday’s audience fell to 769,000 as liberal viewers changed the channel after the powwow with Trump was revealed.\n‘MORNING JOE’ CONTINUES TO LOSE VIEWERS EACH DAY SINCE MSNBC HOSTS REVEALED MAR-A-LAGO MEETING WITH TRUMP\nOn Tuesday, the audience shrunk again with 683,000 average total viewers tuning in, and it shriveled even more on Wednesday when it averaged only 618,000 total viewers.\nThursday's audience among the key demo was 55% lower than its pre-election viewership.\n\"Morning Joe\" has seen its audience shrink since co-hosts Joe Scarborough and Mika Brzezinski said they met face-to-face with President-elect Donald Trump.(Screenshot/MSNBC)\nCLICK HERE TO GET THE FOX NEWS APP\nBoth CNN and MSNBC face uncertain futures as CNN is expected to face mass layoffs and budget cuts in the coming months as MSNBC isbeing spun off by its parent company Comcastalong with several other cable networks, marking a corporate divorce from its sister network NBC News, which will be finalized next year.\nFox News' Brian Flood contributed to this report.\nJoseph A. Wulfsohn is a media reporter for Fox News Digital. Story tips can be sent to joseph.wulfsohn@fox.com and on Twitter: @JosephWulfsohn."}, {"source": "foxnews", "title": "Trump picks Dr. Janette Nesheiwat as nation's next surgeon general", "link": "https://www.foxnews.com/politics/trump-nominates-janette-nesheiwat-surgeon-general", "content": "Fox News host Laura Ingraham and senior medical analyst Dr. Marc Siegel weigh in on President-elect Donald Trump's nomination of Dr. Janette Nesheiwat as surgeon general.\nPresident-elect Trump has nominatedDr. Janette Nesheiwatas surgeon general.\nIn a statement on Friday evening, Trump said that Dr. Nesheiwat is a \"fierce advocate and strong communicator for preventative medicine and public health.\"\n\"I am proud to announce that Dr. Janette Nesheiwat will be the Nation’s Doctor as the United States Surgeon General. Dr. Nesheiwat is a double board-certified Medical Doctor with an unwavering commitment to saving and treating thousands of American lives,\" he said.\nGET TO KNOW DONALD TRUMP'S CABINET: WHO HAS THE PRESIDENT-ELECT PICKED SO FAR?\nDr. Janette Nesheiwat at the 2018 CHARM Back To School Bash in Nashville, Tenn.(Terry Wyatt/Getty Images)\nNesheiwat is a former Fox News medical contributor.\n\"She is committed to ensuring that Americans have access to affordable, quality healthcare, and believes in empowering individuals to take charge of their health to live longer, healthier lives,\" he added.\nTRUMP PICKS FORMER FLORIDA REP. DR. DAVE WELDON AS DIRECTOR OF THE CDC\nDr. Janette Nesheiwat attends the 2023 FOX Nation Patriot Awards at The Grand Ole Opry in Nashville, Oct. 16, 2023.(Terry Wyatt/Getty Images)\nNesheiwat serves as a medical director at CityMD, a network of urgent care centers in New York and New Jersey, and she was previously a physician at Washington Regional Medical Center and at Northwest Medical Hospital.\nTrump said that duringthe pandemic, Nesheiwat \"worked on the front lines in New York City treating thousands of Americans and helped patients in the aftermath of President Donald Trump’s Historic Operation Warp Speed that saved hundreds of millions of lives.\"\nHe also praised her \"expertise and leadership\" afterHurricane Katrinaand the Joplin tornadoes.\nDr. Janette Nesheiwat, left, Scott Stapp from the rock band Creed, and founder of the CHARM foundation, Jaclyn Stapp, at the 2018 CHARM Back To School Bash in Nashville, Aug. 4, 2018.(Terry Wyatt/Getty Images)\n\"She is also a member of Samaritan's Purse Disaster Assistance, Relief Team, and has provided lifesaving care during crises in Morocco, Haiti, and Poland,\" he added.\nNesheiwat graduated from the University of Arkansas for Medical Sciences and was inspired by her widowed immigrant mother's \"resilience and compassion\" to pursue a \"life of service, transforming her deep-seated desire to help others into a distinguished medical career.\"\nCLICK HERE TO GET THE FOX NEWS APP\nHe added, \"Dr. Nesheiwat will play a pivotal role in MAKING AMERICA HEALTHY AGAIN!\"\nSarah Rumpf-Whitten is a breaking news writer for Fox News Digital and Fox Business.\nStory tips and ideas can be sent to sarah.rumpf@fox.com and on X:@s_rumpfwhitten."}, {"source": "foxnews", "title": "Fox News Politics: Opening the flood Gaetz", "link": "https://www.foxnews.com/politics/fox-news-politics-11-21-2024", "content": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump transition, exclusive interviews and more Fox News politics content.\nHere's what's happening…\n-Who will Trumppick next for attorneygeneral after Gaetz's withdrawal?\n-Biden administrationloosens immigration restrictionsahead of second Trump term\n-Biden blamed forLaken Rileymurder while Trump brings hope for slain cheerleader's mom\nMatt Gaetz, the former Florida representative and Trump nominee for Attorney General, announced Thursday that he is withdrawing as Trump's pick for the top prosecutor, citing what he described as the \"distraction\" his nomination had caused due to a swirl of allegations about paying underage women for sex.\n\"While the momentum was strong, it is clear that my confirmation was unfairly becoming a distraction to the critical work of the Trump/Vance Transition,\" Gaetzsaid.\n\"There is no time to waste on a needlessly protracted Washington scuffle, thus I'll be withdrawing my name from consideration to serve as Attorney General. Trump's DOJ must be in place and ready on Day 1.\"\nThe news comes amid a swirl of allegations surrounding Gaetz, who for months had been under investigation by the House Ethics Committee until his resignation last Wednesday from the current congressional session…Read more\nNEW YORK, NEW YORK - MAY 16: Reps. Matt Gaetz (R-FL) (R) and Andy Ogles (R-TN) listen as former U.S. President Donald Trump speaks to the media during his trial for allegedly covering up hush money payments at Manhattan Criminal Court on May 16, 2024 in New York City. Trump was charged with 34 counts of falsifying business records last year, which prosecutors say was an effort to hide a potential sex scandal, both before and after the 2016 presidential election. Trump is the first former U.S. president to face trial on criminal charges.(Angela Weiss-Pool/Getty Images)\nWARP SPEED CONFIRMATIONS:Democrats advance five more Biden judicial nominees…Read more\nCANCELING DEBT:Biden administration informs Congress it will forgive $5B in economic loans to Ukraine…Read more\n'MAKE OR BREAK':Heritage launching $1M campaign targeting senators who could 'make or break' Trump Cabinet confirmations…Read more\nHELPING TRUMP:New Republican Governors Association chair says 'focus' is on helping Trump get 'off to a strong start'…Read more\nMILWAUKEE, WISCONSIN - JULY 18: Republican presidential candidate, former U.S. President Donald Trump waves to the crowd on the fourth day of the Republican National Convention at the Fiserv Forum on July 18, 2024 in Milwaukee, Wisconsin. Delegates, politicians, and the Republican faithful are in Milwaukee for the annual convention, concluding with former President Donald Trump accepting his party's presidential nomination. The RNC takes place from July 15-18. (Photo by Scott Olson/Getty Images)(Scott Olson/Getty Images)\nWHITE HOUSE FOR SALE?:Trump's incoming White House chief of staff's lobbying interest come under scrutiny…Read more\nBIG FAMILIES:Trump administration staffed by parents with big families…Read more\nINVESTIGATE THE WASTE:Comer to create DOGE subcommittee chaired by Marjorie Taylor Greene to work with Elon Musk, Vivek Ramaswamy…Read more\n'UNCONSTITUTIONAL':Ted Cruz urges White House to halt $1.25B in 'digital equity' funds…Read more\n'SHOCKING DEPARTURE':FBI director, Homeland Security secretary refuse to publicly testify, Senate chairman says…Read more\nSKIPPING OUT ON SENATE:Hawley says Mayorkas, Wray 'absolutely' skipped Senate hearing due to Laken Riley verdict, calls for subpoena…Read more\n'NO STANDING':Fetterman says 'F--- that' amid bipartisan backlash over arrest warrants targeting Israel's Netanyahu, Gallant…Read more\n'EFFICIENT AND ACCOUNTABLE':GOP-led DOGE bill aims to slash outflow of federal dollars…Read more\nCongress is racing to be ready to execute the recommendations of Trump's new DOGE commission(Getty Images)\nSENATE SHOWDOWN:GOP secures deal with Schumer to save coveted appellate judges for Trump…Read more\n3 MORE TO GO:3 uncalled House races to determine size of House GOP majority…Read more\n'PASSION IN MY HEART':Democratic Pennsylvania election official apologizes for controversial comments as Senate recount begins…Read more\nWHAT WENT WRONG?:Harris campaign officials explain what went wrong-  and what Trump did right…Read more\nKamala Harris and Donald Trump are seen with the flag of United States on a mobile phone screen.(Dilara Irem Sancar/Anadolu via Getty Images)\nMANHUNT UNDERWAY:Connecticut manhunt underway after suspect allegedly kills mother, infant in drive-by shooting…Read more\nREADING THE AUTOPSY:Daniel Penny defense calls forensic pathologist to witness stand: 'The chokehold did not cause the death'…Read more\nDaniel Penny arrives for opening arguments in his trial at Manhattan Criminal Court in New York City on November 01, 2024.\nSMIRKING SUSPECT:Florida mom accused of drowning 14-year-old daughter in bathtub, authorities say…Read more\nDISMANTLING DEI:Conservative watchdog releases 'toolkit' to help parents file complaints with the Department of Education…Read more\nNOT GUILTY PLEA:Father of Georgia high school shooting suspect pleads not guilty…Read more\nWAR GAMES:Would the US win a war with China over Taiwan? US lawmakers briefed on the potential outcome…Read more\nLAST CALL:Caravan of 1,500 migrants forms in Mexico…Read more\nGet the latest updates on the Trump presidential transition, incoming Congress, exclusive interviews and more onFoxNews.com.\nThis article was written by Fox News staff."}, {"source": "foxnews", "title": "Fox News Politics: Fetterman says he's open to Oz", "link": "https://www.foxnews.com/politics/fox-news-politics-fetterman-says-hes-open-oz", "content": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump transition, exclusive interviews and more Fox News politics content.\nHere's what's happening…\n-Speaker Johnsonmakes clarification after statement regarding transgender House member-elect\n-Top 10 states whereTrump outperformedin 2024\n-Republican Gov. Glenn Youngkin of Virginia says with Trump’s election, ‘we’ve got afriend in the White House’\nSen. John Fetterman, D-Pa., said he would vote to confirm his former political opponentDr. Mehmet Ozto serve as Centers for Medicare and Medicaid Services (CMS) administrator if Oz plans to protect the government programs.\n\"If Dr. Oz is about protecting and preserving Medicare and Medicaid, I’m voting for the dude,\" Fetterman tweeted.\nFetterman defeated Oz, a Republican, in Pennsylvania's 2022 U.S. Senate race…Read more\nLeft:  Sen. John Fetterman, D-Pa., on Tuesday, Jan. 9, 2024; Right: Republican U.S. Senate candidate Dr. Mehmet Oz laughs during a safer streets community discussion at Galdos Catering and Entertainment on Oct. 13, 2022 in Philadelphia, Pa.(Left: Tom Williams/CQ-Roll Call, Inc via Getty Images; Right: Mark Makela/Getty Images)\n'THEY MAKE US STRONGER':Biden Defense Secretary argues women, racial diversity 'make us stronger' as Trump admin looms…Read more\nMR PRESIDENT!?: Biden skips taking questions at G-20 in Brazil, despite reporter pleading with him…Read more\nMACHINE BIAS: Biden admin warns AI in schools may exhibit racial bias, anti-trans discrimination and trigger investigations…Read more\nMAJOR CHANGES:Biden makes another Ukraine policy shift with approval of sending anti-personnel mines…Read more\nU.S. President Joe Biden shakes hands with Ukrainian President Volodymyr Zelenskyy in Paris, France, on Friday, June 7.(AP/Evan Vucci)\n'WOMEN'S ONLY SPACES': Speaker Johnson announces new Capitol bathroom policy in response to controversy over trans new House member…Read more\n'CLEAR DEADLINE':Biden admin Commerce Dept seeks to exhaust CHIPS Act funding before Biden leaves office…Read more\nWHISTLEBLOWER'S FREEDOM:Trump Cabinet picks increase odds Edward Snowden could see life of freedom in the US…Read more\nVISA ABUSE:Trump could seek to roll back habitually ‘defrauded’ immigration program, expert says…Read more\nPresident-elect Donald Trump arrives before the launch of the sixth test flight of the SpaceX Starship rocket Tuesday, Nov. 19, 2024 in Boca Chica, Texas.(AP)\nWHITAKER TAPPED:Trump taps former acting AG Matthew Whitaker as NATO ambassador…Read more\nTHE SPRINT:Race to confirm Trump nominees kicks off in January - Chad Pergram…Read more\n'IMMEDIATE DISMISSAL':Trump lawyers demand Bragg case be 'immediately dismissed,' say election 'supersedes' 'political motivations'…Read more\nNUCLEAR THREAT:Iran vastly increased nuclear fuel stockpile ahead of Trump return, UN agency finds…Read more\n'EXIT RAMP':Trump's cut to Biden's EV tax credit, backed by Musk, may impact auto industry, experts say…Read more\nHEAR HIM OUT:Lindsey Graham urges GOP not to form 'lynch mob' ahead of Gaetz confirmation…Read more\n'VERY PLEASED':House passes bill to bolster geothermal energy production by increasing lease sale frequency…Read more\nBATHROOM BATTLE:Nancy Mace’s effort to ban transgender Delaware Democrat from Capitol women's restrooms gains support…Read more\nSTILL WAITING:5 uncalled House races to determine size of Republican majority…Read more\nMRC Free Speech America feels Speaker Mike Johnson should \"direct relevant committees and committee chairmen to investigate Google for abridging people’s constitutional rights.\"(AP/J. Scott Applewhite)\n'GO THE WAY OF THE DODO':Incoming Senate Dem Elissa Slotkin torches identity politics in 2024 autopsy…Read more\nWATCHERS ON THE WAY:Congressional election observers deploy to Iowa for recount in uncalled House race…Read more\nTOLEDO TOSSUP:Democratic Ohio Rep. Kaptur narrowly wins re-election, keeping Republican majority at 218 seats…Read more\nNEVER AGAIN:DePaul University student assaulted by anti-Israel agitator seeks legal action: 'I will never apologize'…Read more\nHISTORIC REJECTION: Calif rejects minimum wage hike…Read more\n'OPEN TO MEETING':Elon Musk wants to meet Alex Soros — and Soros says he's open to it…Read more\nHITTING HOME:Illegal with suspected Tren de Aragua ties robbed Manhattan prosecutor in her apartment building: police…Read more\nThis compilation shows a suspected Tren de Aragua members and the southern border,(Fox News/Border Patrol)\nEX-POLL WORKER INDICTED:Ex-Georgia poll worker indicted for mailing bomb threat to polling place: FBI..Read more\nAMENDMENT:Louisiana lawmakers weighing constitutional amendment that would send more juvenile offenders to adult jails…Read more\n'THIS IS THE RESULT':Democrat mayor slams his own party after deadly hours-long stabbing spree…Read more\nGet the latest updates on the Trump presidential transition, incoming Congress, exclusive interviews and more onFoxNews.com.\nThis article was written by Fox News staff."}, {"source": "foxnews", "title": "Fox News Politics: Trump case may be on hold until 2029", "link": "https://www.foxnews.com/politics/fox-news-politics-trump-case-hold-until-2029", "content": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump transition, exclusive interviews and more Fox News politics content.\nHere's what's happening…\n- GOP lawmaker launches caucus to help Elon Musk take on'Crazytown’\n- Massive groups ofillegal immigrantscaught at border amid fears of pre-Trump border surge\n- Size of slim Republican House majority hangs on5 uncalled races\nNew York prosecutors are requesting a stay until at least 2029 in New York v. Trump, as the president's defense attorneys prepare to move to dismiss the case entirely.\nProsecutors wrote a letter to Judge Juan Merchan on Tuesday, who agreed last week to grant a stay on all deadlines associated with the conviction proceedings against Trump in the final months before he takes office.\nMerchan granted the request, which issues a stay on all deadlines, including the Nov. 26 sentencing date, to consider the effect of his election as president.\nProsecutors had asked for the pause in proceedings, which they said would allow them to better evaluate the impact of Trump’s new status as president-elect…Read more\nNEW YORK, NEW YORK - NOVEMBER 16: President-elect Donald Trump looks on during the UFC 309 event at Madison Square Garden on November 16, 2024 in New York City. (Photo by Chris Unger/Zuffa LLC)(Photo by Chris Unger/Zuffa LLC)\nDEFYING DEATH:Pro-Trump prison warden asks Biden to commute all death sentences before leaving…Read more\n'LOGISTICAL ISSUES':Biden misses G-20 family photo, White House blames 'logistical' issues…Read more\n'BEST AVAILABLE SCIENCE':Biden Interior Dept puts together handbook to apply 'indigenous knowledge' into agency practices…Read more\nMembers of the Waorani indigenous community demonstrate for peace, for nature and to promote a Yes vote in an upcoming referendum to end oil drilling in the Yasuni National Park, in the commercial area in northern Quito on August 14, 2023.(MARTIN BERNETTI/AFP via Getty Images)\n'CHAMPION FOR CONSERVATION':Environmental groups present differing opinions of Trump's energy and environment appointees…Read more\nQUICKER CABINET:Trump naming Cabinet officials at 'warp speed,' far head of first term pace…Read more\nLOYALTY MATTERS:Why Trump is sticking with Gaetz, Hegseth despite new accusations – and his 'Morning Joe' meeting…Read more\nREPORT CARD:House Ethics Committee to meet Wednesday after postponing Gaetz investigation meeting…Read more\nFACT CHECK:Are Pete Hegseth's tattoos symbols of 'Christian nationalism'?…Read more\n(Fox News)\n'UNFINISHED BUSINESS':Former Trump education secretary lays out 'unfinished business' for new admin on school reforms…Read more\nBUREAU STONEWALLING:Trump assassination attempt task force subpoenas 2 ATF employees, alleging stonewalling…Read more\nWON'T BACK DOWN:Mace faces backlash over resolution to keep new transgender member of Congress out of women's bathrooms…Read more\nNOT ENOUGH:Rep. Marjorie Taylor Greene wants men banned from women's spaces in 'all taxpayer-funded facilities'…Read more\nSENATE PROTEST:Anti-Israel protesters arrested in Senate office building…Read more\nPolice arrested three protesters from inside the Philip A. Hart Senate Office Building.(Fox News)\nEYE OF THE STORM:House Republicans eye FEMA fund overhaul ahead of high-stakes hearing on Helene recovery…Read more\nSENATE STAND OFF:Senate GOP initiates Thune-engineered slow down as Schumer looks to stack judicial votes…Read more\nFISCAL FIGHT:Speaker Johnson's government funding play hits the rocks within House GOP…Read more\nDEMOCRATS IN DISARRAY:Growing field in race to chair the DNC…Read more\n'RULE OF LAW MATTERS':Pennsylvania Gov. Shapiro side with state supreme court ruling not to count certain mail-in ballots…Read more\nGovernor of Pennsylvania Josh Shapiro is seen at the Celebration of Freedom Ceremony during Wawa Welcome America on July 04, 2023 in Philadelphia, Pennsylvania.(Gilbert Carrasquillo/GC Images)\nHEALTH CARE DECISIONS:Wyoming judge strikes down state abortion laws, ruling them unconstitutional…Read more\nHOMELESS RIGHTS:Washington state Democrat pushes to make homelessness a civil right…Read more\nSQUATTERS BEWARE:Squatters meet resistance with red state push to protect homeowners…Read more\nTO FREE OR NOT TO FREE:Gov. Newsom announces decision in Menendez brothers case…Read more\nLyle, left, and Erik Menendez sit with defense attorney Leslie Abramson, right, in Beverly Hills Municipal Court during a hearing, Nov. 26, 1990.(AP Photo/Nick Ut)\nWINDY CITY WORRY:Proposed Chicago police resource cuts could land city in court, top officials warn…Read more\n'NO MORALS':College plan to use 'creative ideas' to pay undocumented students blasted by GOP leader…Read more\nBORDER BATTLE:Border state governor vows to defy Trump's ‘misguided’ mass deportation push…Read more\nHOME INSPECTION:FEMA director vows to request IG investigation into order to avoid Trump supporters' houses…Read more\n'CANADIAN PROMISE':Prime Minister Justin Trudeau says Canada 'could have acted quicker' on reining in immigration…Read more\nEND FAVORED NATION STATUS:Bipartisan panel urges Congress to toss out decades of trade policy they say China has been exploiting…Read more\n1,000 DAYS:Ukraine war hits milestone as tensions rise over potential Russian escalation…Read more\nUkraine's President Volodymyr Zelenskyy addresses the Ukraine Defense Contact Group during a meeting of NATO defense ministers at NATO headquarters in Brussels, Wednesday, Oct. 11, 2023. Ukraine's President Volodymyr Zelenskyy has arrived at NATO for meetings with alliance defense ministers to further drum up support for Ukraine's fight against Russia.(Olivier Matthys, Pool Photo via AP)\n'GO IT ALONE':Netanyahu says he ignored Biden's war counsel — and threats that Israel would be 'left alone' without US help…Read more\nMISSILE BARRAGE:Ukraine fires first barrage of US-made long-range missiles into Russia, Kremlin says…Read more\nRUSSIA'S 'HYBRID' WARFARE?:US allies accuse Russia of 'escalating hybrid activities' against NATO, EU nations after data cables severed…Read more\nGet the latest updates on the Trump presidential transition, incoming Congress, exclusive interviews and more onFoxNews.com.\nThis article was written by Fox News staff."}, {"source": "foxnews", "title": "The rise of digital voices, and Comcast splitting in two, brings doomsday predictions for traditional media", "link": "https://www.foxnews.com/media/rise-digital-voices-comcast-splitting-two-brings-doomsday-predictions-traditional-media", "content": "National Review staff writer Caroline Downey and Oakland Corps adviser Lucy Caldwell joined 'MediaBuzz' to discuss why the former presidential candidate has faced scrutiny from the media and other critics.\nComcast’s cable networks, which include MSNBC and CNBC, make a heckuva lot of money.\nIt doesn’t matter.\nAs the Wall Street Journal first reported, the communications giant confirmed yesterday it’s spinning off almost all its cable properties, including USA, E!, Oxygen, Syfy and Golf Channel, which generated $7 billion in revenue in the latest 12-month period.\nStaying with the mother ship are the NBC television network, the Peacock streaming service and Bravo, plus sports, movies and theme parks.\nHACKER OBTAINS HOUSE ETHICS TESTIMONY ON MATT GAETZ AS TRUMP MAKES CALLS FOR AG NOMINEE\nPrognosticators have warned for years that cable news is plagued by aging audiences.(iStock)\nBeyond the financial questions – whether the smaller cable units have to seek a larger partner – is an unmistakable implication: that all-news channels have a questionable future.\nWith CNN having done a round of layoffs last year and expected to impose deeper cuts under its new boss, cable staffers, including top anchors, are nervous about their hazy future.\nPrognosticators have warned for years that cable news is plagued by aging audiences – although Fox’s ratings have never been higher – and, along with newspapers, are being eclipsed by newfangled digital media.\nThe shift was on display during the presidential campaign,when Donald Trumpand Kamala Harris made plenty of news on podcasts and by courting social media influencers. No question such disruptors shook up the campaign, helping to break the monopoly of the corporate media and giving a platform to new, more freewheeling voices.\nMEDIA LIBERALS SAVAGE KAMALA AS TRUMP PICKS EXPERIENCED HARD-LINERS\nInthe Free Press,author and former CIA analyst Martin Gurri argues:\n\"The campaign saw the news media, as an institution, take a giant leap toward irrelevance — and ultimate extinction. From the New York Times to CBS News, the grand old brands of the industry gambled what shreds of trust remained in them — 31% by one measure — to exert influence on behalf ofDemocratic candidatesand progressive positions. They lost the public’s trust, yet failed to move the needle.\"\nCiting a new term, Gurri says that \"coverage of the election felt like postjournalism on acid. Joe Biden received extravagant praise as a wise, experienced leader until he became a political liability. Then, overnight, the media pack tore him apart for being too old and infirm, memory-holing the fact that they had spent the past three years assailing anyone who questioned the lie that he was ‘sharp as a tack.’\nA side-by-side of Kamala Harris and President-elect Donald Trump.(Getty Images)\n\"Attacks on Trump were so bizarrely strident, and at the same time so ritualized, that they attained the aspect of parody if not wit. My favorite election story was The Atlantic’s ‘Trump Is Speaking Like Hitler, Stalin and Mussolini.’ Not long after its publication, the three-headed super-totalitarian could be found cooking French fries at a McDonald’sin Pennsylvania.\"\nHe also points to Washington Post conservative columnist-turned-Trump-hater Jennifer Rubin, who tweeted: \"It is 1933. Hitler is in power.\"\nTRUMP, DEFYING MEDIA PREDICTIONS, MAINLY PICKS SEASONED CAPITOL HILL VETERANS SUCH AS MARCO RUBIO\nAll this \"went beyond the old joke about rearranging the deck chairs on the Titanic: It was fighting noisily over the best seats in the house, while an entire industry burned to the ground.\nI have to blow the whistle on the overheated rhetoric. While it’s fashionable to dismiss the \"legacy media,\" they aren’t headed for extinction or burning to the ground.\nIn this photo illustration, a girl looks at the CNN website on her laptop as she awaits the 2024 US election vote count between Donald Trump and Kamala Harris.(Faisal Bashir/SOPA Images/LightRocket via Getty Images)\nFor all their flaws and bias, they do this thing called reporting. Most of the disclosures about the most controversial Trump nominees have come from big news organizations. And the most important moments of the campaign, the two debates and key interviews, have played out on television.\nStill, the times they are a’changing.\nThe rise of Substack has provided journalists and others with an independent platform, and it has doubled down on politics while outlets likeMeta’s Facebookand Instagram are minimizing such content.\n\"There’s a desperate need for a quality platform with trusted voices, where honest-to-God political discussion, debate, disagreement can happen without it either disappearing into the ether or taking place on a platform where there’s constant knife fights and flame wars,\" co-founder Hamish McKenzie toldthe New York Times.\nThe biggest stars have earned millions of dollars in subscription revenue. The Times says these include data guru Nate Silver and the Bulwark, the conservative, anti-Trump site. The Bulwark says it raked in about $6 million in annual revenue from Substack. Silver says he’s making more money than at ABC.\nBut Substack,which Elon Muskonce tried to buy, is not profitable, since the company only takes a 10% cut of earnings. Musk temporarily refused to allow Substack links on X.\nCLICK HERE TO GET THE FOX NEWS APP\nHowever this all shakes out, it’s a strong platform for disaffected or laid-off journalists, as well as unknowns who build a following with their specialties.\nThe Comcast move telegraphs how much the media landscape has changed. But those who predict doom for the traditional media are missing the mark; all of America isn’t constantly online.\nHoward Kurtz is the host of FOX News Channel'sMediaBuzz(Sundays 11 a.m.-12 p.m. ET). Based in Washington, D.C., he joined the network in July 2013 and regularly appears onSpecial Report with Bret Baierand other programs."}, {"source": "foxnews", "title": "Hacker obtains House ethics testimony on Matt Gaetz as Trump makes calls for AG nominee", "link": "https://www.foxnews.com/politics/hacker-obtains-house-ethics-testimony-matt-gaetz-trump-makes-calls-ag-nominee", "content": "National Review staff writer Caroline Downey and Oakland Corps adviser Lucy Caldwell joined 'MediaBuzz' to discuss why the former presidential candidate has faced scrutiny from the media and other critics.\nDavid French, the conservativeNew York Times contributorand longtime anti-Trumper, has a provocative take on why the president-elect won.\nIt’s the economy and the border, stupid.\n\"I can’t help but think that if the withdrawal from Afghanistan hadn’t been a bloody mess (that’s whenPresident Biden’sapproval rating went underwater, and it never came back), if inflation hadn’t spiked and if migration hadn’t surged at the border, then we’d be having a different conversation.\n\"I know that theHarris campaignhad answers for all these criticisms. The American people wanted to end the Afghan war, and Biden was saddled with Trump’s terrible deal with the Taliban. Inflation was a global phenomenon, and it was unfair to entirely blame Biden when, by 2023, America had the lowest inflation rate among the Group of 7 countries. The Biden administration had finally cracked down on the border and had endorsed a tough new border bill.\"\nWHY TRUMP IS STICKING WITH GAETZ, HEGSETH DESPITE NEW ACCUSATIONS – AND HIS 'MORNING JOE' MEETING\nFILE - Then-Republican presidential nominee former President Donald Trump speaks during a campaign event, Wednesday, Sept. 25, 2024, in Mint Hill, N.C.(AP Photo/Evan Vucci, File)\nHe adds that \"they also rightly argued that Trump nostalgia was misplaced. It was wrong to give the former president a passfor the pandemicor for the chaos and murder spikes of 2020. His term did not end in 2019, with peace and prosperity. It ended near the beginning of 2021 with disease, violence and cultural decay. Even the memories of the time before Covid are idealized.\"\nSo it was really Joe Biden who lost the election by letting inflation spiral – he was, in fairness, digging out of the pandemic – and turning the border into a free-for-all zone. He was also a terrible salesman for a series of bipartisan victories.\nWhen his mental decline became obvious at the debate, and he stepped aside for Kamala Harris, she had to run on that record – and famously told \"The View\" that she couldn’t think of a single thing where she differed with the president.\nSo the powerless Democrats may be more screwed than you think.\nTHE PODCAST CAMPAIGN: IS IT CURTAINS FOR MAINSTREAM MEDIA?\nGiven the party’s evolution from champion of the working class to representing the highly educated coastal elites in politics, academia and journalism, the Dems are left without a winning coalition they once took for granted.\nIn aTimes news story,Jennifer Medina writes:\n\"The working-class voters Vice President Kamala Harris’s presidential campaign needed were not moved by talk of joy. They were too angry about feeling broke.\nVice President Kamala Harris thanks and speaks with supporters after conceding to former President Donald Trump at The Yard at Howard University in Washington, DC on November 6, 2024.(Marvin Joseph/The Washington Post via Getty Images)\n\"The losses up and down the ballot leaveDemocrats in crisis. Voters without a college degree make up a solid majority of the electorate. Without them, the White House could be out of reach. And for a party that stands for and takes pride in its diversity, the erosion of support from voters of color calls its identity into question.\"\nWhat’s more, in interviewing hundreds of working-class minority voters, Medina found that \"for many, hope had already hardened into cynicism. Promises about affordable housing fell flat and promoting accomplishments on insulin prices failed to break through. Simply put, their trust in the Democratic Party was gone.\"\nMEDIA LIBERALS SAVAGE KAMALA AS TRUMP PICKS EXPERIENCED HARD-LINERS\nNow that brings us toDonald Trump’sself-proclaimed mandate, even if CNN was happy to report that Trump’s vote share had dropped slightly below 50% (Who cares? He’s the 47th president.)\nNow comes news, first reported by ABC, that an unidentified hacker has obtained the sworn testimony of Matt Gaetz accusers from the House ethics probe and apparently plans to make it public.\nThe hacker accessed the file through a law firm involved in a civil suit against Joel Greenberg, a former Gaetz pal now serving an 11-year prison term for sex trafficking. The file includes testimony under oath by a woman who says she had sex with Gaetz when she was 17, back in 2017, and from another woman saying she witnessed the sexual encounter.\nMatt Gaetz speaks at the Republican Party of Florida Freedom Summit, Nov. 4, 2023, in Kissimmee, Fla.(AP Photo/Phelan M. Ebenhack)\nAsked for comment, Trump transition spokesman Alex Pfeiffer said: \"Matt Gaetz will be the next attorney general. He’s the right man for the job and will end the weaponization of our justice system.\n\"These are baseless allegations intended to derail the second Trump administration. The Biden Justice Department investigated Gaetz for years and cleared him of wrongdoing. The only people who went to prison over these allegations were those lying about Matt Gaetz.\"\nTrump is making calls on behalf of Gaetz, and J.D. Vance is escorting him and other nominees around the Hill.\nThe Times reports that Trump realizes that Gaetz may not be confirmed. This is a matter of simple math, since most GOP senators have not committed to supporting him. Yet the president-elect will not back off or force Gaetz to withdraw the nomination.\nBut if Gaetz falls short, it would be hard for the Senate to reject a replacement nominee, who might have the same views on disrupting and perhaps politicizing the DOJ, but without the ex-congressman’s baggage.\nThe House ethics panel, while stymied by Gaetz’s abrupt resignation, is meeting today on the report.\nCLICK HERE TO GET THE FOX NEWS APP\nOne new disclosure that could hurt him: Gaetz used his adopted son’s PayPal account to pay one of the women, who was not a minor. Doesn’t that sound like someone with something embarrassing to hide?\nThe Democrats have some influence in this process, as they’d only have to pick off four of the 53 GOP senators to block Matt Gaetz. But they are also consumed by their election shellacking and will have a hard time defeating Trump on just about anything.\nHoward Kurtz is the host of FOX News Channel'sMediaBuzz(Sundays 11 a.m.-12 p.m. ET). Based in Washington, D.C., he joined the network in July 2013 and regularly appears onSpecial Report with Bret Baierand other programs."}]