[{"source": "foxnews", "title": "Freshman Focus: Republican Rob Bresnahan, who ousted six-term House Democrat, reveals how he did it", "link": "https://www.foxnews.com/politics/freshman-focus-republican-rob-bresnahan-who-ousted-six-term-house-democrat-reveals-how-he-did", "content": "Rep.-elect Rob Bresnahan, a Republican who won election to the House of Representatives in Pennsylvania's 8th Congressional District, discusses the concerns his voters shared on the campaign trail with Fox News Digital.\nVoters inPennsylvania's 8th Congressional Districtgave six-term incumbent Rep. Matt Cartwright, D-Pa., the boot last month in favor of a young, energetic and successful businessman who says he's ready to defend their interests in the nation's capital.\nRepublican Rep.-elect Rob Bresnahan, 34, tells Fox News Digital in an interview that \"kitchen table issues\" helped him connect with northeastern Pennsylvanians and oust Cartwright, a progressive who had served in Congress for more than a decade.\n\"When we were knocking on doors and talking to people every single day over a period of 13 months, the first thing anyone had to say was, ‘I can’t afford my bills. I can't afford rent. I can't afford my mortgage. I can't afford school property taxes. I can't afford groceries,'\" Bresnahan said.\nRising prices for food and gas have made living costs unaffordable for Pennsylvanians, he explained. And as voters have watched illegal immigrants overrun the southern border and be provided free food, housing and benefits, while billions in foreign aid flows out from the U.S. to other countries, they felt that foreigners were being treated better than Americans by their government, said Bresnahan.\nPENNSYLVANIA DEMOCRAT REP. MATT CARTWRIGHT CONCEDES RACE TO GOP CHALLENGER\nDemocratic Pennsylvania Rep. Matt Cartwright and Republican Pennsylvania House candidate Rob Bresnahan.(Getty Images/Rob for PA)\n\"We're looking around at our neighbors saying, ‘hey, what about us here?’ And they couldn't help but feel that they have been put second for a long time.\"\nBresnahan was a success story before he won election to theHouse of Representatives. A fifth-generation native of Luzerne County, at just 19 years old he was entrusted to be CFO of his grandfather's construction company, which builds electrical infrastructure for municipalities and highways throughout Pennsylvania.\nHe spent his college years at the University of Scranton dashing back and forth between the office and class as he worked to help the business recover from the global financial crisis. His hard work paid off, the business grew and Bresnahan became CEO after graduating in 2013.\n\"I was still living at home with my parents and I was in and out of a dorm room and running a company with 58 employees even though I couldn’t legally drink a Coors Light yet,\" he told the Citizen's Voice in 2021. \"The combination was a heavy workload but it was a sacrifice that I would make again in a second.\"\nBut as the years passed, Bresnahan, like many Americans, felt the country was headed on the wrong track. The decisions coming from Washington, D.C., were bad for his business, his employees and the people they serve. And so, he decided to enter politics to make a difference.\n\"I felt that the country was not heading in the right trajectory with what is happening on our southern border. We had life essentially unaffordable for the average person. And I've always been a person to roll up my sleeves and throw myself into fire,\" Bresnahan said.\nPA DEM IN DISTRICT THAT VOTED FOR TRUMP SAYS HE'S A MODERATE, BUT VOTING RECORD TELLS ANOTHER STORY\nRob Bresnahan, Republican nominee for Pennsylvania's 8th Congressional District, takes the stage during a Trump campaign rally at Riverfront Sports on Oct. 9, 2024 in Scranton, Pennsylvania.(Getty Images)\nHis winning congressional campaign focused on securing the border, cutting taxes and trimming government spending, creating \"family-sustaining jobs\" in the Keystone State and supporting law enforcement. In April, Bresnahan received an endorsement from President-electDonald Trump.\n\"A successful Businessman, Rob has worked hard to Create Jobs and Grow the Economy, unlike his opponent, Matt Cartwright, who is completely beholden to Nancy Pelosi and the Radical Left,\" Trump posted on Truth Social.\nWith the campaign behind him, Bresnahan says he and the other members of the incoming Republican majority in Congress are ready to hit the ground running with a pro-growth agenda in January.\n\"Securing the border. That needs to be done day one, Jan. 3 at 12:01 p.m., the day after we are all sworn in,\" he told Fox News Digital. \"I think there's going to be a big playbook, but that is a tangible win right off the bat.\"\nSINGLE HOUSE RACE STANDS BETWEEN REPUBLICANS AND 1-SEAT MAJORITY\nA view of the U.S. Capitol in Washington, D.C., on Nov. 4, 2024, ahead of the 2024 presidential election.(Nicolas Economou/NurPhoto via Getty Images)\nOn inflation, Bresnahan says Congress and the Trump administration can tackle unaffordable prices by lowering energy costs. \"Talking about just Pennsylvania alone, 52% of homes are heated from natural gas. $45 billion a year are generated from the natural gas industry, and $76 billion in GDP comes out of the fracking and natural gas industry,\" he said, insisting that policymakers must stop \"vilifying natural resources.\"\nThe rising national debt, at $36 trillion, is another burden on the economy Bresnahan says Congress must address. \"We're spending more on debt servicing – just our national debt and the interest – than we are on our national defense budget.\"\nThe young lawmaker said there will be \"tough votes\" on discretionary spending when Congress convenes in January. But two of the largest contributors to the federal debt and deficit will remain untouched.\n\"Obviously, we can't cut Medicare. We can't cut Social Security. We have to preserve that for our current generation, and we have to find ways to preserve it for our generation and the next generation. But I don't believe that there's a one-size-fits-all policy on any circumstance, let alone the national debt and the expenditures of the federal government,\" Bresnahan said.\nHowever, he added that illegal immigrants should not benefit from programs that Americans have paid in to, including Social Security and Medicare.\nREPUBLICANS PROJECTED TO KEEP CONTROL OF HOUSE AS TRUMP PREPARES TO IMPLEMENT AGENDA\nSpeaker of the House Mike Johnson, R-La., is expected to keep his job after Republicans held on to their House majority.(Tom Williams/CQ-Roll Call, Inc via Getty Images)\nRepublicans are expected to extend the 2017 tax cuts that became law during Trump's first term in office. Bresnahan says he supports those tax cuts and insists that economic growth spurred by deregulation and investments in infrastructure and American jobs can make up for any potential revenue losses.\n\"We have to get people back to work,\" he said. \"We have to create economic climates that are conducive to the American people to incentivize them to go to work.\"\nPart of that is to support jobs that don't require a college degree, such as carpenters, plumbers or electricians. \"These are great, family-sustaining careers with annuities starting on day one, with health insurance for your family, and you're earning while you learn.\"\nTurning to foreign policy, Bresnahan said the United States must remain a global superpower and pursue \"peace through strength.\"\n\"But we have to be strong as the United States,\" he added. Asked about growing GOP opposition to foreign aid, including to Ukraine, Bresnahan emphasized that he supports efforts to push back against Russian aggression – but he wants to do so responsibly.\nYOUNGEST HOUSE REPUBLICAN-ELECT REVEALS HOW GOP WON BACK AMERICA'S YOUTH\n\"Putin is a war criminal and needs to be stopped,\" he said. \"I am all supportive of providing weapons, missiles, rockets – actually, there's a big manufacturing facility inside of my district. But where I do want accountability is the raw, hard dollars that have been sent. I want audits done on those to ensure they're going to the right causes.\"\nEchoing Trump's beliefs about putting America first, Bresnahan said there is a point where \"enough is enough\" and that Europe has to match U.S. contributions to foreign aid.\n\"Again, I'm looking at, you know, 25% of my bridges are structurally deficient. We have aging infrastructure levees that protect over $1 trillion of property here in the United States. You're talking about power distribution grids that haven't been re-invested in since the 1950s with 50 years of usable life. And, you know, we were without power for multiple days now, going on which could possibly be a week (Editor's note: A blizzard in Breshanan's district had postponed this interview). Europe didn't come and send over trucks to help us rebuild our grids.\"\n\"Ukraine obviously has a lot going on, but we need to take care of our own people. We have to take care of our own Americans. And I believe Donald Trump had that narrative and that's why he just won an election in a landslide, because it's about us,\" he added.\nBresnahan hopes to bring \"common sense\" solutions to the complex problems facing Americans. He has pledged to work with whomever has a good idea, Republican or Democrat, and has earned endorsements from both No Labels and the moderate Problem Solvers Caucus. Though he calls himself a \"fiscal conservative,\" he rejects political labels because \"I don't think confirmation bias is the right way to solve any issue.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"I believe most challenges can be overcome through healthy and solid debate,\" he added.\nAnd what about those issues that inflame passions on both sides? Before this interview, Rep. Nancy Mace, R-S.C., made national headlines after she put forward a resolution that would bar Rep. Sarah McBride, D-Del., a transgender lawmaker who is biologically male, from using the women's bathrooms in the capitol.\nBresnahan said that while he believes biological men should not play in women's sports or use their facilities, the flare up between Mace and McBride distracts from other important issues facing Americans – like crumbling infrastructure and expensive living costs.\n\"I don't want the 119th Congress to be hijacked by what bathrooms we should be using when we have been elected to provide real solutions for the real American people. And that's what I'm going down to Washington, D.C. to do.\"\nFox News Digital's Emma Colton contributed to this report.\nGet the latest updates from the 2024 campaign, exclusive interviews and more at our Fox News Digital election hub.\nChris Pandolfo is a breaking news reporter for Fox News Digital. Send tips to chris.pandolfo@fox.com and follow him on Twitter @ChrisCPandolfo."}, {"source": "foxnews", "title": "Jeffries wants Biden to dole out pardons for people aggressively prosecuted 'for nonviolent offenses'", "link": "https://www.foxnews.com/politics/jeffries-wants-biden-dole-out-pardons-people-aggressively-prosecuted-for-nonviolent-offenses", "content": "Fox News senior national correspondent Rich Edson has more on Democrats' reaction to President Biden's decision to pardon his son on 'Special Report.'\nOn the heels ofPresident Joe Biden'smove to issue a sweeping pardon for his son Hunter Biden, House Democratic Leader Hakeem Jeffries, D-N.Y., issued a statement suggesting the president should issue pardons for individuals who faced \"aggressive prosecutions for nonviolent offenses.\"\n\"Throughout his life, President Joe Biden has fought to improve the plight of hardworking Americans struggling to live paycheck to paycheck,\" Jeffries said in the statement. \"Many of these people have been aggressively prosecuted and harshly sentenced for nonviolent offenses, often without the benefit of adequate legal representation. Countless lives, families and communities have been adversely impacted, particularly in parts of Appalachia, Urban America and the Heartland.\n\"During his final weeks in office, President Biden should exercise the high level of compassion he has consistently demonstrated throughout his life, including toward his son, and pardon on a case-by-case basis the working-class Americans in the federal prison system whose lives have been ruined by unjustly aggressive prosecutions for nonviolent offenses,\" Jeffries continued.\n\"This moment calls for liberty and justice for all,\" he concluded.\nREPUBLICANS HAMMER BIDEN'S ‘NO ONE IS ABOVE THE LAW’ CLAIM FOLLOWING HUNTER PARDON: ‘AGED LIKE FINE MILK’\nRep. Hakeem Jeffries, D-N.Y., speaks during a Get Out the Vote rally for Lauren Gillen, Democratic Congressional candidate in New York, not pictured, at Kennedy Memorial Park in Hempstead, N.Y. on Thursday, Oct. 17, 2024; Right: President Joe Biden delivers remarks from the Rose Garden at the White House on Nov. 26, 2024, in Washington, D.C.(Left: Adam Gray/Bloomberg via Getty Images; Right: Kevin Dietsch/Getty Images)\nThe president's pardon ofHunter Bidencovers more than a decade.\nThe \"Full and Unconditional Pardon\" covers \"those offenses against the United States which he has committed or may have committed or taken part in during the period from January 1, 2014 through December 1, 2024 … \"\nBiden has earned blowback, including from some members of his own party.\n'IT'S A SETBACK': DEMOCRATS CRITICIZE BIDEN OVER HUNTER PARDON\nHunter Biden, son of President Joe Biden, watches as President Joe Biden gestures to his ‘Team USA’ jacket on the South Lawn of the White House before boarding Marine One in Washington, D.C. on Friday, July 26, 2024(Bonnie Cash/UPI/Bloomberg via Getty Images)\nSen. Michael Bennet, D-Colo., asserted in a post on X that the president's move \"put personal interest ahead of duty and further erodes Americans’ faith that the justice system is fair and equal for all.\"\nColorado Gov. Jared Polissaid that the pardon would sully the president's reputation.\nDEM REP. DEAN PHILLIPS BLASTS BIDEN AFTER HUNTER PARDON, SAYS SOME PEOPLE ‘ARE INDEED ABOVE THE LAW’\nJared Polis, governor of Colorado, speaks to members of the media in the spin room following the first vice presidential debate at the CBS Broadcast Center in New York, on Tuesday, Oct. 1, 2024(Al Drago/Bloomberg via Getty Images)\nCLICK HERE TO GET THE FOX NEWS APP\n\"While as a father I certainly understand President @JoeBiden's natural desire to help his son by pardoning him, I am disappointed that he put his family ahead of the country. This is a bad precedent that could be abused by later Presidents and will sadly tarnish his reputation,\" the Democratic governor opined in a tweet.\nAlex Nitzberg is a writer for Fox News Digital."}, {"source": "foxnews", "title": "ACLU lawyer defends trans procedures for minors despite acknowledging 'it's not the kids who are consenting'", "link": "https://www.foxnews.com/media/aclu-lawyer-defends-trans-procedures-minors-despite-acknowledging-its-not-kids-who-consenting", "content": "ACLU lawyer and activist Chase Strangio defended children receiving gender transition treatments on CNN Tuesday before making oral arguments before the Supreme Court.\nA transgender ACLU attorney defended gender transition procedures for children Tuesday while appearing to acknowledge they're too young to consent.\nOn CNN, Chase Strangio discussed an upcoming case involving Tennessee’s ban on puberty blockers and transgender surgeries for minors that the trans man will arguein front of the Supreme Courtlater this week.\nHost Jake Tapper asked Strangio about people concerned that there isnot enough dataregarding the effects of minors receiving such procedures. Strangio insisted there was enough information to prove they helped kids and even some children under 10 need this \"relief\" from suffering.\nACLU lawyer Chase Strangio appeared on CNN's \"The Lead with Jake Tapper\" Tuesday.(CNN screenshot)\n\"These are not doctors being forced to provide this medication,\" Strangio said. \"These are doctors who are wanting to treat their patients in the best way that they know how, based on the best available evidence to us. And these are young people who may have known since they were two years old exactly who they are, who suffered for six or seven years before they had any relief.\"\nKIDS' GENDER CLINIC WHISTLEBLOWER TELLS DR. PHIL REGRETFUL PATIENTS BEGGED TO 'HAVE BODY PARTS PUT BACK ON'\nMinors cannot legally consent to medical procedures and Strangio acknowledged this protection while trying to appeal to parental rights.\n\"What‘s happening here is not the kids who are consenting to this treatment. It‘s the parents who are consenting to the treatment,\" the attorney continued. \"And as a parent, I would say, when our children are suffering, we are suffering. And these are parents who love their children, who are listening to the advice of their doctors of the mainstream medical community and doing what‘s right for their kids, and the state of Tennessee has displaced their judgment.\"\nStrangio will argue against Tennessee's ban on transgender procedures for minors in front of the Supreme Court this week.(Photo by: Michael Siluk/UCG/Universal Images Group via Getty Images)\nThe upcoming case, U.S. v. Skrmetti, will be the first time the Supreme Court will consider restrictions on puberty blockers, hormone therapy and surgery for minors.\nStrangio claimed that if the Supreme Court sides with Tennessee, it could open the door for bans on transgender treatments for adults.\n\"I think that‘s one of the things we should be really concerned about. We‘re hearing a lot about young people can‘t consent to this care, but it is their parents consenting to this care,\" Strangio said.\n\"And at the end of the day, we have adults who live as transgender people, people like myself, who have families who are part of communities, who are part of this society. And if the incoming administration bans our health care, that is essentially excising us from this country.\"\nCLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE\nU.S. vs. Skrmetti will be the first Supreme Court case to address restrictions on transgender procedures for minors.(Photo by Artur Widak/NurPhoto via Getty Images)\nTennessee is currently one of more than 20 states that have enacted some form ofrestrictions on gender transition proceduresfor minors.\nCLICK HERE TO GET THE FOX NEWS APP\nLindsay Kornick is an associate editor for Fox News Digital. Story tips can be sent to lindsay.kornick@fox.com and on Twitter: @lmkornick."}, {"source": "foxnews", "title": "Elon and Vivek should tackle US funding for this boondoogle organization and score a multimillion dollar win", "link": "https://www.foxnews.com/opinion/elon-vivek-should-tackle-us-funding-boondoogle-organization-score-multimillion-dollar-win", "content": "Fox News senior White House correspondent Peter Doocy has more on how the new Department of Government Efficiency aims to cut as much as $2 trillion in government spending on 'America Reports.'\nIn the search to eliminate waste and unaccountable spending, a $20 billion annual savings plan is immediately available to incomingPresident Trump’s Department of Government Efficiency (DOGE): American taxpayer dollars flowing to the United Nations.\nEach year the U.S.provides nearly a quarterof the U.N.’s total expenses, including assessed or mandatory \"regular\" funding of more than $3 billion and voluntary contributions that have vacillated between $10 and $15 billion in each of the past two years. Taking into account in-kind support services, the total is likely even higher. U.N. demands and U.S. subsidies have ballooned, with U.S. payouts almost doubling over the last decade.\nAlarm bells ought to ring out for Americans both because of how the money gets spent and where it is going.\nTRUMP ADMINISTRATION COULD LEAD TO BUDGET CUTS, LEADERSHIP SHAKEUP AT UN\nHere are a few of the rabbit holes where your money ends up. U.S. taxpayers pay for U.N. tax-free salaries; for U.N. lounges set up for watching sports games with bargain prices for food and drink; for media campaigns and other festivities to celebrate the \"International Day of Neutrality\" invented by Russia, Afghanistan and friends, and the \"International Day of Banks.\"\nU.S. dollars for peacekeepers include the blue helmets in southern Lebanon (UNIFIL) who have kept busy observing Hezbollah rearm, build terror tunnels, take up positions among Lebanese civilians, and fire at Israelis.\nThe surging expenses of the Office of theU.N. High Commissioner for Human Rights– from your wallets – have included staffing and support for a Chinese \"Independent Expert\" on \"international financial obligations of states on the full enjoyment of all human rights,\" an \"expert\" on \"a democratic and equitable international order\" who advocated that the International Criminal Court tackle American crimes against humanity, and an \"expert\" on \"International Solidarity\" created at the behest of Cuba.\nFORMER HIGH-LEVEL UNITED NATIONS OFFICIALS TO LAUNCH 'DOGE-UN' TO HIGHLIGHT AGENCY INEFFICIENCIES\nCongress has long been skeptical about U.N. uses of American money, so much so that they have insisted upon an annual report on \"United States Participation in the United Nations.\" The most recent report during the Biden administration was published in March 2024 and covered the year 2022. Here is its astonishing conclusion:\n\"It is increasingly challenging for the United States to identify cost savings at the U.N. given the growing demands that U.N. member states place on the organization.\"\nThe United Nations Headquarters building in New York Cityc.(Jakub Porzycki/NurPhoto via Getty Images)\nDOGE can respond to this apparent brain-freeze with the proper course of deserved financial oversight. The U.N. budget, which covers everything from well over 100,000 long-term employees, administrative costs, peacekeeping, and a broad range of agencies and subsidiary bodies, deliberately lacks the transparency necessary to end misuse and corruption.\nThe General Assembly, for instance, is nonplussed about breaking its own elementary rule that no new activity will be approved without the cost being calculated and presented before the vote.\nSign now and squeeze member states later is familiar practice, as is tapping unused resources in one corner to satisfy unfilled appetites in another.\nCLICK HERE FOR MORE FOX NEWS OPINION\nAt the heart of the U.N. financial structure lies the bad idea that the United States must pay for whatever abomination it votes against. Fans call it burden-sharing. We pay for what we don’t like, and other countries help pay for our priorities. The truth is that the end product doesn’t shake out on the plus side either for American national interests or taxpayer pocketbooks.\nA 2005 Task Force on the United Nations, initiated during the George W. Bush administration and headed byNewt Gingrichand George Mitchell, voiced concern about insufficient supervision and talked a lot about reform. As it turns out, the watchword of \"reform\" in U.N. circles has been a euphemism for \"keep on keeping on\" until somebody notices, again.\nCongress has also come up with other formulas for withholding money from the U.N., like refusing to fund a tiny list of U.N. projects dedicated to the destruction of the state of Israel. However, the U.N. has invented more such projects and Congress has taken years, if at all, to add to the withholding list and to confront the fundamental moral rot epitomized by the U.N.’s systemic demonization of Israel.\nDOGE creates an opportunity to clean house.\nThey can anticipate at least two rejectionist camps. Democrats who flog the erroneous idea that multilateralism begins and ends with the U.N. AndNew Yorkerswho figure they benefit from U.N. diplomats wining, dining, and hanging out in their neighborhood, whether or not they are hosting entourages of terrorists and criminal masterminds. Not only should the material and spiritual benefits of otherwise developing the prime real estate of midtown Manhattan be factored in for the sake of the locals, but the rest of the country also deserves a voice.\nCLICK HERE TO GET THE FOX NEWS APP\nA long overdue tally of American U.N. expenditures versus American needs is not a call to end American generosity or compassion beyond our borders. It is a call to protect the American goose laying the golden eggs from an avaricious and dangerous United Nations.\nTheBiden administrationthought that finding savings for U.S. money filling U.N. coffers was a challenge. To which DOGE can be all set to reply: challenge accepted.\nAnne Herzberg is legal adviser and U.N. representative of NGO monitor.\nAnne Bayefsky is president of Human Rights Voices and director, Touro Institute on Human Rights and the Holocaust. Follow her on X@AnneBayefsky."}, {"source": "foxnews", "title": "Al Sharpton's interview scandal becomes latest in decades-long history of controversies haunting MSNBC host", "link": "https://www.foxnews.com/media/al-sharptons-interview-scandal-becomes-latest-decades-long-history-controversies-haunting-msnbc-host", "content": "MSNBC host Rev. Al Sharpton asked Vice President Kamala Harris on how she believes she'll be seen in 50 years while reflecting on her 60th birthday Sunday.\nMSNBC host Rev. Al Sharpton is no stranger to controversy as revelations of what's been dubbed a \"pay to play\" scheme extends the long shadow of scandals that follow him.\nLast week, MSNBC admitted it was \"unaware\" that Vice PresidentKamala Harris’ presidential campaign paid $500,000 to Sharpton’s National Action Network nonprofit ahead of a friendly Oct. 20 interview with the Democratic nominee just weeks before the election.\nFollowing Harris’ defeat to President-elect Donald Trump,FEC filingsrevealed the Harris campaign gave two $250,000 donations to Sharpton’s nonprofit organization in September and October.  However, the MSNBC weekend host did not disclose to viewers the apparent conflict of interest before or after the interview. Neither did he disclose the donations to his bosses at the network, according to the Washington Free Beacon, which broke the story.\nSHARPTON'S ‘PAY TO PLAY’ SCANDAL ‘RICOCHETING AROUND THE HALLS’ OF MSNBC, INSIDER SAYS: ‘CAN’T BE ACCEPTABLE'\nMSNBC host Rev. Al Sharpton has a history of scandals and controversies far behind the latest \"pay for play\" allegations.(Brian Stukes/Getty Images; Kim Kulish/Corbis via Getty Images; Screenshot/MSNBC)\nSharpton's political stripes are no secret as an open supporter of Harris and the Democratic Party, even speaking at the Democratic National Convention in Chicago. But the six-figure transaction between his group and the Harris campaign is a \"bridge too far\" among his MSNBC colleagues, according to a network insider.\nWhile it's unclear whether Sharpton will face any consequences for the blatant conflict of interest, it marks the latest scandal to face the outspoken activist. These are some of the controversies he has been engulfed in over the decades.\nSharpton has built a reputation for playing fast and loose when it comes to his taxes. In 1993, he pleaded guilty for not filing his 1986 tax return in exchange for having two felony charges dropped.\nIn 2008, it was revealed that Sharpton owed nearly a staggering $1.5 million in back taxes.\nThe New York Timesoutlined some of his other financial troublesover the years. In 1990, he was acquitted of felony charges after he was accused of stealing a whopping $250,000 from a youth group. Three years later, he pleaded guilty to a misdemeanor charge after not filing a state income tax return. One of his for-profit businesses, Raw Talent, was also busted for not paying taxes for several years.\n\"Records reviewed by The New York Times show more than $4.5 million in current state and federal tax liens against him and his for-profit businesses,\" the Times reported in 2014.\nMSNBC WAS ‘UNAWARE’ HARRIS CAMPAIGN. GAVE $500K TO AL SHARPTON'S GROUP AHEAD OF FRIENDLY INTERVIEW\nDespite his prominent stint at MSNBC, perhaps Sharpton is best known for rallying behind the infamous rape hoaxer Tawana Brawley.\nBrawley, a 15-year-old Black girl, alleged in 1987 that she was kidnapped and raped by a group of White men after disappearing for four days from her New York home. She had been covered in feces and racial slurs written across her body.\nSharpton was among her closest advisers and was her most vocal defender, fueling racial tensions across the country in the process. A grand jury ultimately found her claims were false.\nSharpton himself was sued for defamation by one of individuals Brawley accused, who was awarded $65,000 in damages. Sharpton's supporters ended up footing the bill years later after he claimed he didn't have the money.\nRev. Al Sharpton was the biggest promoter of the Tawana Brawley rape hoax.(John Pedin/NY Daily News Archive via Getty Images)\nTo this day, Sharpton has no regrets for defending Brawley.\n\"I have no evidence that I was misled,\" Sharptonsaid in a January 2023 interview. \"My position was that there was this allegation from this young lady that was really questionable behavior by some that she accused.\"\nThe prominent activist has a disturbing record of antisemitism over the years.\nIn 1991, Sharpton defended New York City College Professor Leonard Jeffries, who sparked outrage with his speech targeting \"rich Jews\" he said financed the slave trade and controlled Hollywood, saying they \"put together a system of destruction for Black people.\" He responded to the controversy by saying \"\"If the Jews want to get it on, tell them to pin their yarmulkes back and come over to my house.\"\nKAMALA HARRIS INTERVIEWERS RECEIVED LARGE CAMPAIGN DONATIONS TO THEIR GROUPS AHEAD OF SIT-DOWNS\nThat same year, Sharpton fueled a deadly antisemitic mob in Crown Heights, Brooklyn after a Jewish man fatally stuck a 7-year-old Black boy with his car in a horrific accident.\nAt the boy's funeral, Sharpton said \"The world will tell us he was killed by accident. Yes, it was a social accident. It’s an accident to allow an apartheid ambulance service in the middle of Crown Heights… Talk about how Oppenheimer in South Africa sends diamonds straight to Tel Aviv and deals with the diamond merchants right here in Crown Heights.\" His use of \"diamond merchants\" was referencing Jewish jewelers. He also led protests that included chants like \"Kill the Jews!\" and \"No Justice, No Peace!\"\nThe riots led to the fatal stabbing of rabbinical scholar Yankel Rosenbaum by a Black teen.\nRev. Al Sharpton ignited racial tensions in Crown Heights targeting the Jewish community after a Black child was fatally struck by a Jewish motorist.(Daily News Archive via Getty Images)\nCLICK HERE FOR THE LATEST MEDIA AND CULTURE NEWS\nThe incident was investigated and no charges were brought. But after the Jewish man moved to Israel, Sharpton rushed to the Jewish State to hunt him down. According to the New York Daily News, a woman spotted Sharpton at the airport and told him to \"Go to hell\" to which he replied \"I am in hell already. I am in Israel.\"\nIn 1995, Sharpton referred to a Jewish store owner in Harlem as a \"White interloper\" after the store owner raised the rent of its Black subtenant after the store owner's own rent was raised by the building's owner, a Black Pentecostal church. Sharpton and his National Action Network organized weeks-long protests that led to a shooting that killed seven people and the Jewish store owner's business burned to the ground.\nCLICK HERE TO GET THE FOX NEWS APP\nJoseph A. Wulfsohn is a media reporter for Fox News Digital. Story tips can be sent to joseph.wulfsohn@fox.com and on Twitter: @JosephWulfsohn."}, {"source": "foxnews", "title": "House GOP leaders endorse Trump-backed candidate Jimmy Patronis for Matt Gaetz's old seat", "link": "https://www.foxnews.com/politics/house-gop-leaders-endorse-trump-backed-candidate-jimmy-patronis-matt-gaetzs-old-seat", "content": "The Alaska Congressional delegation will join the House speaker at the celebration.\nHouse Republican leadershave endorsed Florida Chief Financial Officer and State Fire Marshal Jimmy Patronis for election in the Sunshine State's 1st Congressional District.\nHouse SpeakerMike Johnson, R-La., House Majority Leader Steve Scalise, R-La., and House Majority Whip Tom Emmer, R-Minn., are all backing the candidate.\nPatronis shared the endorsements on social media, thanking each of the House GOP figures.\nWITH TRUMP PLEDGING ENDORSEMENT, FLORIDA CFO WILL RUN FOR MATT GAETZ'S FORMER HOUSE SEAT\nU.S. Speaker of the House Mike Johnson (C), accompanied by U.S. House Majority Whip Rep. Tom Emmer (L), and U.S. House Majority Leader Rep. Steve Scalise (R) speaks during a news conference on Capitol Hill on Nov. 19, 2024 in Washington, D.C.(Andrew Harnik/Getty Images)\nLast month,President-elect Donald Trumpurged Patronis to run, pledging to endorse him.\n\"Should he decide to enter this Race, Jimmy Patronis has my Complete and Total Endorsement. RUN, JIMMY, RUN!\" Trump declared in a Truth Social post\nSpecial primary and general elections will be held next year to fill the seat vacated last month by Matt Gaetz, who resigned from Congress after Trump nominated him to serve as attorney general.\nFLORIDA CFO REQUESTS REPORT ON POTENTIAL FOR INVESTING SOME STATE RETIREMENT SYSTEM FUNDS INTO DIGITAL ASSETS\nFlorida CFO Jimmy Patronis delivers remarks before Gov. Ron DeSantis took to the stage.(Tiffany Tompkins/Bradenton Herald/Tribune News Service via Getty Images)\nGaetz, who had just been re-elected prior to leaving office, ultimately withdrew himself from consideration for the Cabinet-level post.\nBut Gaetz is not the only Trump nominee who has bowed out.\nFLORIDA SHERIFF CHAD CHRONISTER WITHDRAWS AS TRUMP'S NOMINEE TO LEAD DEA\nPresident-elect Donald Trump looks on during the UFC 309 event at Madison Square Garden on Nov. 16, 2024, in New York City(Chris Unger/Zuffa LLC)\nCLICK HERE TO GET THE FOX NEWS APP\nHillsborough County Sheriff Chad Chronister, who Trump recently nominated to serve as administrator of the Drug Enforcement Administration, withdrew himself from consideration for the job.\nAlex Nitzberg is a writer for Fox News Digital."}, {"source": "foxnews", "title": "Trump floats DeSantis as potential defense secretary replacement if Hegseth falters", "link": "https://www.foxnews.com/politics/trump-floats-desantis-potential-defense-secretary-replacement-hegseth-falters", "content": "Penelope Hegseth joins 'Fox & Friends' to defend her son's character and discuss his nomination by President-elect Trump to be defense secretary.\nPresident-elect Donald Trumpis considering nominating Republican Gov. Ron DeSantis of Florida as defense secretary to replace Pete Hegseth, Trump's embattled current pick to steer the Pentagon, multiple sources confirm to Fox News.\nDeSantis, a bitter Trump rival last year and early this year during the GOP presidential nomination battle, made peace with Trump after the primaries and helped raise funds for Trump during the general election.\nThepopular conservative governor, a Navy veteran who served in the Iraq war, was re-elected in a landslide in 2022 but is term-limited and cannot run for re-election in 2026.\nHEAD HERE FOR THE LATEST FOX NEWS REPORTING ON THE TRUMP TRANSITION\nFlorida Governor Ron DeSantis waves from the stage on Day 2 of the Republican National Convention, at the Fiserv Forum in Milwaukee, Wisconsin, on July 16, 2024.(REUTERS/Elizabeth Frantz)\nDeSantis is \"very much\" in contention to replace Hegseth, multiple sources told Fox News.\nOne source added that it was the president-elect himself who floated the governor's name, and that Trump and DeSantis discussed the idea as they met Tuesday while appearing together in Florida at a memorial service for fallen law enforcement officers in Palm Beach County.\nCLICK HERE FOR A FULL LIST OF WHOM TRUMP'S PICKED TO STEER HIS ADMINISTRATION\nThe reporting from Fox News and other organizations comes as Hegseth on Wednesday returns to Capitol Hill to continue meeting with Republican senators as he makes his case for confirmation asdefense secretary.\nPete Hegseth, President-elect Donald Trump's pick for secretary of defense, speaks with reporters following a meeting with senators on Capitol Hill, Thursday, Nov. 21, 2024, in Washington. (AP Photo/Rod Lamkey, Jr.)(AP Photo/Rod Lamkey, Jr.)\nHegseth, an Army National Guard officer who deployed to the wars in Afghanistan and Iraq and who previously was a Fox News host, is facing a series of drinking and sexual misconduct allegations.\nWHY BIDEN'S PARDON OF HIS SON IS A POLITICAL GIFT FOR TRUMP\nHegseth has denied allegations that he mistreated women.\n\"I spoke with the President-elect this morning. He said keep going, keep fighting,\" Hegseth told reporters as he arrived on Capitol Hill.\n\"Why would I back down? I have always been a fighter,\" he added.\nBut a top Trump ally in the Senate is concerned.\n\"He obviously has a chance to defend himself here. But some of this stuff is – it’s going to be difficult,\" Sen. Lindsey Graham, a longtime military veteran and South Carolina Republican, told reporters on Tuesday.\nHegseth's mother, Penelope Hegseth, appeared Wednesday on Fox and Friends to defend her son and \"set the record straight.\"\n\"I am here to tell the truth. To tell the truth to the American people and tell the truth to senators on the hill, especially female senators. I really hope that you will not listen to the media and you will listen to Pete,\" she added.\nPresident Donald J. Trump, a Secret Service member, his son Eric Trump, Florida Governor Ron DeSantis and his wife Casey DeSantis attend a memorial service for three fallen Palm Beach County Sheriff's deputies at the South Florida Fairgrounds, Tuesday December 03, 2024, in Palm Beach County.(Bill Ingram/Imagn)\nIf Trump moves ahead and nominates DeSantis and the governor is confirmed by the GOP-controlled Senate next year, it would lead to the ascension of Lt. Gov. Jeanette Nuñez. She would make history as Florida's first female governor - and the first of Cuban descent.\nCLICK HERE TO GET THE FOX NEWS APP\nThe Wall Street Journal was first to report the news that Trump is considering DeSantis for defense secretary.\nBret Baier currently serves as FOX News Channel's (FNC) anchor and executive editor ofSpecial Report with Bret Baier(weeknights at 6-7PM/ET), chief political anchor of the network and co-anchor of the network’s election coverage. Baier is also host of FOX News Audio's \"The Bret Baier Podcast\" which includesCommon GroundandThe All-Star Panel. He joined FNC in 1998 as the first reporter in the Atlanta bureau and is now based in Washington, D.C."}, {"source": "foxnews", "title": "Freshman Focus: Republican Rob Bresnahan, who ousted six-term House Democrat, reveals how he did it", "link": "https://www.foxnews.com/politics/freshman-focus-republican-rob-bresnahan-who-ousted-six-term-house-democrat-reveals-how-he-did", "content": "Rep.-elect Rob Bresnahan, a Republican who won election to the House of Representatives in Pennsylvania's 8th Congressional District, discusses the concerns his voters shared on the campaign trail with Fox News Digital.\nVoters inPennsylvania's 8th Congressional Districtgave six-term incumbent Rep. Matt Cartwright, D-Pa., the boot last month in favor of a young, energetic and successful businessman who says he's ready to defend their interests in the nation's capital.\nRepublican Rep.-elect Rob Bresnahan, 34, tells Fox News Digital in an interview that \"kitchen table issues\" helped him connect with northeastern Pennsylvanians and oust Cartwright, a progressive who had served in Congress for more than a decade.\n\"When we were knocking on doors and talking to people every single day over a period of 13 months, the first thing anyone had to say was, ‘I can’t afford my bills. I can't afford rent. I can't afford my mortgage. I can't afford school property taxes. I can't afford groceries,'\" Bresnahan said.\nRising prices for food and gas have made living costs unaffordable for Pennsylvanians, he explained. And as voters have watched illegal immigrants overrun the southern border and be provided free food, housing and benefits, while billions in foreign aid flows out from the U.S. to other countries, they felt that foreigners were being treated better than Americans by their government, said Bresnahan.\nPENNSYLVANIA DEMOCRAT REP. MATT CARTWRIGHT CONCEDES RACE TO GOP CHALLENGER\nDemocratic Pennsylvania Rep. Matt Cartwright and Republican Pennsylvania House candidate Rob Bresnahan.(Getty Images/Rob for PA)\n\"We're looking around at our neighbors saying, ‘hey, what about us here?’ And they couldn't help but feel that they have been put second for a long time.\"\nBresnahan was a success story before he won election to theHouse of Representatives. A fifth-generation native of Luzerne County, at just 19 years old he was entrusted to be CFO of his grandfather's construction company, which builds electrical infrastructure for municipalities and highways throughout Pennsylvania.\nHe spent his college years at the University of Scranton dashing back and forth between the office and class as he worked to help the business recover from the global financial crisis. His hard work paid off, the business grew and Bresnahan became CEO after graduating in 2013.\n\"I was still living at home with my parents and I was in and out of a dorm room and running a company with 58 employees even though I couldn’t legally drink a Coors Light yet,\" he told the Citizen's Voice in 2021. \"The combination was a heavy workload but it was a sacrifice that I would make again in a second.\"\nBut as the years passed, Bresnahan, like many Americans, felt the country was headed on the wrong track. The decisions coming from Washington, D.C., were bad for his business, his employees and the people they serve. And so, he decided to enter politics to make a difference.\n\"I felt that the country was not heading in the right trajectory with what is happening on our southern border. We had life essentially unaffordable for the average person. And I've always been a person to roll up my sleeves and throw myself into fire,\" Bresnahan said.\nPA DEM IN DISTRICT THAT VOTED FOR TRUMP SAYS HE'S A MODERATE, BUT VOTING RECORD TELLS ANOTHER STORY\nRob Bresnahan, Republican nominee for Pennsylvania's 8th Congressional District, takes the stage during a Trump campaign rally at Riverfront Sports on Oct. 9, 2024 in Scranton, Pennsylvania.(Getty Images)\nHis winning congressional campaign focused on securing the border, cutting taxes and trimming government spending, creating \"family-sustaining jobs\" in the Keystone State and supporting law enforcement. In April, Bresnahan received an endorsement from President-electDonald Trump.\n\"A successful Businessman, Rob has worked hard to Create Jobs and Grow the Economy, unlike his opponent, Matt Cartwright, who is completely beholden to Nancy Pelosi and the Radical Left,\" Trump posted on Truth Social.\nWith the campaign behind him, Bresnahan says he and the other members of the incoming Republican majority in Congress are ready to hit the ground running with a pro-growth agenda in January.\n\"Securing the border. That needs to be done day one, Jan. 3 at 12:01 p.m., the day after we are all sworn in,\" he told Fox News Digital. \"I think there's going to be a big playbook, but that is a tangible win right off the bat.\"\nSINGLE HOUSE RACE STANDS BETWEEN REPUBLICANS AND 1-SEAT MAJORITY\nA view of the U.S. Capitol in Washington, D.C., on Nov. 4, 2024, ahead of the 2024 presidential election.(Nicolas Economou/NurPhoto via Getty Images)\nOn inflation, Bresnahan says Congress and the Trump administration can tackle unaffordable prices by lowering energy costs. \"Talking about just Pennsylvania alone, 52% of homes are heated from natural gas. $45 billion a year are generated from the natural gas industry, and $76 billion in GDP comes out of the fracking and natural gas industry,\" he said, insisting that policymakers must stop \"vilifying natural resources.\"\nThe rising national debt, at $36 trillion, is another burden on the economy Bresnahan says Congress must address. \"We're spending more on debt servicing – just our national debt and the interest – than we are on our national defense budget.\"\nThe young lawmaker said there will be \"tough votes\" on discretionary spending when Congress convenes in January. But two of the largest contributors to the federal debt and deficit will remain untouched.\n\"Obviously, we can't cut Medicare. We can't cut Social Security. We have to preserve that for our current generation, and we have to find ways to preserve it for our generation and the next generation. But I don't believe that there's a one-size-fits-all policy on any circumstance, let alone the national debt and the expenditures of the federal government,\" Bresnahan said.\nHowever, he added that illegal immigrants should not benefit from programs that Americans have paid in to, including Social Security and Medicare.\nREPUBLICANS PROJECTED TO KEEP CONTROL OF HOUSE AS TRUMP PREPARES TO IMPLEMENT AGENDA\nSpeaker of the House Mike Johnson, R-La., is expected to keep his job after Republicans held on to their House majority.(Tom Williams/CQ-Roll Call, Inc via Getty Images)\nRepublicans are expected to extend the 2017 tax cuts that became law during Trump's first term in office. Bresnahan says he supports those tax cuts and insists that economic growth spurred by deregulation and investments in infrastructure and American jobs can make up for any potential revenue losses.\n\"We have to get people back to work,\" he said. \"We have to create economic climates that are conducive to the American people to incentivize them to go to work.\"\nPart of that is to support jobs that don't require a college degree, such as carpenters, plumbers or electricians. \"These are great, family-sustaining careers with annuities starting on day one, with health insurance for your family, and you're earning while you learn.\"\nTurning to foreign policy, Bresnahan said the United States must remain a global superpower and pursue \"peace through strength.\"\n\"But we have to be strong as the United States,\" he added. Asked about growing GOP opposition to foreign aid, including to Ukraine, Bresnahan emphasized that he supports efforts to push back against Russian aggression – but he wants to do so responsibly.\nYOUNGEST HOUSE REPUBLICAN-ELECT REVEALS HOW GOP WON BACK AMERICA'S YOUTH\n\"Putin is a war criminal and needs to be stopped,\" he said. \"I am all supportive of providing weapons, missiles, rockets – actually, there's a big manufacturing facility inside of my district. But where I do want accountability is the raw, hard dollars that have been sent. I want audits done on those to ensure they're going to the right causes.\"\nEchoing Trump's beliefs about putting America first, Bresnahan said there is a point where \"enough is enough\" and that Europe has to match U.S. contributions to foreign aid.\n\"Again, I'm looking at, you know, 25% of my bridges are structurally deficient. We have aging infrastructure levees that protect over $1 trillion of property here in the United States. You're talking about power distribution grids that haven't been re-invested in since the 1950s with 50 years of usable life. And, you know, we were without power for multiple days now, going on which could possibly be a week (Editor's note: A blizzard in Breshanan's district had postponed this interview). Europe didn't come and send over trucks to help us rebuild our grids.\"\n\"Ukraine obviously has a lot going on, but we need to take care of our own people. We have to take care of our own Americans. And I believe Donald Trump had that narrative and that's why he just won an election in a landslide, because it's about us,\" he added.\nBresnahan hopes to bring \"common sense\" solutions to the complex problems facing Americans. He has pledged to work with whomever has a good idea, Republican or Democrat, and has earned endorsements from both No Labels and the moderate Problem Solvers Caucus. Though he calls himself a \"fiscal conservative,\" he rejects political labels because \"I don't think confirmation bias is the right way to solve any issue.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"I believe most challenges can be overcome through healthy and solid debate,\" he added.\nAnd what about those issues that inflame passions on both sides? Before this interview, Rep. Nancy Mace, R-S.C., made national headlines after she put forward a resolution that would bar Rep. Sarah McBride, D-Del., a transgender lawmaker who is biologically male, from using the women's bathrooms in the capitol.\nBresnahan said that while he believes biological men should not play in women's sports or use their facilities, the flare up between Mace and McBride distracts from other important issues facing Americans – like crumbling infrastructure and expensive living costs.\n\"I don't want the 119th Congress to be hijacked by what bathrooms we should be using when we have been elected to provide real solutions for the real American people. And that's what I'm going down to Washington, D.C. to do.\"\nFox News Digital's Emma Colton contributed to this report.\nGet the latest updates from the 2024 campaign, exclusive interviews and more at our Fox News Digital election hub.\nChris Pandolfo is a breaking news reporter for Fox News Digital. Send tips to chris.pandolfo@fox.com and follow him on Twitter @ChrisCPandolfo."}, {"source": "foxnews", "title": "Jeffries wants Biden to dole out pardons for people aggressively prosecuted 'for nonviolent offenses'", "link": "https://www.foxnews.com/politics/jeffries-wants-biden-dole-out-pardons-people-aggressively-prosecuted-for-nonviolent-offenses", "content": "Fox News senior national correspondent Rich Edson has more on Democrats' reaction to President Biden's decision to pardon his son on 'Special Report.'\nOn the heels ofPresident Joe Biden'smove to issue a sweeping pardon for his son Hunter Biden, House Democratic Leader Hakeem Jeffries, D-N.Y., issued a statement suggesting the president should issue pardons for individuals who faced \"aggressive prosecutions for nonviolent offenses.\"\n\"Throughout his life, President Joe Biden has fought to improve the plight of hardworking Americans struggling to live paycheck to paycheck,\" Jeffries said in the statement. \"Many of these people have been aggressively prosecuted and harshly sentenced for nonviolent offenses, often without the benefit of adequate legal representation. Countless lives, families and communities have been adversely impacted, particularly in parts of Appalachia, Urban America and the Heartland.\n\"During his final weeks in office, President Biden should exercise the high level of compassion he has consistently demonstrated throughout his life, including toward his son, and pardon on a case-by-case basis the working-class Americans in the federal prison system whose lives have been ruined by unjustly aggressive prosecutions for nonviolent offenses,\" Jeffries continued.\n\"This moment calls for liberty and justice for all,\" he concluded.\nREPUBLICANS HAMMER BIDEN'S ‘NO ONE IS ABOVE THE LAW’ CLAIM FOLLOWING HUNTER PARDON: ‘AGED LIKE FINE MILK’\nRep. Hakeem Jeffries, D-N.Y., speaks during a Get Out the Vote rally for Lauren Gillen, Democratic Congressional candidate in New York, not pictured, at Kennedy Memorial Park in Hempstead, N.Y. on Thursday, Oct. 17, 2024; Right: President Joe Biden delivers remarks from the Rose Garden at the White House on Nov. 26, 2024, in Washington, D.C.(Left: Adam Gray/Bloomberg via Getty Images; Right: Kevin Dietsch/Getty Images)\nThe president's pardon ofHunter Bidencovers more than a decade.\nThe \"Full and Unconditional Pardon\" covers \"those offenses against the United States which he has committed or may have committed or taken part in during the period from January 1, 2014 through December 1, 2024 … \"\nBiden has earned blowback, including from some members of his own party.\n'IT'S A SETBACK': DEMOCRATS CRITICIZE BIDEN OVER HUNTER PARDON\nHunter Biden, son of President Joe Biden, watches as President Joe Biden gestures to his ‘Team USA’ jacket on the South Lawn of the White House before boarding Marine One in Washington, D.C. on Friday, July 26, 2024(Bonnie Cash/UPI/Bloomberg via Getty Images)\nSen. Michael Bennet, D-Colo., asserted in a post on X that the president's move \"put personal interest ahead of duty and further erodes Americans’ faith that the justice system is fair and equal for all.\"\nColorado Gov. Jared Polissaid that the pardon would sully the president's reputation.\nDEM REP. DEAN PHILLIPS BLASTS BIDEN AFTER HUNTER PARDON, SAYS SOME PEOPLE ‘ARE INDEED ABOVE THE LAW’\nJared Polis, governor of Colorado, speaks to members of the media in the spin room following the first vice presidential debate at the CBS Broadcast Center in New York, on Tuesday, Oct. 1, 2024(Al Drago/Bloomberg via Getty Images)\nCLICK HERE TO GET THE FOX NEWS APP\n\"While as a father I certainly understand President @JoeBiden's natural desire to help his son by pardoning him, I am disappointed that he put his family ahead of the country. This is a bad precedent that could be abused by later Presidents and will sadly tarnish his reputation,\" the Democratic governor opined in a tweet.\nAlex Nitzberg is a writer for Fox News Digital."}, {"source": "foxnews", "title": "Trump transition signs agreement for FBI background checks", "link": "https://www.foxnews.com/politics/trump-transition-signs-agreement-fbi-background-checks", "content": "Incoming Trump 'border czar' Tom Homan discusses New York City Mayor Eric Adams saying he wants illegal immigrants who are charged with crimes to be deported on 'Hannity.'\nPresident-elect Trump's transition team has signed on to an agreement for the FBI to vet the incoming administration's cabinet nominees, the transition team announced Tuesday.\nTrump's team saysit will \"submit names for background checks and security clearances,\" an agreement typically signed even before the election. The FBI historically vets each cabinet nominee and also handles security clearances, a process that could not begin until the agreement was made.\n\"This agreement with the Department of Justice will ensure President Trump and his team are ready on Day 1 to begin enacting the America First Agenda that an overwhelming majority of our nation supported on Election Day,\" incoming White House chief of staff Susie Wiles said in a statement.\nA number of Republicans in the Senate had been apprehensive about the transition team's initial unwillingness to face FBI background checks, and several praised the Tuesday agreement.\nWHO IS KASH PATEL? TRUMP'S PICK TO LEAD THE FBI HAS LONG HISTORY VOWING TO BUST UP 'DEEP STATE'\nPresident-elect Trump has agreed to allow his cabinet nominees to undergo vetting by the FBI.(Allison Robbert-Pool/Getty Images)\n\"I think that’s good –– it’ll save them some headache,\" said Sen. Kevin Cramer, R-N.D., according to Politico. \"And it’ll give the public and senators a little comfort, I think, so I’m glad to hear that.\"\nDOJ SETTLES WITH FORMER FBI OFFICIALS OVER RELEASE OF ANTI-TRUMP TEXTS\nTrump and his allies have been openly critical of the FBI both on the campaign trail and since the election.Kash Patel,Trump's nominee to lead the organization, has been a crusader against the \"deep state\" since Trump's first term and has echoed Republican claims that Democrats have \"weaponized\" the FBI.\nA side-by-side of Kash Patel and President-elect Donald Trump.(Getty Images)\nTRUMP'S SPEEDY CABINET PICKS SHOW HIS 'PRIORITY TO PUT AMERICA FIRST,' TRANSITION TEAM SAYS\n\"Kash did an incredible job during my First Term, where he served as Chief of Staff at the Department of Defense, Deputy Director of National Intelligence, and Senior Director for Counterterrorism at the National Security Council. Kash has also tried over 60 jury trials,\" Trump posted to Truth Social on Sunday.\n\"This FBI will end the growing crime epidemic in America, dismantle the migrant criminal gangs, and stop the evil scourge of human and drug trafficking across the Border. Kash will work under our great Attorney General, Pam Bondi, to bring back Fidelity, Bravery, and Integrity to the FBI,\" he added.\nFBI Director Christopher Wray is set to be replaced by Kash Patel, who worked in the Pentagon during Trump's first term.(Alex Wong/Getty Images)\nPatel’s name spread across news reports as he became known as the man behind the \"Nunes Memo,\" a four-page document from then-Rep. Devin Nunes, R-Calif., released in 2018 that revealed improper use ofsurveillance by the FBI and theJustice Department in the Russia investigation into Trump.\nCLICK HERE TO GET THE FOX NEWS APP\n\"If they had gotten it right in the first place, when Devin and I and so many others were actually putting out the truth, instead of serving as a disinformation machine for the left-wing agenda, there would be no reassessment,\" Patel told Fox News Digital of the memo last year. \"They could not have done their work in the deep state without their partners in the mainstream media, who are part of that deep state.\"\nFox News' Emma Colton contributed to this report.\nAnders Hagstrom is a reporter with Fox News Digital covering national politics and major breaking news events. Send tips to Anders.Hagstrom@Fox.com, or on Twitter: @Hagstrom_Anders."}, {"source": "foxnews", "title": "Democratic challenger Adam Gray flips California's 13th Congressional District in nation's final House race", "link": "https://www.foxnews.com/politics/democratic-challenger-adam-gray-flips-californias-13th-congressional-district-nations-final-house-race", "content": "Fox News senior congressional correspondent Chad Pergram reports on the importance of attendance in the 119th Congress on 'Special Report.'\nDemocrat Adam Gray has wonCalifornia's 13th Congressional Districtrace by a mere 187 votes, defeating incumbent Republican Rep. John Duarte, according to The Associated Press.\nCalifornia's 13th Congressional District was the last seat to be called, with the district being one of the most competitive races in the Golden State. Republicans maintained the majority with 220 U.S. House seats, and Democrats at 215.\nGray was the ninth Democrat to flip a House seat in the 2024 election, while the GOP flipped eight seats – slipping the Republican majority. Three Republican members – Elise Stefanik, Michael Waltz and Matt Gaetz – were picked for the incoming Trump administration, though Gaetz withdrew his name from consideration, and it may take several months to fill those seats.\nGray, a formerstate legislatorwho represented California's 21st Assembly District from 2012 to 2022, is considered a centrist Democrat who focused on key concerns for farmers in the Central Valley like water shortages. He also campaigned on renewable energy solutions.\nHOUSE DEM MOVES TO FORCE VOTE ON RELEASING GAETZ ETHICS REPORT\nRepublican Rep. John Duarte, left, and Democrat Adam Gray.(Fresno Bee file/Tribune News Service via Getty Images)\nIn astatement on X, Gray wrote that the long-awaited results were confirmation that residents were ready for \"independent and accountable leadership.\"\n\"I'm honored to become the Congressman-elect for California's 13th Congressional District. The final results confirm this district is ready for independent and accountable leadership that always puts the Valley's people ahead of partisan politics,\" he wrote. \"But the work has just begun.\"\nSINGLE HOUSE RACE STANDS BETWEEN REPUBLICANS AND 1-SEAT MAJORITY\n\"In Washington, I'll work everyday to deliver the resources that the Valley needs: clean water, better educational opportunities, stronger infrastructure, and more good-paying jobs,\" he wrote. \"And you can count on me to build bipartisan relationships to accomplish these goals.\"\nA view of the California state capitol building on National Urban League California Legislative Advocacy Day on March 13, 2024 in Sacramento, California.(Arturo Holmes/Getty Images for National Urban League)\nThe racehas been characterized as one of the tightest in the country. In 2022, Duarte narrowly defeated Gray by just 564 votes.\nCLICK HERE TO GET THE FOX NEWS APP\nDuarte, a businessman and farmer, focused on issues like inflation, crime and agricultural issues during his campaign.\nJamie Joseph is a writer who covers politics. She leads Fox News Digital coverage of the Senate."}, {"source": "foxnews", "title": "House GOP leaders endorse Trump-backed candidate Jimmy Patronis for Matt Gaetz's old seat", "link": "https://www.foxnews.com/politics/house-gop-leaders-endorse-trump-backed-candidate-jimmy-patronis-matt-gaetzs-old-seat", "content": "The Alaska Congressional delegation will join the House speaker at the celebration.\nHouse Republican leadershave endorsed Florida Chief Financial Officer and State Fire Marshal Jimmy Patronis for election in the Sunshine State's 1st Congressional District.\nHouse SpeakerMike Johnson, R-La., House Majority Leader Steve Scalise, R-La., and House Majority Whip Tom Emmer, R-Minn., are all backing the candidate.\nPatronis shared the endorsements on social media, thanking each of the House GOP figures.\nWITH TRUMP PLEDGING ENDORSEMENT, FLORIDA CFO WILL RUN FOR MATT GAETZ'S FORMER HOUSE SEAT\nU.S. Speaker of the House Mike Johnson (C), accompanied by U.S. House Majority Whip Rep. Tom Emmer (L), and U.S. House Majority Leader Rep. Steve Scalise (R) speaks during a news conference on Capitol Hill on Nov. 19, 2024 in Washington, D.C.(Andrew Harnik/Getty Images)\nLast month,President-elect Donald Trumpurged Patronis to run, pledging to endorse him.\n\"Should he decide to enter this Race, Jimmy Patronis has my Complete and Total Endorsement. RUN, JIMMY, RUN!\" Trump declared in a Truth Social post\nSpecial primary and general elections will be held next year to fill the seat vacated last month by Matt Gaetz, who resigned from Congress after Trump nominated him to serve as attorney general.\nFLORIDA CFO REQUESTS REPORT ON POTENTIAL FOR INVESTING SOME STATE RETIREMENT SYSTEM FUNDS INTO DIGITAL ASSETS\nFlorida CFO Jimmy Patronis delivers remarks before Gov. Ron DeSantis took to the stage.(Tiffany Tompkins/Bradenton Herald/Tribune News Service via Getty Images)\nGaetz, who had just been re-elected prior to leaving office, ultimately withdrew himself from consideration for the Cabinet-level post.\nBut Gaetz is not the only Trump nominee who has bowed out.\nFLORIDA SHERIFF CHAD CHRONISTER WITHDRAWS AS TRUMP'S NOMINEE TO LEAD DEA\nPresident-elect Donald Trump looks on during the UFC 309 event at Madison Square Garden on Nov. 16, 2024, in New York City(Chris Unger/Zuffa LLC)\nCLICK HERE TO GET THE FOX NEWS APP\nHillsborough County Sheriff Chad Chronister, who Trump recently nominated to serve as administrator of the Drug Enforcement Administration, withdrew himself from consideration for the job.\nAlex Nitzberg is a writer for Fox News Digital."}, {"source": "foxnews", "title": "Jeffries wants Biden to dole out pardons for people aggressively prosecuted 'for nonviolent offenses'", "link": "https://www.foxnews.com/politics/jeffries-wants-biden-dole-out-pardons-people-aggressively-prosecuted-for-nonviolent-offenses", "content": "Fox News senior national correspondent Rich Edson has more on Democrats' reaction to President Biden's decision to pardon his son on 'Special Report.'\nOn the heels ofPresident Joe Biden'smove to issue a sweeping pardon for his son Hunter Biden, House Democratic Leader Hakeem Jeffries, D-N.Y., issued a statement suggesting the president should issue pardons for individuals who faced \"aggressive prosecutions for nonviolent offenses.\"\n\"Throughout his life, President Joe Biden has fought to improve the plight of hardworking Americans struggling to live paycheck to paycheck,\" Jeffries said in the statement. \"Many of these people have been aggressively prosecuted and harshly sentenced for nonviolent offenses, often without the benefit of adequate legal representation. Countless lives, families and communities have been adversely impacted, particularly in parts of Appalachia, Urban America and the Heartland.\n\"During his final weeks in office, President Biden should exercise the high level of compassion he has consistently demonstrated throughout his life, including toward his son, and pardon on a case-by-case basis the working-class Americans in the federal prison system whose lives have been ruined by unjustly aggressive prosecutions for nonviolent offenses,\" Jeffries continued.\n\"This moment calls for liberty and justice for all,\" he concluded.\nREPUBLICANS HAMMER BIDEN'S ‘NO ONE IS ABOVE THE LAW’ CLAIM FOLLOWING HUNTER PARDON: ‘AGED LIKE FINE MILK’\nRep. Hakeem Jeffries, D-N.Y., speaks during a Get Out the Vote rally for Lauren Gillen, Democratic Congressional candidate in New York, not pictured, at Kennedy Memorial Park in Hempstead, N.Y. on Thursday, Oct. 17, 2024; Right: President Joe Biden delivers remarks from the Rose Garden at the White House on Nov. 26, 2024, in Washington, D.C.(Left: Adam Gray/Bloomberg via Getty Images; Right: Kevin Dietsch/Getty Images)\nThe president's pardon ofHunter Bidencovers more than a decade.\nThe \"Full and Unconditional Pardon\" covers \"those offenses against the United States which he has committed or may have committed or taken part in during the period from January 1, 2014 through December 1, 2024 … \"\nBiden has earned blowback, including from some members of his own party.\n'IT'S A SETBACK': DEMOCRATS CRITICIZE BIDEN OVER HUNTER PARDON\nHunter Biden, son of President Joe Biden, watches as President Joe Biden gestures to his ‘Team USA’ jacket on the South Lawn of the White House before boarding Marine One in Washington, D.C. on Friday, July 26, 2024(Bonnie Cash/UPI/Bloomberg via Getty Images)\nSen. Michael Bennet, D-Colo., asserted in a post on X that the president's move \"put personal interest ahead of duty and further erodes Americans’ faith that the justice system is fair and equal for all.\"\nColorado Gov. Jared Polissaid that the pardon would sully the president's reputation.\nDEM REP. DEAN PHILLIPS BLASTS BIDEN AFTER HUNTER PARDON, SAYS SOME PEOPLE ‘ARE INDEED ABOVE THE LAW’\nJared Polis, governor of Colorado, speaks to members of the media in the spin room following the first vice presidential debate at the CBS Broadcast Center in New York, on Tuesday, Oct. 1, 2024(Al Drago/Bloomberg via Getty Images)\nCLICK HERE TO GET THE FOX NEWS APP\n\"While as a father I certainly understand President @JoeBiden's natural desire to help his son by pardoning him, I am disappointed that he put his family ahead of the country. This is a bad precedent that could be abused by later Presidents and will sadly tarnish his reputation,\" the Democratic governor opined in a tweet.\nAlex Nitzberg is a writer for Fox News Digital."}, {"source": "foxnews", "title": "Elon and Vivek should tackle US funding for this boondoogle organization and score a multimillion dollar win", "link": "https://www.foxnews.com/opinion/elon-vivek-should-tackle-us-funding-boondoogle-organization-score-multimillion-dollar-win", "content": "Fox News senior White House correspondent Peter Doocy has more on how the new Department of Government Efficiency aims to cut as much as $2 trillion in government spending on 'America Reports.'\nIn the search to eliminate waste and unaccountable spending, a $20 billion annual savings plan is immediately available to incomingPresident Trump’s Department of Government Efficiency (DOGE): American taxpayer dollars flowing to the United Nations.\nEach year the U.S.provides nearly a quarterof the U.N.’s total expenses, including assessed or mandatory \"regular\" funding of more than $3 billion and voluntary contributions that have vacillated between $10 and $15 billion in each of the past two years. Taking into account in-kind support services, the total is likely even higher. U.N. demands and U.S. subsidies have ballooned, with U.S. payouts almost doubling over the last decade.\nAlarm bells ought to ring out for Americans both because of how the money gets spent and where it is going.\nTRUMP ADMINISTRATION COULD LEAD TO BUDGET CUTS, LEADERSHIP SHAKEUP AT UN\nHere are a few of the rabbit holes where your money ends up. U.S. taxpayers pay for U.N. tax-free salaries; for U.N. lounges set up for watching sports games with bargain prices for food and drink; for media campaigns and other festivities to celebrate the \"International Day of Neutrality\" invented by Russia, Afghanistan and friends, and the \"International Day of Banks.\"\nU.S. dollars for peacekeepers include the blue helmets in southern Lebanon (UNIFIL) who have kept busy observing Hezbollah rearm, build terror tunnels, take up positions among Lebanese civilians, and fire at Israelis.\nThe surging expenses of the Office of theU.N. High Commissioner for Human Rights– from your wallets – have included staffing and support for a Chinese \"Independent Expert\" on \"international financial obligations of states on the full enjoyment of all human rights,\" an \"expert\" on \"a democratic and equitable international order\" who advocated that the International Criminal Court tackle American crimes against humanity, and an \"expert\" on \"International Solidarity\" created at the behest of Cuba.\nFORMER HIGH-LEVEL UNITED NATIONS OFFICIALS TO LAUNCH 'DOGE-UN' TO HIGHLIGHT AGENCY INEFFICIENCIES\nCongress has long been skeptical about U.N. uses of American money, so much so that they have insisted upon an annual report on \"United States Participation in the United Nations.\" The most recent report during the Biden administration was published in March 2024 and covered the year 2022. Here is its astonishing conclusion:\n\"It is increasingly challenging for the United States to identify cost savings at the U.N. given the growing demands that U.N. member states place on the organization.\"\nThe United Nations Headquarters building in New York Cityc.(Jakub Porzycki/NurPhoto via Getty Images)\nDOGE can respond to this apparent brain-freeze with the proper course of deserved financial oversight. The U.N. budget, which covers everything from well over 100,000 long-term employees, administrative costs, peacekeeping, and a broad range of agencies and subsidiary bodies, deliberately lacks the transparency necessary to end misuse and corruption.\nThe General Assembly, for instance, is nonplussed about breaking its own elementary rule that no new activity will be approved without the cost being calculated and presented before the vote.\nSign now and squeeze member states later is familiar practice, as is tapping unused resources in one corner to satisfy unfilled appetites in another.\nCLICK HERE FOR MORE FOX NEWS OPINION\nAt the heart of the U.N. financial structure lies the bad idea that the United States must pay for whatever abomination it votes against. Fans call it burden-sharing. We pay for what we don’t like, and other countries help pay for our priorities. The truth is that the end product doesn’t shake out on the plus side either for American national interests or taxpayer pocketbooks.\nA 2005 Task Force on the United Nations, initiated during the George W. Bush administration and headed byNewt Gingrichand George Mitchell, voiced concern about insufficient supervision and talked a lot about reform. As it turns out, the watchword of \"reform\" in U.N. circles has been a euphemism for \"keep on keeping on\" until somebody notices, again.\nCongress has also come up with other formulas for withholding money from the U.N., like refusing to fund a tiny list of U.N. projects dedicated to the destruction of the state of Israel. However, the U.N. has invented more such projects and Congress has taken years, if at all, to add to the withholding list and to confront the fundamental moral rot epitomized by the U.N.’s systemic demonization of Israel.\nDOGE creates an opportunity to clean house.\nThey can anticipate at least two rejectionist camps. Democrats who flog the erroneous idea that multilateralism begins and ends with the U.N. AndNew Yorkerswho figure they benefit from U.N. diplomats wining, dining, and hanging out in their neighborhood, whether or not they are hosting entourages of terrorists and criminal masterminds. Not only should the material and spiritual benefits of otherwise developing the prime real estate of midtown Manhattan be factored in for the sake of the locals, but the rest of the country also deserves a voice.\nCLICK HERE TO GET THE FOX NEWS APP\nA long overdue tally of American U.N. expenditures versus American needs is not a call to end American generosity or compassion beyond our borders. It is a call to protect the American goose laying the golden eggs from an avaricious and dangerous United Nations.\nTheBiden administrationthought that finding savings for U.S. money filling U.N. coffers was a challenge. To which DOGE can be all set to reply: challenge accepted.\nAnne Herzberg is legal adviser and U.N. representative of NGO monitor.\nAnne Bayefsky is president of Human Rights Voices and director, Touro Institute on Human Rights and the Holocaust. Follow her on X@AnneBayefsky."}, {"source": "foxnews", "title": "Trump transition signs agreement for FBI background checks", "link": "https://www.foxnews.com/politics/trump-transition-signs-agreement-fbi-background-checks", "content": "Incoming Trump 'border czar' Tom Homan discusses New York City Mayor Eric Adams saying he wants illegal immigrants who are charged with crimes to be deported on 'Hannity.'\nPresident-elect Trump's transition team has signed on to an agreement for the FBI to vet the incoming administration's cabinet nominees, the transition team announced Tuesday.\nTrump's team saysit will \"submit names for background checks and security clearances,\" an agreement typically signed even before the election. The FBI historically vets each cabinet nominee and also handles security clearances, a process that could not begin until the agreement was made.\n\"This agreement with the Department of Justice will ensure President Trump and his team are ready on Day 1 to begin enacting the America First Agenda that an overwhelming majority of our nation supported on Election Day,\" incoming White House chief of staff Susie Wiles said in a statement.\nA number of Republicans in the Senate had been apprehensive about the transition team's initial unwillingness to face FBI background checks, and several praised the Tuesday agreement.\nWHO IS KASH PATEL? TRUMP'S PICK TO LEAD THE FBI HAS LONG HISTORY VOWING TO BUST UP 'DEEP STATE'\nPresident-elect Trump has agreed to allow his cabinet nominees to undergo vetting by the FBI.(Allison Robbert-Pool/Getty Images)\n\"I think that’s good –– it’ll save them some headache,\" said Sen. Kevin Cramer, R-N.D., according to Politico. \"And it’ll give the public and senators a little comfort, I think, so I’m glad to hear that.\"\nDOJ SETTLES WITH FORMER FBI OFFICIALS OVER RELEASE OF ANTI-TRUMP TEXTS\nTrump and his allies have been openly critical of the FBI both on the campaign trail and since the election.Kash Patel,Trump's nominee to lead the organization, has been a crusader against the \"deep state\" since Trump's first term and has echoed Republican claims that Democrats have \"weaponized\" the FBI.\nA side-by-side of Kash Patel and President-elect Donald Trump.(Getty Images)\nTRUMP'S SPEEDY CABINET PICKS SHOW HIS 'PRIORITY TO PUT AMERICA FIRST,' TRANSITION TEAM SAYS\n\"Kash did an incredible job during my First Term, where he served as Chief of Staff at the Department of Defense, Deputy Director of National Intelligence, and Senior Director for Counterterrorism at the National Security Council. Kash has also tried over 60 jury trials,\" Trump posted to Truth Social on Sunday.\n\"This FBI will end the growing crime epidemic in America, dismantle the migrant criminal gangs, and stop the evil scourge of human and drug trafficking across the Border. Kash will work under our great Attorney General, Pam Bondi, to bring back Fidelity, Bravery, and Integrity to the FBI,\" he added.\nFBI Director Christopher Wray is set to be replaced by Kash Patel, who worked in the Pentagon during Trump's first term.(Alex Wong/Getty Images)\nPatel’s name spread across news reports as he became known as the man behind the \"Nunes Memo,\" a four-page document from then-Rep. Devin Nunes, R-Calif., released in 2018 that revealed improper use ofsurveillance by the FBI and theJustice Department in the Russia investigation into Trump.\nCLICK HERE TO GET THE FOX NEWS APP\n\"If they had gotten it right in the first place, when Devin and I and so many others were actually putting out the truth, instead of serving as a disinformation machine for the left-wing agenda, there would be no reassessment,\" Patel told Fox News Digital of the memo last year. \"They could not have done their work in the deep state without their partners in the mainstream media, who are part of that deep state.\"\nFox News' Emma Colton contributed to this report.\nAnders Hagstrom is a reporter with Fox News Digital covering national politics and major breaking news events. Send tips to Anders.Hagstrom@Fox.com, or on Twitter: @Hagstrom_Anders."}, {"source": "foxnews", "title": "ACLU lawyer defends trans procedures for minors despite acknowledging 'it's not the kids who are consenting'", "link": "https://www.foxnews.com/media/aclu-lawyer-defends-trans-procedures-minors-despite-acknowledging-its-not-kids-who-consenting", "content": "ACLU lawyer and activist Chase Strangio defended children receiving gender transition treatments on CNN Tuesday before making oral arguments before the Supreme Court.\nA transgender ACLU attorney defended gender transition procedures for children Tuesday while appearing to acknowledge they're too young to consent.\nOn CNN, Chase Strangio discussed an upcoming case involving Tennessee’s ban on puberty blockers and transgender surgeries for minors that the trans man will arguein front of the Supreme Courtlater this week.\nHost Jake Tapper asked Strangio about people concerned that there isnot enough dataregarding the effects of minors receiving such procedures. Strangio insisted there was enough information to prove they helped kids and even some children under 10 need this \"relief\" from suffering.\nACLU lawyer Chase Strangio appeared on CNN's \"The Lead with Jake Tapper\" Tuesday.(CNN screenshot)\n\"These are not doctors being forced to provide this medication,\" Strangio said. \"These are doctors who are wanting to treat their patients in the best way that they know how, based on the best available evidence to us. And these are young people who may have known since they were two years old exactly who they are, who suffered for six or seven years before they had any relief.\"\nKIDS' GENDER CLINIC WHISTLEBLOWER TELLS DR. PHIL REGRETFUL PATIENTS BEGGED TO 'HAVE BODY PARTS PUT BACK ON'\nMinors cannot legally consent to medical procedures and Strangio acknowledged this protection while trying to appeal to parental rights.\n\"What‘s happening here is not the kids who are consenting to this treatment. It‘s the parents who are consenting to the treatment,\" the attorney continued. \"And as a parent, I would say, when our children are suffering, we are suffering. And these are parents who love their children, who are listening to the advice of their doctors of the mainstream medical community and doing what‘s right for their kids, and the state of Tennessee has displaced their judgment.\"\nStrangio will argue against Tennessee's ban on transgender procedures for minors in front of the Supreme Court this week.(Photo by: Michael Siluk/UCG/Universal Images Group via Getty Images)\nThe upcoming case, U.S. v. Skrmetti, will be the first time the Supreme Court will consider restrictions on puberty blockers, hormone therapy and surgery for minors.\nStrangio claimed that if the Supreme Court sides with Tennessee, it could open the door for bans on transgender treatments for adults.\n\"I think that‘s one of the things we should be really concerned about. We‘re hearing a lot about young people can‘t consent to this care, but it is their parents consenting to this care,\" Strangio said.\n\"And at the end of the day, we have adults who live as transgender people, people like myself, who have families who are part of communities, who are part of this society. And if the incoming administration bans our health care, that is essentially excising us from this country.\"\nCLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE\nU.S. vs. Skrmetti will be the first Supreme Court case to address restrictions on transgender procedures for minors.(Photo by Artur Widak/NurPhoto via Getty Images)\nTennessee is currently one of more than 20 states that have enacted some form ofrestrictions on gender transition proceduresfor minors.\nCLICK HERE TO GET THE FOX NEWS APP\nLindsay Kornick is an associate editor for Fox News Digital. Story tips can be sent to lindsay.kornick@fox.com and on Twitter: @lmkornick."}, {"source": "foxnews", "title": "Al Sharpton's interview scandal becomes latest in decades-long history of controversies haunting MSNBC host", "link": "https://www.foxnews.com/media/al-sharptons-interview-scandal-becomes-latest-decades-long-history-controversies-haunting-msnbc-host", "content": "MSNBC host Rev. Al Sharpton asked Vice President Kamala Harris on how she believes she'll be seen in 50 years while reflecting on her 60th birthday Sunday.\nMSNBC host Rev. Al Sharpton is no stranger to controversy as revelations of what's been dubbed a \"pay to play\" scheme extends the long shadow of scandals that follow him.\nLast week, MSNBC admitted it was \"unaware\" that Vice PresidentKamala Harris’ presidential campaign paid $500,000 to Sharpton’s National Action Network nonprofit ahead of a friendly Oct. 20 interview with the Democratic nominee just weeks before the election.\nFollowing Harris’ defeat to President-elect Donald Trump,FEC filingsrevealed the Harris campaign gave two $250,000 donations to Sharpton’s nonprofit organization in September and October.  However, the MSNBC weekend host did not disclose to viewers the apparent conflict of interest before or after the interview. Neither did he disclose the donations to his bosses at the network, according to the Washington Free Beacon, which broke the story.\nSHARPTON'S ‘PAY TO PLAY’ SCANDAL ‘RICOCHETING AROUND THE HALLS’ OF MSNBC, INSIDER SAYS: ‘CAN’T BE ACCEPTABLE'\nMSNBC host Rev. Al Sharpton has a history of scandals and controversies far behind the latest \"pay for play\" allegations.(Brian Stukes/Getty Images; Kim Kulish/Corbis via Getty Images; Screenshot/MSNBC)\nSharpton's political stripes are no secret as an open supporter of Harris and the Democratic Party, even speaking at the Democratic National Convention in Chicago. But the six-figure transaction between his group and the Harris campaign is a \"bridge too far\" among his MSNBC colleagues, according to a network insider.\nWhile it's unclear whether Sharpton will face any consequences for the blatant conflict of interest, it marks the latest scandal to face the outspoken activist. These are some of the controversies he has been engulfed in over the decades.\nSharpton has built a reputation for playing fast and loose when it comes to his taxes. In 1993, he pleaded guilty for not filing his 1986 tax return in exchange for having two felony charges dropped.\nIn 2008, it was revealed that Sharpton owed nearly a staggering $1.5 million in back taxes.\nThe New York Timesoutlined some of his other financial troublesover the years. In 1990, he was acquitted of felony charges after he was accused of stealing a whopping $250,000 from a youth group. Three years later, he pleaded guilty to a misdemeanor charge after not filing a state income tax return. One of his for-profit businesses, Raw Talent, was also busted for not paying taxes for several years.\n\"Records reviewed by The New York Times show more than $4.5 million in current state and federal tax liens against him and his for-profit businesses,\" the Times reported in 2014.\nMSNBC WAS ‘UNAWARE’ HARRIS CAMPAIGN. GAVE $500K TO AL SHARPTON'S GROUP AHEAD OF FRIENDLY INTERVIEW\nDespite his prominent stint at MSNBC, perhaps Sharpton is best known for rallying behind the infamous rape hoaxer Tawana Brawley.\nBrawley, a 15-year-old Black girl, alleged in 1987 that she was kidnapped and raped by a group of White men after disappearing for four days from her New York home. She had been covered in feces and racial slurs written across her body.\nSharpton was among her closest advisers and was her most vocal defender, fueling racial tensions across the country in the process. A grand jury ultimately found her claims were false.\nSharpton himself was sued for defamation by one of individuals Brawley accused, who was awarded $65,000 in damages. Sharpton's supporters ended up footing the bill years later after he claimed he didn't have the money.\nRev. Al Sharpton was the biggest promoter of the Tawana Brawley rape hoax.(John Pedin/NY Daily News Archive via Getty Images)\nTo this day, Sharpton has no regrets for defending Brawley.\n\"I have no evidence that I was misled,\" Sharptonsaid in a January 2023 interview. \"My position was that there was this allegation from this young lady that was really questionable behavior by some that she accused.\"\nThe prominent activist has a disturbing record of antisemitism over the years.\nIn 1991, Sharpton defended New York City College Professor Leonard Jeffries, who sparked outrage with his speech targeting \"rich Jews\" he said financed the slave trade and controlled Hollywood, saying they \"put together a system of destruction for Black people.\" He responded to the controversy by saying \"\"If the Jews want to get it on, tell them to pin their yarmulkes back and come over to my house.\"\nKAMALA HARRIS INTERVIEWERS RECEIVED LARGE CAMPAIGN DONATIONS TO THEIR GROUPS AHEAD OF SIT-DOWNS\nThat same year, Sharpton fueled a deadly antisemitic mob in Crown Heights, Brooklyn after a Jewish man fatally stuck a 7-year-old Black boy with his car in a horrific accident.\nAt the boy's funeral, Sharpton said \"The world will tell us he was killed by accident. Yes, it was a social accident. It’s an accident to allow an apartheid ambulance service in the middle of Crown Heights… Talk about how Oppenheimer in South Africa sends diamonds straight to Tel Aviv and deals with the diamond merchants right here in Crown Heights.\" His use of \"diamond merchants\" was referencing Jewish jewelers. He also led protests that included chants like \"Kill the Jews!\" and \"No Justice, No Peace!\"\nThe riots led to the fatal stabbing of rabbinical scholar Yankel Rosenbaum by a Black teen.\nRev. Al Sharpton ignited racial tensions in Crown Heights targeting the Jewish community after a Black child was fatally struck by a Jewish motorist.(Daily News Archive via Getty Images)\nCLICK HERE FOR THE LATEST MEDIA AND CULTURE NEWS\nThe incident was investigated and no charges were brought. But after the Jewish man moved to Israel, Sharpton rushed to the Jewish State to hunt him down. According to the New York Daily News, a woman spotted Sharpton at the airport and told him to \"Go to hell\" to which he replied \"I am in hell already. I am in Israel.\"\nIn 1995, Sharpton referred to a Jewish store owner in Harlem as a \"White interloper\" after the store owner raised the rent of its Black subtenant after the store owner's own rent was raised by the building's owner, a Black Pentecostal church. Sharpton and his National Action Network organized weeks-long protests that led to a shooting that killed seven people and the Jewish store owner's business burned to the ground.\nCLICK HERE TO GET THE FOX NEWS APP\nJoseph A. Wulfsohn is a media reporter for Fox News Digital. Story tips can be sent to joseph.wulfsohn@fox.com and on Twitter: @JosephWulfsohn."}, {"source": "foxnews", "title": "5 wild ways Democrats have embraced the Monty Python strategy of politics", "link": "https://www.foxnews.com/opinion/5-wild-ways-democrats-have-embraced-monty-python-strategy-politics", "content": "Dr. Drew Pinsky analyzes the left’s reaction to President-elect Trump’s victory and how to handle people experiencing ‘extreme delusion’ on ‘Hannity.’\nPresident-electTrump’s election victorywas a disaster for the left – their worst Electoral College result since Bush the Elder coattailed Ronald Reagan in 1988. But rather than accept it and try to move forward, leftists and the journalists who love them are choosing another option – running away.\nSome want to run away from things that make them uncomfortable – like social media or media they thought friendly only days before – while others want to send in the Mayflower moving vans. Either way, the new motto for the far left should be, \"Run away!\" in all of itsMonty Python glory.\nHere are the five worst examples of the left doing their own great escape:\nWhen confronted with danger, the characters in the 1975 comedy film \"Monty Python and the Holy Grail\" would cry, \"Run away!\" and then do just that. (Warner Bros./Hulton Archive/Getty Images)\nLeftists have been fleeing Twitter/X ever since Elon Musk first talked about buying it. Twitter quitters have run to Threads and Mastodon and nowthe latest, Bluesky. Some of the most memorable social media voices for liberal lunacy have flown the coop and gone to the new platform. Actress Alyssa Milano, actor Mark Hamill, author Stephen King and former CNN anchor Don Lemon all hit the bricks.\nJOE ROGAN ASKS TO TAKE RACHEL MADDOW'S JOB IF ELON MUSK BUYS MSNBC\nThey weren’t alone. Some prominent businesses like 3M and Balenciaga joined them, along with media outlets like the Guardian and the taxpayer-funded leftists at NPR. The Hollywood Reporter delivered the typical media assessment: \"‘Bluesky Has the Juice’: Celebrities Flee ‘Toxic’ X for Rival Social Media Site.\" (Yes, free speech is \"toxic,\" but a leftist bubble is juicy. No bias at all.)\nAnd, as soon as they got to their new home, they complained that it, too, was toxic. Bluesky’s overworked safety team posted this on Nov. 15, during the exodus: \"In the past 24 hours, we have received more than 42,000 reports (an all-time high for one day). We’re receiving about 3,000 reports/hour. To put that into context, in all of 2023, we received 360k reports.\"\nAs Tim Curry sang in \"Rocky Horror Picture Show,\" \"'Cause I've seen blue skies through the tears in my eyes.\" It looks like liberal tears are the reality wherever they go for the next four years.\nLeftists aren’t just running from social media, they are escaping from… MSNBC? The far-left network experienced a ratings collapse as its viewers did their best impression of two of three legendary wise monkeys – deciding to hear no evil and see no evil.\nLIBERALS RAGE AGAINST 'MORNING JOE' 'BETRAYAL' AFTER CO-HOSTS MEET WITH TRUMP: 'WE WILL NOT FORGIVE'\nThe Wrap reported that MSNBC viewership was \"seeing a 48% decline following the election.\" Then there’s the far-left freakout as thenetwork’s \"Morning Joe\" co-hostsJoe Scarborough and Mika Brzezinski met with The Donald. The New York Post reported that the duo delivered \"their lowest-rated program since 2021.\"\nAnd the mob came for them, as well. Washington Post media writer Erik Wempe wrote, \"Five reasons Democrats should turn off ‘Morning Joe.’\" The paper’sunhinged lefty columnist Jen Rubinposted on Bluesky, \"You can stop watching Morning Joe anytime.\" A Salon commentary declared, \"‘Morning Joe’ has got to go.\" And journalism professor Jeff Jarvis also posted on Bluesky, \"Hmmm. What else are liberals leaving?...\" above a screenshot of \"Morning Joe\" talking about the defections from Twitter.\nViewers aren’t the only ones fleeing MSNBC. Its owners are doing the same. Comcast, which owns MSNBC, CNBC and a bunch of other cable channels like USA, SYFY and E!, is spinning them off into a separate company. But since it won’t be part of the NBC Universal universe, the \"news\" channels could also lose their names. And who knows whether NBC staff will still appear or not.\nHost Rachel Maddow even agreed to take a pay cut from her massive salary, dropping from $30 million to $25 million a year to keep her failing network going. The network wanted to keep her, especially given the bad viewership numbers. One exec reportedly called her \"ratings Viagra.\"\nCLICK HERE FOR MORE FOX NEWS OPINION\nThe one man who might be running toward MSNBC could be the world's top billionaire – Elon Musk. When Donald Trump Jr. suggested on Twitter \"the funniest idea ever!!!\" for Musk to buy the network, Musk’s immediate response was the same he gave when first asked about buying Twitter: \"How much does it cost?\" Bosses say it's not for sale. But maybe Elon will give them an offer they can't refuse.\nEvery election, some celebrity leftist claims he or she will leave America if their side doesn’t win. This election, somebody followed through.Former talk show host Ellen Degeneresand her wife Portia de Rossi have decamped to Merry Ol’ England.\nOf course, that barely touches on the lengthy list of celebs who said they would leave on a jet plane. Those include actresses America Ferrera and Sharon Stone as well asentertainers Cher and Barbra Streisand.If they do go, don’t expect them to suffer. The Biden-Harris economy made it tough for ordinary Americans to buy food, much less move. Millionaire libs weren’t impacted much.\nCLICK HERE TO GET THE FOX NEWS APP\nFlorida-based Villa Vie Residences announced the true, getaway-from-Trump cruise package. \"[S]tarting at just under $40,000 per year\" you can cruise around the world and avoid Trump the Sequel entirely. That’s the \"4-Year Skip Forward\" package.\nTheir press release says: \"extraordinary Continual World Cruise invites travelers to discover more than 425 ports in over 140 countries across all seven continents as it circumnavigates the globe every three and a half years.\" For $160,000-plus, you can see the world and avoid Trump, but you’d better pray to Gaia that JD Vance doesn’t win in 2028. And be sure to pack a lifetime’s supply of seasickness pills, just in case.\nCLICK HERE TO READ MORE FROM DAN GAINOR\nDan Gainor is a freelance opinion editor for Fox News Digital."}, {"source": "foxnews", "title": "Before Biden pardoned Hunter, the media speculated Trump would pardon his children ahead of leaving office", "link": "https://www.foxnews.com/media/before-biden-pardoned-hunter-media-speculated-trump-would-pardon-his-children-ahead-leaving-office", "content": "Fox News host Laura Ingraham reacts to President Biden pardoning his son Hunter Biden after previously saying he wouldn't on 'The Ingraham Angle.'\nFour years before President Biden shocked the nation with the pardon of his son Hunter, thelegacy mediawildly theorized that President-elect Donald Trump would pardon his own children before he left office in January 2021.\nOn Dec. 1, 2020,The New York Timesran the headline \"Trump Has Discussed With Advisers Pardons for His 3 Eldest Children and Giuliani,\" alleging that the then-president was mulling \"pre-emptive pardons\" to Donald Trump Jr., Eric Trump, Ivanka Trump as well as his son-in-law Jared Kushner. The report even alleged that Trump was considering issuing pardons \"for crimes they have not yet committed — essentially a prospective get-out-of-jail-free card.\"\nUltimately, Trump never issued pardons for his adult children nor Giuliani but other news organizations followed the Times' lead.\n\"If you had to build a 2020 time capsule in advance, this is probably something that you would have invented to put into the 2020 time capsule,\" MSNBC star Rachel Maddow told viewers with a grin while holding up a copy of the Times report.\nMSNBC and CNN went wall to wall hyping the Times report.\nHUNTER BIDEN PARDON: MEDIA TAKES BLOW TO CREDIBILITY WITH BOTCHED COVERAGE OF BROKEN PROMISE\nThe media pushed the narrative that then-President Trump was considering issuing pardons for his children before leaving office in January 2021.(Leigh Vogel/Polaris/Bloomberg via Getty Images)\nCNN ran a similar report titled \"The legal threats and headaches fueling pardon appeals from Trump’s family and friends,\" noting \"Trump’s three eldest children have faced various legal entanglements\" over the years, citing Don Jr. and Kushner's involvement in the Trump Tower meeting with Russians who claimed to have had dirt on Hillary Clinton during the 2016 election, which was investigated by Special Counsel Robert Mueller. Neither Don Jr. nor Kushner were ever charged with any crimes by Mueller.\n\"In our politics lead now, a source tells CNN that President Trump, the outgoing president, is discussing preemptive pardons for people close to him. That could include his three eldest children, Don jr. Ivanka and Eric, his son in law, Jared Kushner and his personal attorney, rudy giuliani, none of whom, as of this afternoon, have been even charged with. much less convicted of any crime,\" CNN's Jake Tapper said on air.\n\"Is the president now considering pardons for members of the Trump family, including himself? ABC News' David Muir teased at the beginning of \"World News Tonight.\"\n\"Pardoning the presidents kids? Why President Trump and his top allies believe Ivanka, Jared, Don Jr, and Eric, could need what’s being called a preemptive pardon,\" Norah O'Donnell of \"CBS Evening News\" said to viewers.\nHUNTER BIDEN ‘LAPTOP FROM HELL’ SCANDAL TURNS 4: HOW MEDIA, INTELLIGENCE COMMUNITY MISLED AMERICANS\nNBC News ran the headline \"President Trump has discussed possibility of pardons for family members, sources say,\" telling readers \"One source said the conversations in recent days were within the context of a president who feels embattled, and not because Trump believes he or any of his family members had done anything illegal.\"\nThe Peacock network published a follow-up report asking \"Could Trump pardon family members if they haven't been charged with crimes?\" to which it answered \"undoubtedly yes.\"\nPresident Biden raised eyebrows with his sweeping pardon of his son Hunter after promising he wouldn't issue one.((AP Photo/Jose Luis Magana)\nWashington Post columnist Philip Bump posed a similar question and answer, \"How much protection can Trump offer his family with his pardon power? A lot.\"\n\"There’s not much risk to Trump in attempting to grant such a blanket pardon. He might issue a sweepingly broad pardon — say, giving Jared Kushner a pass on any federal crimes committed from the moment of his birth until the moment the pardon was issued — with the understanding that, should someone seek to prosecute Kushner, they would have to persuade a court to let them do so,\" Bump wrote. \"They might be able to do that, particularly if the pardon is as vague as the one just mentioned. But, from Trump’s perspective, what’s the harm in trying? Particularly since there’s no accountability mechanism in place to prevent Trump from doing so.\"\nHUNTER BIDEN SAYS HIS MISTAKES WERE ‘EXPLOITED’ FOR POLITICAL SPORT, SAYS HE WON'T TAKE PARDON FOR GRANTED\nNPR also delved into Trump's legal powers with the story titled \"Talk Of 'Preemptive' Pardons By Trump Raises Questions: What Can He Do?\" featuring an image of Don Jr. at the top.\nVanity Fair was far more presumptive, running the headline \"Of Course Trump Is Going To Pardon Jared, Ivanka, and Maybe Even Don Jr.\"\nThe liberal news blog Slate even speculated that Trump pardoning his children could \"make him a bigger criminal target,\" writing \"If Trump were to distribute such broadly worded pardons liberally among his circle, he would make them all subject to subpoena to testify about not only their own conduct, but his.\"\nVanity Fair said \"of course\" Trump would pardon his eldest children before he left office.(Chip Somodevilla/Getty Images)\nBiden sparked backlash from both sides of the aisle for hissweeping pardon of Hunterafter repeatedly saying he wouldn't.\nThe pardon he ordered Sunday night covers crimes his son \"has committed or may have committed\" from Jan. 1, 2014 to Dec. 1, 2024.\n\"Today, I signed a pardon for my son Hunter,\" Biden wrote in a statement. \"From the day I took office, I said I would not interfere with the Justice Department’s decision-making, and I kept my word even as I have watched my son being selectively, and unfairly, prosecuted.\"\nCLICK HERE TO GET THE FOX NEWS APP\nBiden also referenced his son's battle with addiction and blamed \"raw politics\" for the unraveling of Hunter's plea deal.\n\"There has been an effort to break Hunter – who has been five and a half years sober, even in the face of unrelenting attacks and selective prosecution,\" the 82-year-old father wrote. \"In trying to break Hunter, they’ve tried to break me – and there’s no reason to believe it will stop here. Enough is enough.\"\nFox News' Emma Colton and Andrea Margolis contributed to this report.\nJoseph A. Wulfsohn is a media reporter for Fox News Digital. Story tips can be sent to joseph.wulfsohn@fox.com and on Twitter: @JosephWulfsohn."}, {"source": "foxnews", "title": "Supreme Court to weigh state ban on transgender 'medical treatments' for minors", "link": "https://www.foxnews.com/politics/supreme-court-weigh-state-ban-transgender-medical-treatments-minors", "content": "Fox News senior congressional correspondent Chad Pergram reports on Congress’ Supreme Court tension on 'Fox News Sunday.'\nTheSupreme Court will heararguments Wednesday in a high-profile case involving the right of transgender minors to receive gender transition care, such as puberty blockers and hormone therapy, in one of the most closely watched, potentially impactful cases slated to come before the high court this year.\nThe case, United States v. Skrmetti,centers on a Tennessee lawthat bans gender-transition treatments for adolescents in the state. The law also takes aim at health care providers in Tennessee who continue to provide gender-transition treatments to transgender minors, opening them up to fines, lawsuits and other liability.\nThe petitioners in the case are the American Civil Liberties Union (ACLU), which sued to overturn the Tennessee law on behalf of parents of three transgender adolescents, and a Memphis-based doctor who treats transgender patients. The petitioners were also joined by the Biden administration earlier this year under a federal law that allows the administration to intervene in certain cases certified by the attorney general to be of \"general public importance.\"\nThe petitioners argue the law violates the Equal Protection Clause of the 14th Amendment. The state has responded by insisting the law does not discriminate based on gender, arguing it sets parameters on age- and use-based restrictions on certain drugs and is thereforenot a violation of the Constitution.\nBIDEN'S SWEEPING HUNTER PARDON AT ODDS WITH LONGTIME RHETORIC ON EXECUTIVE POWER: 'NO ONE IS ABOVE THE LAW'\nPro-transgender protesters rally for inclusion. Petitioners in U.S. v. Skrmetti will argue before the Supreme Court that transgender individuals have all the hallmarks of a \"quasi-suspect class\" under the Equal Protection Clause of the 14th Amendment.(Mark Kerrison/In Pictures via Getty Images)\nAccording to the U.S. Supreme Court website, the key question posed in the case is \"whether Tennessee Senate Bill 1 (SBl), which prohibits all medical treatments intended to allow 'a minor to identify with, or live as, a purported identity inconsistent with the minor's sex' or to treat 'purported discomfort or distress from a discordance between the minor's sex and asserted identity,' Tenn. Code Ann. § 68-33-103(a)(1), violates the Equal Protection Clause of the Fourteenth Amendment.\"\nWednesday's oral arguments mark the first time the Supreme Court will consider restrictions on puberty blockers, hormone therapy and surgery for minors, giving the case importance in Tennessee and in other states across the country.\nTennessee passedits law, Senate Bill 1, in March 2023. But it is just one of at least 25 U.S. states that has banned gender transition care for transgender adolescents, making the case — and Wednesday's oral arguments — one of the most high-profile cases to be heard this session.\nThe oral arguments have beenanticipated for months.The controversial case comes at a time in Washington when Republicans will regain control of the White House and both chambers of Congress next month, giving them heavy influence and, some fear, more control over the federal judiciary.\nHere's what you need to know ahead of Wednesday's oral arguments.\nWho's arguing the case?\nThe petitioners will be represented by U.S. Solicitor General Elizabeth Prelogar and Chase Strangio, an ACLU attorney who represented the original parties in the lawsuit.\nStrangio, the deputy director for transgender justice for the ACLU’s LGBTQ and HIV Project, will be the first openly transgender person to argue before the Supreme Court.\nThe respondents in the case, namely the state of Tennessee, will be represented in court by Tennessee Solicitor General J. Matthew Rice and the state attorney general, Jonathan Skrmetti.\nIn a court filing submitted ahead of Wednesday's oral arguments, Prelogar's office argued the Tennessee law has a deliberate focus on \"sex and gender conformity,\" asserting Senate Bill 1 \"declares that its very purpose is to ‘encourag[e] minors to appreciate their sex' and to ban treatments ‘that might encourage minors to become disdainful of their sex.'\"\n\"That,\" the federal government wrote, \"is sex discrimination.\"\nCounsel for the petitioners willargue that the Tennessee lawimposes \"differential treatment based on the sex an individual is assigned at birth,\" triggering a higher level of scrutiny under the Equal Protection Clause of the Constitution.\nHUNTER BIDEN GUN CASE TERMINATED AFTER PARDON, BUT FEDERAL JUDGE STOPS SHORT OF FULL DISMISSAL\nThey will also argue that upholding the ban will represent a \"dangerous and discriminatory affront\" to transgender minors not just in Tennessee, but across the country, a point that has been emphasized by Strangio.\nThe state argued in a court filing that the law \"contains no sex classification\" warranting the heightened scrutiny under the Equal Protection Clause. Rather, it said, it \"creates two groups: minors seeking drugs for gender transition and minors seeking drugs for other medical purposes.\"\nThe question of scrutiny\nThe Supreme Court has determined three different levels of scrutiny that help determine whether a law is permissible under the Equal Protection Clause of the Constitution: Strict scrutiny, heightened scrutiny and rational basis. The highest level, strict scrutiny, requires a law be passed to serve a compelling government interest and be narrowly tailored to minimize harm.\nThe second level of scrutiny, or \"heightened scrutiny,\" requires the governmental body to prove its actions further an \"important government interest\" by using means \"substantially related to that interest.\"\nThe lowest bar, rational basis, is the most deferential of the tests and requires the law only serve a legitimate interest with a \"rational connection\" to the means and goals of the statute.\nThe U.S. Supreme Court at sunset(Aaron Schwartz/SIPA USA)\nOverview of the arguments\nWednesday's oral arguments will center on whether banning gender transition care for minors violates protections under the Equal Protection Clause, either via gender discrimination or discrimination against their transgender status.\nThe petitioners in the case will argue that the Tennessee law discriminates against individuals and their right to receive the same medical treatments based on their sex. Under the law, the petitioners argued in their court filing, \"an adolescent assigned female at birth cannot receive puberty blockers or testosterone to live as a male, but an adolescent assigned male at birth can.\"\nTRUMP'S AG PICK HAS ‘HISTORY OF CONSENSUS BUILDING’\nSeparately, they will argue that discriminating against individuals based on their transgender status is also sufficient to trigger higher scrutiny under the Equal Protection Clause, noting that transgender individuals \"satisfy all of the hallmarks of a quasi-suspect class,\" including being subject to discrimination, representing a \"discrete and identifiable minority\" and other components outlined by the Supreme Court, thereby necessitating that heightened scrutiny be applied.\nThe respondents will argue that Senate Bill 1, places age- and use-based restrictions on certain drugs and, therefore, is not an example of unconstitutional discrimination.\nFurther, they will argue that the law easily passes even the test of heightened scrutiny. The state contends it has \"compelling interests\" to protect the health and safety of minors in the state and \"in protecting the integrity and ethics of the medical profession.\"\nThe U.S. Supreme Court(Anna Moneymaker/Getty Images)\nCase history\nU.S. District Judge Eli Richardson, a Trump appointee, granted a preliminary inunction for part of the Tennessee ban in June, siding with the petitioners' assertion that \"parents have a fundamental right to direct the medical care of their children, which naturally includes the right of parent[s] to request certain medical treatments on behalf of their children[.]\"\nHe said the ban on most types of gender care for transgender minors would likely not survive the heightened scrutiny test under the Equal Protection Clause, since the same treatments were not banned for their non-transgender peers.\nThe U.S. Court of Appeals for the 6th Circuit later overturned the district court's decision and reinstated the full ban, using the lowest test of rational basis. The petitioners appealed that decision to the Supreme Court, which agreed in June to review the case.\nThe petitioners have asked the Supreme Court to remand the case to the 6th Circuit Court to hear it again, this time using the test of heightened scrutiny.\nCLICK HERE TO GET THE FOX NEWS APP\nStrangio hasrepeatedly stressedthe wide-ranging impact the Supreme Court decision could have on \"countless transgender youth\" of current and future generations and has described the bans as a \"dangerous and discriminatory affront to the well-being of transgender youth across the country.\"\nNext steps\nThe Supreme Court is expected to rule on United States v. Skrmetti by July 2025. The Supreme Court typically issues summer decisions on cases argued during the October term.\nBreanne Deppisch is a politics reporter for Fox News Digital covering the 2024 election and other national news."}, {"source": "foxnews", "title": "Faith in DOJ plummets as Biden, pardoning Hunter, joins Trump in denouncing the department", "link": "https://www.foxnews.com/politics/faith-doj-plummets-biden-pardoning-hunter-joins-trump-denouncing-department", "content": "Senior political analyst Juan Williams joined 'MediaBuzz' to discuss why some Democrats are blaming the party's far-left 'woke' stance for Kamala Harris' presidential election loss.\nLet’s face it, trust in most of our government institutions has utterly collapsed.\nMany people don’t have faith in the FDA, the DOD, HUD, Homeland Security, the health agencies, and the list goes on. And they don’t trust the media to deliver basic facts about Washington without bias and blunders.\nThese sentiments have basically been growing for the last 60 years, since the lies about Vietnam merged with the lies about Watergate and forced Richard Nixon to resign.\nBIDEN, TRUMP BOTH RIP DOJ AFTER PRESIDENT PARDONS HUNTER\nBut the most sensitive federal agency, everyone would agree, is theJustice Department, including the FBI. Donald Trump has been attacking these agencies for years (along with the \"fake news\"), accusing them of politically persecuting him. He campaigned outside courthouses by telling reporters the prosecutors and judges were awful people who were out to get him solely because he was the leading candidate to win back the White House.\nJoe Biden, by breaking his promise not to pardon his son Hunter, did more than just lie. He ripped his own DOJ for \"selectively and unfairly prosecuting\" his son.\nI used to patrol the endless hallways of the J. Edgar Hoover building as the Justice Department beat reporter. On the criminal side, it is supposed to be independent, since Justice often winds up investigating the administration. Back in the day it was filled with fair-minded career prosecutors who pursued legitimate leads regardless of party.\nU.S. President Joe Biden and President-elect Donald Trump are pictured in front of the United States Department of Justice Headquarters.(Getty Images)\nIn sayingthat Hunter Bidenwas singled out for harsh treatment, the outgoing president is making the same argument as the incoming president, that the department is badly biased. Little wonder that so many people don’t trust DOJ.\nAll Biden had to do when repeatedly asked about a pardon or commutation was \"I’m not going to discuss hypotheticals.\" Then at least he wouldn’t have the lying part.\nThere is no question that Pam Bondi, despite some roughing up, will be the next attorney general, having precisely the experience (Florida AG, career prosecutor) that Matt Gaetz so blatantly lacked. She is not going to blow up the department.\nBut in picking Kash Patel torun the FBI– and ignoring that Chris Wray is not through with his 10-year term – Trump is sending a very different message. And this isn’t some dark secret. It’s in the nominee’s own words.\nTRUMP HIT FOR HIRING LOYALISTS LIKE PAM BONDI: DOESN’T EVERY PRESIDENT DO THAT?\nPatel has vowed to shut down the bureau’s Washington headquarters. He said last year on Steve Bannon’s podcast, which we played on \"Media Buzz\": \"We will go out and find the conspirators…not just in government, but in the media.… Whether it’s criminally or civilly, we’ll figure that out.\"\nIn his 2022 book \"Government Gangsters,\" Patel names 60 people as part of the deep state,  \"a cabal of unelected tyrants…the most dangerous threat to our democracy.\" The press has dubbed this an enemies list.\nIt includes the aforementioned Bill Barr (for blocking his appointment), NSC chairman John Bolton (an \"arrogant control freak\"), and Defense Secretary Mark Esper (who tried to fire him).\nHunter Biden, son of U.S. President Joe Biden departs the J. Caleb Boggs Federal Building on June 03, 2024 in Wilmington, Delaware.(Anna Moneymaker/Getty Images)\nAlso on the list, as recounted by the New Republic:\nJoe Biden.\nKamala Harris.\nHillary Clinton.\nMerrick Garland.\nSamantha Power, who now runs the Agency for International Development.\nFormer Obama officials James Clapper; John Brennan; Peter Strzok (who trashed Trump in texts with his FBI girlfriend, Lisa Page), Andrew McCabe (FBI deputy director), Eric Holder and Loretta Lynch.\nA striking number areDonald Trump’s own appointees: Pat Cippolone (his White House counsel). Gina Haspel (his CIA director). Mark Esper. Charles Kupperman (his deputy national security adviser).\nTRUMP DROPPED MATT GAETZ AFTER COMPLAINING ABOUT HIGH POLITICAL COST OF DEFENDING HIM\nCassidy Hutchinson (Mark Meadows’ top aide, who criticized Trump in her testimony before the House Jan. 6 committee).\nIt’s a pretty big list. And having worked for Trump hardly provides immunity.\nPatel would have his work cut out for him, though he’d have to get a career prosecutor to submit a wiretap request or search warrant to the courts.\nMeanwhile, manyDemocratic lawmakersare hitting their party’s president pretty hard for the Hunter pardon, in interviewswith the Times.\nColorado Congressman Jason Crow: He promised he would not do this. I think it will make it harder for us going forward when we talk about upholding democracy.\"\nWashington Congresswoman Marie Gluesenkamp Perez: \"The president made the wrong decision. No family should be above the law.\"\nThe U.S. Department of Justice seal is displayed following a news conference in Washington, D.C., U.S. on Thursday, Dec. 20, 2018.(Yuri Gripas/Bloomberg via Getty Images)\nColorado Sen. Michael Bennet said the Biden move \"put personal interest ahead of duty and further erodes Americans’ faith that the justice system is fair and equal for all.\" And his late dropout from the race was also \"putting his personal interest ahead of his responsibility to the country.\"\nVermont Sen. Peter Welch: \"President Biden’s pardon of his son Hunter is, as the action of a loving father, understandable — but as the action of our nation’s chief executive, unwise.\"\nMichigan Sen. Gary Peters: \"Wrong.\"\nPretty bracing stuff.\nSome progressives defended Biden, such as Texas Congresswoman Jasmine Crockett: \"Way to go Joe!\" She said a 34-count convicted felon is about to walk into the White House, perhaps missing the news that Jack Smith has dropped the charges.\nOn \"Morning Joe\" yesterday, Mika Brzezinski, while saying she wished Biden hadn’t promised no pardon, took on the coverage: \"You look at what has happened on the Trump side, especially if you even parallel pardons that Trump has done himself, it’s just always so — it seems so hysterically imbalanced!\"\nJoe Scarborough spoke of \"the frustration that many Democrats are having on the New York Times, The Washington Post, the Wall Street Journal, a lot of mainstream organizations blowing this up to the size that they believe is really out of proportion, given everything Donald Trump has done in the past and what he’s doing right now.\"\nCLICK HERE TO GET THE FOX NEWS APP\nStill, the two presidents have wound up in the same place in their view of the Justice Department as partisan and politicized.\nOne fascinating tidbit dug up by the Times: When Biden had Trump to the White House, according to three sources, and listened to his familiar grievances about the biased DOJ – the president-elect \"surprised his host by sympathizing with the Biden family’s own troubles with the department.\"\nHoward Kurtz is the host of FOX News Channel'sMediaBuzz(Sundays 11 a.m.-12 p.m. ET). Based in Washington, D.C., he joined the network in July 2013 and regularly appears onSpecial Report with Bret Baierand other programs."}, {"source": "foxnews", "title": "Federal judge accuses President Biden of attempting to 'rewrite history' in Hunter Biden pardon", "link": "https://www.foxnews.com/politics/federal-judge-accuses-president-biden-attempting-rewrite-history-hunter-biden-pardon", "content": "Fox News senior national correspondent Rich Edson has more on Democrats' reaction to President Biden's decision to pardon his son on 'Special Report.'\nThe federal judge overseeing Hunter Biden’s tax case issued a sharp rebuke ofPresident Biden'sclaim that his son was unfairly treated as well as the president's delivery method following the president's last-minute pardon.\nU.S. District Judge Mark Scarsi, who is based in the Central District of California and was nominated by President-elect Trump, accused President Biden in a scathing five-page order of \"rewriting history\" with the pardon and suggested that the breadth of the pardon granted to his son is unconstitutional.\n\"The Constitution provides the President with broad authority to grant reprieves and pardons for offenses against the United States, but nowhere does the Constitution give the President the authority to rewrite history,\" he wrote.\nBIDEN PARDONS SON HUNTER BIDEN AHEAD OF EXIT FROM OVAL OFFICE\nHunter Biden departs a House Oversight Committee meeting on Capitol Hill on January 10. On Friday, a judge denied a motion to throw out a federal gun case against him.(Kent Nishimura/Getty Images)\nThe judge voiced his displeasure that the president alerted the judicial system of his order to pardon his son via aWhite House press release.\n\"Rather than providing a true and correct copy of the pardon with the notice, Mr. Biden provided a hyperlink to a White House press release presenting a statement by the President regarding the pardon and the purported text of the pardon,\" he wrote.\n\"In short, a press release is not a pardon,\" he continued.\nREAD – APP USERSCLICK HERE:\nScarsi continued, reacting to the president's statement on hisson's tax case: \"the President asserts that Mr. Biden ‘was treated differently’ from others ‘who were late paying their taxes because of serious addictions,’ implying that Mr. Biden was among those individuals who untimely paid taxes due to addiction. But he is not.\"\n\"According to the President, ‘[n]o reasonable person who looks at the facts of [Mr. Biden’s] cases can reach any other conclusion than [Mr. Biden] was singled out only because he is [the President’s] son.’ But two federal judges expressly rejected Biden’s arguments that the Government prosecuted Mr. Biden because of his familial relation to the President. And the President’s own Attorney General and Department of Justice personnel oversaw the investigation leading to the charges,\" Scarsi wrote.\n2 TIMES BIDEN SAID HE WOULD NOT PARDON SON HUNTER BIDEN\n\"In the President’s estimation, this legion of federal civil servants, the undersigned included, are unreasonable people,\" he said.\nHunter Biden, son of U.S. President Joe Biden, departs the J. Caleb Boggs Federal Building on June 03, 2024 in Wilmington, Delaware. Biden is standing trial for felony gun charges.(Anna Moneymaker/Getty Images)\nThe judge said he would dispose of the case once he receives the official pardon from \"the appropriate executive agency.\"\nHe also vacated Hunter Biden’s sentencing, which was scheduled for Dec. 16.  The charges carried up to 17 years behind bars, but the first son would likely have faced a much shorter sentence under federal sentencing guidelines.\nTRUMP PREVIOUSLY PREDICTED BIDEN WOULD PARDON SON HUNTER\n\"Subject to the following discussion, the Court assumes the pardon is effective and will dispose of the case.The Supreme Courtlong has recognized that, notwithstanding its nearly unlimited nature, the pardon power extends only to past offenses,\" he wrote.\nFILE: President Joe Biden, wearing a Team USA jacket and walking with his son Hunter Biden, heads toward Marine One on the South Lawn of the White House in Washington, July 26, 2024.(AP Photo/Susan Walsh)\nHunter Biden, 54, has had a busy year in court, kicking off his first trial in Delaware in June, when he faced three felony firearm offenses, before he pleaded guilty in a separate felony tax case in September.\nPresident Biden pardoninghis son is a departure from his previous remarks to the media over the summer when he insisted he would not pardon the first son.\n\"Yes,\" President Biden told ABC News when asked if he would rule out pardoning Hunter ahead of his guilty verdict in the gun case.\nCLICK HERE TO GET THE FOX NEWS APP\nDays later, following a jury of Hunter’s peers finding him guilty of three felony firearm offenses, the president again said he would not pardon his son.\n\"I am not going to do anything,\" Biden said after Hunter was convicted. \"I will abide bythe jury’s decision.\"\nFox News Digital has reached out to the White House for comment.\nFox News Digital's Emma Colton and Andrea Margolis contributed to this report.\nSarah Rumpf-Whitten is a breaking news writer for Fox News Digital and Fox Business.\nStory tips and ideas can be sent to sarah.rumpf@fox.com and on X:@s_rumpfwhitten."}, {"source": "foxnews", "title": "Get to know Donald Trump's Cabinet: Who has the president-elect picked so far?", "link": "https://www.foxnews.com/politics/trumps-picks-so-far-heres-who-advising-new-president", "content": "Former Deputy Assistant Defense Secretary Elbridge Colby discusses what to expect in the Middle East under President-elect Trump on ‘The Story.’\nSince winning the election last week,President-elect Donald Trumphas begun evaluating and rolling out his picks for his Cabinet and other top roles.\nHere’s a roundup of whom Trump has picked to fill top jobs in his administration:\nWhite House Chief of Staff – Susie WilesU.S. Ambassador to the United Nations – Elise StefanikNational Security Adviser – Michael Waltz\"Border Czar\" – Tom HomanAmbassador to Israel – Mike HuckabeeEnvironmental Protection Agency Administrator – Lee ZeldinMiddle East Envoy – Steven WitkoffWhite House Counsel – William McGinleyCIA Director – John RatcliffeDepartment of Government Efficiency – Elon Musk, Vivek RamaswamySecretary of Defense – Pete HegsethHomeland Security Secretary – Kristi NoemDeputy Chief of Staff – Dan ScavinoDeputy Chief of Staff for Policy and Homeland Security Advisor – Stephen MillerDeputy Chief of Staff for Legislative, Political and Public Affairs – James BlairDeputy Chief of Staff for Communications and Personnel – Taylor BudowichDirector of National Intelligence – Tulsi GabbardSecretary of State – Marco RubioU.S. Attorney General – Pam BondiSecretary of Health and Human Services – Robert F. Kennedy Jr.U.S. Attorney for Southern District of New York – Jay ClaytonSecretary of Veterans Affairs – Doug CollinsU.S. Solicitor General – Dean John SauerDeputy Attorney General – Todd BlancheSecretary of the Interior – Doug BurgumCommunications Director – Steven CheungDirector of Presidential Personnel – Sergio GorPress Secretary – Karoline LeavittAssistant to the President and Staff Secretary – William Owen ScharfSecretary of Energy – Chris WrightChairman of the Federal Communications Commission – Brendan CarrSecretary of Transportation – Sean DuffySecretary of Commerce – Howard LutnickCenters for Medicare and Medicaid Services Administrator – Dr. Mehmet OzSecretary of Education – Linda McMahonAmbassador to NATO – Matthew WhitakerTreasury Secretary – Scott BessentOffice of Management and Budget – Russ VoughtSecretary of the Department of Housing and Urban Development – Scott TurnerLabor Secretary –Lori Chavez-DeRemerDirector of CDC – Dave WeldonFDA commissioner – Marty MakarySurgeon General – Janette NesheiwatDeputy Assistant to the President and Senior Director for Counterterrorism – Sebastian GorkaAssistant to the President and Principal Deputy National Security Advisor – Alex WongSecretary of Agriculture – Brooke RollinsDirector of the Office of Legislative Affairs – James BraidDirector of the Office of Political Affairs – Matt BrasseauxDirector of the Office of Public Liaison – Alex LatchamNational Institutes of Health Director – Dr. Jay BhattacharyaU.S. Trade Representative – Jamieson GreerSecretary of the Navy – John PhelanDeputy Secretary of Health and Human Services – Jim O'NeillDomestic Policy Council Director – Vince HaleyWhite House National Economic Council Director – Kevin HassettSpecial Envoy for Ukraine and Russia – Keith KelloggU.S. Ambassador to France - Charles KushnerFBI Director - Kash PatelU.S. Drug Enforcement Agency Administrator - Chad Chronister (Withdrawn)Senior Advisor on Arab and Middle Eastern Affairs – Massad BoulosU.S. Ambassador to U.K. – Warren A. Stephens\nWiles has been widely laudedfor heading Trump’s successful campaign this year, having run Trump’s campaign operations in Florida in 2016 and 2020. She maintained close ties with the president-elect throughout the Biden administration and signed on as CEO of Trump’s Save America PAC in 2021.\n\"Susie is tough, smart, innovative and is universally admired and respected. Susie will continue to work tirelessly to Make America Great Again. It is a well deserved honor to have Susie as the first-ever female Chief of Staff in United States history. I have no doubt that she will make our country proud,\" Trump said in a statement.\nTrump picked campaign manager Susie Wiles for his chief of staff.(AP Photo/Alex Brandon)\nTHESE ARE THE TOP NAMES IN CONTENTION FOR DEFENSE SECRETARY UNDER TRUMP\nElise Stefanik, the New York Republican representative and current House GOP Conference Chair has been an attack dog for Trump in Congress.\nShe is a staunch supporter of Israel, having made headlines for her combative lines of questioning of Ivy League university presidents over their handling of anti-Israel protests, some of which prompted the presidentsto resign.\nPresident-elect Trump picked Rep. Elise Stefanik, R-N.Y., to be the next ambassador to the United Nations.(Angela Weiss/AFP via Getty Images)\nOn Tuesday, Trump announced the Florida Republican representative and former Army Green Beret would be his national security adviser. He’s decidedly a hawkon Chinaand Iran.\n\"Mike retired as a Colonel, and is a nationally recognized leader in National Security, a bestselling author, and an expert on the threats posed by China, Russia, Iran, and global terrorism,\" Trump said in a statement.\n\"Mike has been a strong champion of my America First Foreign Policy agenda, and will be a tremendous champion of our pursuit of Peace through Strength!\"\nOn Tuesday, Trump announced Rep. Michael Waltz, a Florida Republican and former Army Green Beret, would be his national security adviser.(John Nacion/Getty Images)\nHoman, theformer acting director of U.S. Immigration and Customs Enforcement, was an architect of Trump's zero-tolerance policy during his first administration, one that led to backlash from family separations at the border.\nHoman has served under six administrations and presidents in both parties, dating back to the Reagan era, as a rank-and-file Border Patrol agent. He was appointed to the position of executive associate director of enforcement and removal operations for ICE under President Obama.\nWhile serving at a \"czar\" level rather than in an official Cabinet position, Homan will be in charge of \"the Southern Border,the Northern Border, all Maritime, and Aviation Security,\" Trump announced on Truth Social.\n\"I’ve known Tom for a long time, and there is nobody better at policing and controlling our Borders,\" Trump wrote. \"Likewise, Tom Homan will be in charge of all Deportation of Illegal Aliens back to their Country of Origin. Congratulations to Tom. I have no doubt he will do a fantastic, and long awaited for, job.\"\nTom Homan has been tapped by President-elect Trump to be his \"border czar.\"(Bill Clark/CQ-Roll Call, Inc via Getty Images)\nHuckabee, the former governor of Arkansas, is a staunch supporter of Israel, prompted by his evangelical faith.\n\"Mike has been a great public servant, Governor, and Leader in Faith for many years. He loves Israel, and the people of Israel, and likewise, the people of Israel love him\", a statement attached to Trump’s Truth Social post said. \"Mike will work tirelessly to bring about Peace in the Middle East!\"\nFormer Arkansas Gov. Mike Huckabee will be Trump's ambassador to Israel.(Chip Somodevilla/Getty Images)\nZeldin, a former House Republican from New York, had a notably strong, but unsuccessful, showing in the race for governor against Kathy Hochul in 2022.\nDuring that race, he called for New York to lift its ban on fracking.\nPrior to running for governor, Zeldin served as a U.S. Congressman for eight years. During that time, Zeldin served on the House Foreign Affairs and House Financial Services committees. He also championed infrastructure and research projects like the preservation of Plum Island and Army Corps of Engineers initiatives.\nLee Zeldin will lead the EPA.(Lev Radin/Pacific Press/LightRocket via Getty Images)\nWitkoff, a real estate investor, landlord, and the founder of the Witkoff Group, was tapped as Trump's Middle East enjoy. He campaign with Trump during the campaign.\nIn his announcement, Trump said that Witkoff would be an \"unrelenting Voice for PEACE\" in the highly-contentious region.\nSteve Witkoff, founder and chief executive officer of Witkoff Group LLC, speaks during a campaign event for Republican presidential nominee former President Trump at Madison Square Garden in New York City, Oct. 27.(Adam Gray/Bloomberg via Getty Images)\nMcGinley, whoserved in Trump's first presidential termas White House cabinet secretary, returns to the White House for Trump's second term. The White House Counsel conducts key behind-the-scene research into potential Supreme Court nominees.\nWilliam J. McGinley speaks at an event in Washington, D.C.(Tom Williams/Roll Call/Getty Images)\nRatcliffe previously served under Trumpduring his first term as Director of National Intelligence (DNI). He will head the Central Intelligence Agency (CIA).\nIn 2020, he was awarded the National Security Medal, the nation’s highest honor for distinguished achievement in the field of intelligence and national security.\nJohn Ratcliffe is President-elect Trump's pick to lead the CIA.(Getty Images)\nBillionaireElon Muskand former GOP presidential candidate Vivek Ramaswamy were tapped to lead the Department of Government Efficiency, or DOGE.\nTrump said that the pair will work together to \"dismantle Government Bureaucracy, slash excess regulations, cut wasteful expenditures, and restructure Federal Agencies.\"\n\"It will become, potentially, ‘The Manhattan Project’ of our time,\" the announcement on Tuesday evening said. \"Republican politicians have dreamed about the objectives of ‘DOGE’ for a very long time.\"\nVivek Ramaswamy and Elon Musk have been tapped by President-elect Donald Trump to lead the Department of Government Efficiency.(Getty Images/AP Images)\nTrump nominated Hegseth to lead the Department of Defense. He would need to be confirmed by the Senate to assume the position. Hegseth has long championed a strong military and veterans causes.\nHe served in Iraq and Afghanistan as an Army infantry officer, being awarded two Bronze Stars and the Combat Infantryman's Badge. Hegseth was a host on \"FOX & Friends Weekend\" and FOX Nation until his last day on Tuesday.\n\"Nobody fights harder for the Troops, and Pete will be a courageous and patriotic champion of our ‘Peace through Strength’ policy,\" Trump said.\nPete Hegseth has been tapped by Trump to be his secretary of defense.(Roy Rochlin/Getty Images)\nTrump announced on Tuesday that South Dakota GovernorKristi Noemis his pick for secretary of the Department of Homeland Security. Noem would need to be approved by the Senate to assume the position.\nDHS oversees U.S. Customs and Border Protection, Immigration and Customs Enforcement, the U.S. Secret Service and the Federal Emergency Management Agency.\n\"She was the first Governor to send National Guard Soldiers to help Texas fight the Biden Border Crisis, and they were sent a total of eight times,\" the Trump transition team said in a statement on Tuesday. \"She will work closely with ‘Border Czar’ Tom Homan to secure the Border, and will guarantee that our American Homeland is secure from our adversaries.\"\nGov. Kristi Noem, R-N.D., speaking during the Republican National Convention in Milwaukee, July 15.(AP Photo/J. Scott Applewhite)\nGOP REP. MIKE WALTZ TAPPED TO BE TRUMP'S NATIONAL SECURITY ADVISER\nTrump announced that his longtime aide Dan Scavino Jr. will return to the White House as an assistant to the president and deputy chief of staff.\n\"Scavino was a Trump Campaign Senior Advisor and remains one of President Trump's longest serving and most trusted aides,\" the Trump transition team said.\nFormer White House deputy chief of staff Dan Scavino arrives at the Republican National Convention in Milwaukee, July 15.(AP Photo/Paul Sancya)\nTrump announced Stephen Miller would serve as deputy chief of staff for policy in his administration. Miller was a senior adviser in Trump’s first term. He helped craft many of Trump’s hard-line speeches and plans on immigration.\nSince Trump left office, Miller has served as the president ofAmerica First Legal, an organization of former Trump advisers fashioned as a conservative version of the American Civil Liberties Union, challenging the Biden administration, media companies, universities and others over issues such as freedom of speech and religion and national security.\nMiller has advocated for mass deportations during the second Trump term.\nStephen Miller, former Senior Advisor to President Trump, speaks at a campaign rally for Trump in Detroit, Oct. 18.(Win McNamee/Getty Images)\nTrump announced James Blair would serve in the White House as an assistant to the president and deputy chief of staff for legislative, political and public affairs.\n\"Blair was the Trump Campaign and Republican National Committee Political Director, managing hundreds of staff and overseeing a wide portfolio of political operations and programs,\" the Trump transition team said.\nBlair was in charge of the Trump campaign's get-out-the-vote operations in key battleground states, which Trump swept on Election Day.\nTrump announced that Taylor Budowich will join him in the White House as an assistant to the president and deputy chief of staff for communications and personnel.\n\"Prior to joining the Trump Campaign, Budowich served in a senior role in President Trump’s Leadership PAC, Save America, and as CEO of the pro-Trump Super PAC, MAGA Inc.,\" the Trump transition team said.\n\"Dan, Stephen, James, and Taylor were 'best in class' advisors on my winning campaign, and I know they will honorably serve the American people in the White House,\" Trump said in a statement announcing his senior campaign aides would be promoted to the White House. \"They will continue to work hard to Make America Great Again in their respective new roles.\"\nTaylor Budowich, a former spokesman for President-elect Trump and founder of MxM News app.(X)\nTulsi Gabbard,a former Democratic congresswoman from Hawaii, is Trump's pick for the position of director of national intelligence. The announcement was made on Wednesday.\nThe cabinet-level position involves overseeing the intelligence community and advising Trump and the National Security Council on intelligence matters. Gabbard is an Iraq War veteran and a U.S. Army reservist.\n\"As a former Candidate for the Democrat Presidential Nomination, she has broad support in both Parties - She is now a proud Republican!\" Trump said in a statement. \"I know Tulsi will bring the fearless spirit that has defined her illustrious career to our Intelligence Community, championing our Constitutional Rights, and securing Peace through Strength. Tulsi will make us all proud!\"\nTulsi Gabbard, former U.S. Representative from Hawaii, speaks during the Palmetto Family Council's Vision 24 national conservative policy forum in North Charleston, S.C., March 18, 2023.(Sam Wolfe/Bloomberg via Getty Images)\nPresident-electDonald Trumpnominated Sen. Marco Rubio, R-Fla., to serve as his Secretary of State.\n\"It is my Great Honor to announce that Senator Marco Rubio, of Florida, is hereby nominated to be The United States Secretary of State. Marco is a Highly Respected Leader, and a very powerful Voice for Freedom,\" Trump said in a statement. \"He will be a strong Advocate for our Nation, a true friend to our Allies, and a fearless Warrior who will never back down to our adversaries.\"\nRubio is knownas anIran and China hawk. He is a top GOP member of the Senate Intelligence Committee and ran for president in 2016.\nSen. Marco Rubio, R-Fla., attends a campaign rally for former President Donald Trump at the Trump National Doral Golf Club in Doral, Fla., July 9.(Joe Raedle/Getty Images)\nTrumpannounced Thursday evening that he's nominating former attorney general of Florida Pam Bondi as the next attorney general of the United States.\nTrump's latest Cabinet pick replaces Matt Gaetz, the former Florida representative and nominee for attorney general, who on Thursday withdrew as Trump's pick for the top prosecutor after the \"distraction\" his nomination had caused due to a swirl of allegations about paying underage women for sex.\n\"For too long, the partisan Department of Justice has been weaponized against me and other Republicans - Not anymore. Pam will refocus the DOJ to its intended purpose of fighting Crime, and Making America Safe Again,\" Trump said. \"I have known Pam for many years — She is smart and tough, and is an AMERICA FIRST Fighter, who will do a terrific job as Attorney General!\"\nShortly after the announcement, Gaetz said on X that Bondi is \"a stellar selection\" by Trump for attorney general.\n\"Pam and I worked closely together when she was Florida’s Attorney General and I chaired Criminal Justice in the state house,\" Gaetz wrote. \"She’s a proven litigator, an inspiring leader and a champion for all Americans. She will bring the needed reforms to DOJ.\"\nFormer Florida Attorney General Pam Bondi stands on stage in an empty Mellon Auditorium while addressing the Republican National Convention on August 25, 2020 in Washington, DC. The novel coronavirus pandemic has forced the Republican Party to move away from an in-person convention to a televised format, similar to the Democratic Party's convention a week earlier.(Chip Somodevilla/Getty Images)\nTrump named his personal criminal defense attorney Todd Blanche as deputy attorney general. The president-elect said that the 50-year-old lawyer has experience prosecuting gangs – as well as representing Trump in his 2024 criminal trial in New York.\n\"I am pleased to announce that Todd Blanche will serve as Deputy Attorney General in my Administration. Todd is an excellent attorney who will be a crucial leader in the Justice Department, fixing what has been a broken System of Justice for far too long,\" Trump announced in a news release.\nAttorney Todd Blanche listens as his client former U.S. President Donald Trump speaks as he arrives for his hush money trial at Manhattan Criminal Court on May 30, 2024, in New York City.(Michael M. Santiago/Getty Images)\nTrump announced he will tap former 2024 Democratic presidential candidate Robert F. Kennedy Jr. to lead the Department of Health and Human Services.\n\"I am thrilled to announce Robert F. Kennedy Jr. as The United States Secretary of Health and Human Services (HHS). For too long, Americans have been crushed by the industrial food complex and drug companies who have engaged in deception, misinformation, and disinformation when it comes to Public Health,\" Trump said in his announcement Thursday.\n\"The Safety and Health of all Americans is the most important role of any Administration, and HHS will play a big role in helping ensure that everybody will be protected from harmful chemicals, pollutants, pesticides, pharmaceutical products, and food additives that have contributed to the overwhelming Health Crisis in this Country. Mr. Kennedy will restore these Agencies to the traditions of Gold Standard Scientific Research, and beacons of Transparency, to end the Chronic Disease epidemic, and to Make America Great and Healthy Again!\" Trump added.\nKennedy dropped out of the presidential race in August and quickly endorsed the Trump-Vance ticket, and has since repeatedly vowed to \"Make America Healthy Again.\"\nRepublican presidential nominee former President Trump shakes hands with Independent presidential candidate Robert F. Kennedy Jr. at a campaign rally in Glendale, Ariz., Aug. 23.(AP Photo/Evan Vucci)\nPresident-elect Trumpannounced Thursday that he is nominating Jay Clayton to serve as U.S. attorney for the Southern District of New York.\n\"I am pleased to announce that Jay Clayton, of New York, the Chairman of the U.S. Securities and Exchange Commission during my first term, where he did an incredible job, is hereby nominated to be the U.S. Attorney for the Southern District of New York,\" Trump wrote in a post on Truth Social. \"Jay is a highly respected business leader, counsel, and public servant.\n\"Jay is going to be a strong Fighter for the Truth as we, Make America Great Again,\" the president-elect added.\nAnchor Maria Bartiromo interviews chairman of the U.S. Securities and Exchange Commission Jay Clayton during \"Mornings With Maria\" at Fox Business Network Studios on February 24, 2020 in New York City.\nPresident-elect Trumpannounced on Thursday his intent to nominate former Rep. Doug Collins, R-Ga., to serve as secretary of veterans affairs.\n\"Doug is a Veteran himself, who currently serves our Nation as a Chaplain in the United States Air Force Reserve Command, and fought for our Country in the Iraq War,\" Trump wrote on Truth Social. \"We must take care of our brave men and women in uniform, and Doug will be a great advocate for our Active Duty Servicemembers, Veterans, and Military Families to ensure they have the support they need.\n\"Thank you, Doug, for your willingness to serve our country in this very important role,\" the president-elect added.\nDean John Sauer, special assistant to the Louisiana attorney general, listens during a hearing with the House Judiciary Subcommittee in Washington, D.C., in 2023.(Anna Moneymaker/Getty Images)\nTrump announced Dean John Sauer as his pick for U.S. solicitor general.\n\"John is a deeply accomplished, masterful appellate attorney, who clerked for Justice Antonin Scalia in the United States Supreme Court, served as Solicitor General of Missouri for six years, and has extensive experience practicing before the U.S. Supreme Court and other Appellate Courts,\" Trump said in the announcement.\nSauer served as solicitor general of Missouri from 2017 to 2023, and represented Trump in his successful appeal to the U.S. Supreme Court in Trump v. United States.\nNorth Dakota Gov. Doug Burgum encourages voters to support Republican presidential candidate former President Trump during a campaign rally in Laconia, N.H.(Chip Somodevilla/Getty Images)\nPresident-elect Trump announced that North Dakota Gov. Doug Burgum will lead the Department of the Interior during a speech at the Americans for Prosperity Gala at Mar-a-Lago.\n\"He's going to be announced [Friday]…I look forward to doing the formal announcement, although this is a pretty big announcement right now, actually,\" Trump said. \"He's going to head the Department of Interior, and he's going to be fantastic.\"\nBurgum, a multi-millionaire former software company CEO turned two-term governor, launched a White House bid in June 2023. The governor made energy and natural resources a key part of his campaign for the GOP nomination.\nCLICK HERE TO GET THE FOX NEWS APP\nAfter he dropped out of the race, Burgum became a high profile surrogate for the former president, appearing on the campaign trail and in media hits on Trump’s behalf. He was in consideration as Trump’s running mate this past summer before Sen. JD Vance of Ohio was picked as the Republican Party’s vice presidential nominee.\nTrump announced Friday, Nov. 15, that Steven Cheung would return to the White House as assistant to the president and director of communications. Cheung previously served as communications director for the Trump-Vance campaign and was the White House director of strategic response in Trump's first term.\nSteven Cheung, spokesman for former US President Donald Trump, during a news conference with former US President Donald Trump, not pictured, at Trump National Golf Club in Bedminster, New Jersey, on Thursday, Aug. 15, 2024.(Bing Guan/Bloomberg via Getty Images)\nTrump also confirmed Fridaythat Sergio Gor will join the White House as director of the presidential personnel office. Gor, an ally and business partner of Donald Trump Jr.'s, was in charge of the pro-Trump political action committee Right For America and previously worked in RepublicanSen. Rand Paul's office.\n\"Steven Cheung and Sergio Gor have been trusted Advisors since my first Presidential Campaign in 2016, and have continued to champion America First principles throughout my First Term, all the way to our HIstoric Victory in 2024,\" Trump said in a statement. \"I am thrilled to have them join my White House, as we Make America Great Again!\"\nSergio Gor is reportedly President-elect Trump's choice to lead the Presidential Personnel Office in the new administration. (Andrew Kelly)(Andrew Kelly)\nTrump announced campaignspokesperson Karoline Leavittwill serve as White House press secretary for his upcoming administration.\n\"Karoline Leavitt did a phenomenal job as the National Press Secretary on my Historic Campaign, and I am pleased to announce she will serve as White House Press Secretary,\" Trump said in a statement Friday evening.\n\"Karoline is smart, tough, and has proven to be a highly effective communicator. I have the utmost confidence she will excel at the podium, and help deliver our message to the American People as we, Make America Great Again.\"\nLeavitt, 27, will be the youngest White House press secretary in U.S. history, unseating Nixon administration press secretary Ron Ziegler, who was 29 when he served in the role from 1969-1974.\nKaroline Leavitt will serve as White House press secretary.(MEGA/GC Images)\nWilliam Owen Scharf, one of Trump's lawyers, will serve as Assistant to the President and Staff Secretary starting in January.\nIn a statement on Saturday, the President-elect wrote that Scharf \"is a highly skilled attorney who will be a crucial part of my White House team.\"\n\"[Scharf] has played a key role in defeating the Election Interference and Lawfare waged against me, including by winning the Historic Immunity Decision in the Supreme Court,\" Trump's statement read.\nWill Scharf, attorney for former President Donald Trump speaks during a news conference at Trump Tower in New York City, Sept. 6.(Cheney Orr/Bloomberg via Getty Images)\nChris Wright,the CEO and founder of Liberty Energy, has been picked to lead the Department of Energy, according to a statement President-elect Trump released on Saturday.\n\"I am thrilled to announce that Chris Wright will be joining my Administration as both United States Secretary of Energy, and Member of the newly formed Council of National Energy,\" Trump's statement read, adding that Wright \"has been a leading technologist and entrepreneur in Energy.\"\nWright graduated from MIT with a degree in mechanical engineering, according to Liberty Energy's website. He also completed graduate work in electrical engineering at University of California, Berkeley and MIT.\n\"[Wright] is a self-described tech nerd turned entrepreneur and a dedicated humanitarian on a mission to better human lives by expanding access to abundant, affordable, and reliable energy,\" the company's website reads.\nLiberty Oilfield Services Inc. CEO Chris Wright has been tapped by President-elect Trump to lead the Energy Department.(Reuters/Lucas Jackson)\nPresident-elect Trumpannounced on Sundaythat he has picked Brendan Carr to serve as Chairman of the Federal Communications Commission (FCC) starting in January.\n\"Commissioner Carr currently serves as the senior Republican on the FCC. Before that, he was the FCC’s General Counsel,\" Trump's statement read. \"I first nominated Commissioner Carr to the FCC in 2017, and he has been confirmed unanimously by the United States Senate three times.\"\nAs a current member of the FCC, Carr recently called out \"Saturday Night Live\" for platforming Kamala Harris without inviting Trump, which violates FCC rules.\n\"NBC has structured this in a way that's plainly designed to evade the FCC's rules,\" Carr said to Fox News Digital. \"We're talking 50 hours before Election Day starts, without any notice to other candidates, as far as I can tell.\"\nCommissioner of the Federal Communications Commission Brendan Carr speaks during the 2024 Conservative Political Action Conference (CPAC) in National Harbor, Md.(Celal Gunes/Anadolu via Getty Images)\nPresident-elect Trumpannounced that he is nominating former Congressman Sean Duffy of Wisconsin, who is also a Fox News contributor and FOX Business co-host, to serve as the U.S. Secretary of Transportation.\n\"Sean has been a tremendous and well-liked public servant, starting his career as a District Attorney for Ashland, Wisconsin, and later elected to the U.S. House of Representatives for Wisconsin's 7th Congressional District,\" Trump said in his announcement on Monday. \"Sean will use his experience and the relationships he has built over many years in Congress to maintain and rebuild our Nation’s Infrastructure, and fulfill our Mission of ushering in The Golden Age of Travel, focusing on Safety, Efficiency, and Innovation. Importantly, he will greatly elevate the Travel Experience for all Americans!\"\nWhile in Congress, Duffy helped advocate for fiscal responsibility, economic growth and rural development.\nDuffy joined FOX News Media as a contributor in 2020. He currently serves as the co-host of FOX Business’The Bottom Linealongside Dagen McDowell. He also provides political analysis across all FOX News Media platforms.\nRep. Sean Duffy, R-Wis., leaves the House Republican Conference meeting in the U.S. Capitol in 2018.(Bill Clark/CQ Roll Call)\nCantor Fitzgerald CEOHoward Lutnickhas been nominated by President-elect Trump to serve as Secretary of Commerce.\n\"I am thrilled to announce that Howard Lutnick, Chairman & CEO of Cantor Fitzgeral, will join my Administration as the United States Secretary of Commerce,\" Trump said in a statement. \"He will lead our Tariff and Trade agenda, with additional direct responsibility for the Office of the United States Trade Representative.\"\n\"In his role as Co-Chair of the Trump-Vance Transition Team, Howard has created the most sophisticated process and system to assist us in creating the greatest Administration America has ever seen,\" Trump's statement added.\nHoward Lutnick, Chairman and CEO of Cantor Fitzgerald and Co-Chair of the Trump 2024 Transition Team speaks at a rally for former US President and Republican presidential candidate Donald Trump at Madison Square Garden in New York, October 27, 2024.(ANGELA WEISS/AFP via Getty Images)\nPresident-elect Trump plans to nominateDr. Mehmet Ozto serve as the Centers for Medicare and Medicaid Services (CMS) Administrator starting in January, he announced on Tuesday.\n\"America is facing a Healthcare Crisis, and there may be no Physician more qualified and capable than Dr. Oz to Make America Healthy Again,\" Trump said in a Truth Social post. \"He is an eminent Physician, Heart Surgeon, Inventor, and World-Class Communicator, who has been at the forefront of healthy living for decades.\"\nTrump wrote that Dr. Oz is expected to \"work closely\" withRobert F. Kennedy, Jr.,who the president-elect nominated to run the Department of Health and Human Services (HHS).\nPennsylvania GOP Senate candidate and former TV personality Dr. Mehmet Oz speaks before an appearance by former president Donald Trump to endorse local candidates at the Mohegan Sun Arena on September 03, 2022 in Wilkes-Barre, Pennsylvania.(Spencer Platt/Getty Images)\nPresident-elect Trump isappointing Linda McMahon,former CEO of World Wrestling Entertainment (WWE), to lead the Department of Education.\nHis announcement, which was posted on Truth Social, came hours after two sources told Fox News that McMahon was likely to be picked. Trump cited the businesswoman's expertise when he made the announcement.\n\"Linda will use her decades of Leadership experience, and deep understanding of both Education and Business, to empower the next Generation of American Students and Workers, and make America Number One in Education in the World,\" Trump's statement read. \"We will send Education BACK TO THE STATES, and Linda will spearhead that effort.\"\nLinda McMahon, former Administrator of Small Business Administration, speaks on Day 4 of the Republican National Convention (RNC), at the Fiserv Forum in Milwaukee, Wisconsin, U.S., July 18, 2024.(REUTERS/Mike Segar)\nTrump is tapping former Acting Attorney GeneralMatthew Whitakerto become U.S. ambassador to the North Atlantic Treaty Organization (NATO) in his new administration.\nTrump described Whitaker, who is from Iowa, as \"a strong warrior and loyal Patriot, who will ensure the United States' interests are advanced and defended.\"\nFormer U.S. Attorney General Matthew Whitaker speaks during a rally for Republican presidential nominee, former U.S. President Donald Trump at the Brick Breeden Fieldhouse at Montana State University on August 9, 2024 in Bozeman, Montana.(Michael Ciaglo/Getty Images)\n\"Matt will strengthen relationships withour NATO Allies, and stand firm in the face of threats to Peace and Stability - He will put AMERICA FIRST,\" Trump said in a statement. \"I have full confidence in Matt’s ability to represent the United States with Strength, Integrity, and unwavering Dedication. I look forward to working closely with him as we continue to promote PEACE THROUGH STRENGTH, Freedom, and Prosperity around the World.\"\n\"Matt is also the former U.S. Attorney for theSouthern District of Iowa, and is a graduate of the University of Iowa with a B.A., MBA and J.D., where he played football, and received the Big Ten Medal of Honor,\" Trump added.\nScott Bessent, founder of Key Square Group, was chosen for the coveted post of Treasury secretary. Bessent was a key economic policy adviser and fundraiser for theTrump campaign.\n\"Scott is widely respected as one of the World’s foremost International Investors and Geopolitical and Economic Strategists. Scott’s story is that of the American Dream,\" Trump said on Friday.\nTRUMP NOMINATES SCOTT BESSENT AS TREASURY SECRETARY; PICKS RUSS VOUGHT TO LEAD BUDGET OFFICE\nHe has been an advocate for economic policies like lower taxes, spending restraint and deregulation that have long made up the core of the Republican Party's platform, and has also been supportive of Trump's use of tariffs in trade negotiations.\nScott Bessent, founder and chief executive officer of Key Square Group LP, at an interview during the Republican National Convention (RNC) near the Fiserv Forum in Milwaukee, Wisconsin, US, on Tuesday, July 16, 2024.(Vincent Alban/Bloomberg via Getty Images)\nOn Friday, Trump tapped Russ Vought to lead the White House's Office of Management and Budget (OMB). Vought served as OMB director during Trump's first term. He also served as deputy OMB director and acting director.\n\"He did an excellent job serving in this role in my First Term - We cut four Regulations for every new Regulation, and it was a Great Success!\" Trump wrote on Truth Social.\nVought is a contributor to theHeritage Foundation's Project 2025and a close Trump ally.\nRussell Vought, Trump's director of the Office of Management and Budget from July 2020 to January 2021, openly supports the former president on Twitter. \"Enormously important paradigm shift back to the Founder’s Constitution! President Trump is the only one with the courage to take this fight on and deal with the original sin of our spending woes,\" Vought said in a tweet.(Al Drago)\nTrump nominated Scott Turner as the secretary of the Department of Housing and Urban Development (HUD). Turner, who is chair of the Center for Education Opportunity and is a former professional football player, previously served as executive director of the White House Opportunity and Revitalization Council (WHORC).\nTRUMP PICKS SCOTT TURNER AS SECRETARY OF DEPARTMENT OF HOUSING AND URBAN DEVELOPMENT\n\"Scott is anNFL Veteran, who, during my First Term, served as the First Executive Director of the White House Opportunity and Revitalization Council (WHORC), helping to lead an Unprecedented Effort that Transformed our Country’s most distressed communities,\" Trump said in a Friday statement. \"Those efforts, working together with former HUD Secretary, Ben Carson, were maximized by Scott’s guidance in overseeing 16 Federal Agencies which implemented more than 200 policy actions furthering Economic Development. Under Scott’s leadership, Opportunity Zones received over $50 Billion Dollars in Private Investment!\"\nTurner, a former Texas state lawmaker, played nine seasons in the NFL as a member of the Washington Redskins, San Diego Chargers and the Denver Broncos.\nScott Turner, former executive director of the White House Opportunity and Revitalization Council, during the America First Policy Institute's America First Agenda summit in Washington, D.C., US, on Monday, July 25, 2022.(Al Drago/Bloomberg via Getty Images)\nTrump nominated Rep. Lori Chavez-DeRemer, R-Ore., on Friday for secretary of labor.\n\"I am proud to hereby nominate Congresswoman Lori Chavez-DeRemer, from the Great State of Oregon, as United States Secretary of Labor,\" Trump wrote in an official statement. \"Lori has worked tirelessly with both Business and Labor to build America’s workforce, and support the hardworking men and women of America. I look forward to working with her to create tremendous opportunity for American Workers, to expand Training and Apprenticeships, to grow wages and improve working conditions, to bring back our Manufacturing jobs. Together, we will achieve historic cooperation between Business and Labor that will restore the American Dream for Working Families.\"\nChavez-DeRemer was first elected to Congress in 2022, andlost re-electionin a close race against Democrat Janelle Bynum earlier this month. Her candidacy was backed by the Teamsters Union.\nLori Chavez-DeRemer, Republican candidate from Oregon, running for the U.S. House of Representatives in the 2022 U.S. midterm elections, appears in an undated handout photo provided October 11, 2022.(Ben Lee/Handout via REUTERS )\nPresident-elect Trump announced that former Rep. Dr. Dave Weldon, R-Fla., is his pick as the director of the Centers for Disease Control and Prevention (CDC).\n\"In addition to being a Medical Doctor for 40 years, and an Army Veteran, Dave has been a respected conservative leader on fiscal and social issues, and served on the Labor/HHS Appropriations Subcommittee, working for Accountability on HHS and CDC Policy and Budgeting,\" Trump said in the Friday evening announcement.\nTrump said that Dr. Weldon would restore trust in the agency and transparency.\nTrump on Friday nominated Dr. Marty Makary, a pancreatic surgeon at Johns Hopkins University, as commissioner of the Food and Drug Administration.\nMakary is the chief of Islet Transplant Surgery at Johns Hopkins, according tothe university’s website, and was a Fox News medical contributor.\n\"FDA has lost the trust of Americans, and has lost sight of its primary goal as a regulator. The Agency needs Dr. Marty Makary, a Highly Respected Johns Hopkins Surgical Oncologist and Health Policy Expert, to course-correct and refocus the Agency,\"Trump said on Truth Social.\nTRUMP PICKS DR. JANETTE NESHEIWAT AS NATION'S NEXT SURGEON GENERAL\n\"He will work under the leadership of Robert F. Kennedy Jr. to, among other things, properly evaluate harmful chemicals poisoning our Nation's food supply and drugs and biologics being given to our Nation's youth, so that we can finally address the Childhood Chronic Disease Epidemic,\" Trump said.\nDr. Janette Nesheiwat, a New York City-based double board-certified doctor, and, Dr. Marty Makary, a Johns Hopkins health policy expert and surgeon, right.(Fox News)\nTrump also nominatedDr. Janette Nesheiwatas surgeon general, saying that she would be a \"fierce advocate and strong communicator for preventative medicine and public health.\"\n\"I am proud to announce that Dr. Janette Nesheiwat will be the Nation’s Doctor as the United States Surgeon General. Dr. Nesheiwat is a double board-certified Medical Doctor with an unwavering commitment to saving and treating thousands of American lives,\" he said.\nNesheiwat is a former Fox News medical contributor.\nDr Janette Nesheiwat attends the 2023 FOX Nation Patriot Awards at The Grand Ole Opry on November 16, 2023 in Nashville, Tennessee.(Photo by Terry Wyatt/Getty Images)\nTrump announced Friday that his former White House adviser, Sebastian Gorka, will serve in his incoming administration. Gorka will serve as deputy assistant to the president and senior director for counterterrorism.\nGorka, a former Trump aide, previously served as deputy assistant to the president during Trump's first term. He's also a former Fox News contributor.\n\"Since 2015, Dr. Gorka has been a tireless advocate for the America First Agenda and the MAGA Movement, serving previously as Strategist to the President in the first Trump Administration,\" Trump said.\nSebastian Gorka and Alex Wong will serve under President-elect Trump for a second term.( (L) Getty Images, (R) Department of State)\nSimilarly to Gorka, Alex Wong served under Trump during his first term.\nWong served in the State Department as deputy special representative for North Korea, and the deputy assistant secretary for East Asian and Pacific affairs.\nPresident-elect Trump tapped Brooke Rollins as his agriculture secretary. Rollins, the president and CEO of AFPI, previously served in Trump's first administration as director of the Office of American Innovation and acting director of the Domestic Policy Council.\nTrump lauded Rollins' \"commitment to support the American Farmer, defense of American Food Self-Sufficiency, and the restoration of Agriculture-dependent American Small Towns.\"\n\"A proud Graduate of Texas A&M University, Brooke earned a Bachelor’s of Science Degree in Agriculture Development, and J.D., with Honors,\" Trump's official announcement said. \"From her upbringing in the small and Agriculture-centered town of Glen Rose, Texas, to her years of leadership involvement with Future Farmers of America and 4H, to her generational Family Farming background, to guiding her four kids in their show cattle careers, Brooke has a practitioner’s experience, along with deep Policy credentials in both Nonprofit and Government leadership at the State and National levels.\"\nBrooke Rollins, president and CEO of AFPI, is seen during the America First Policy Institute's America First Agenda Summit at the Marriott Marquis, July 26, 2022.(Tom Williams/CQ-Roll Call, Inc via Getty Images)\nTrump appointed James Braid to serve in the White House as the deputy assistant to the president and as the director of the Office of Legislative Affairs.\nBraid worked in legislative affairs at the Office of Management and Budget during Trump’s first term, and since then he has served as the lead policy staffer for Vice President-elect JD Vance in the U.S. Senate.\nBraid has also served as chief of staff for multiple members of Congress, and has taken on several other senior policy roles on Capitol Hill since 2015.\nTrump appointed Matt Brasseaux to serve as deputy assistant to the president and as the director of the Office of Public Affairs.\nBrasseaux worked as a deputy political director for the Trump Campaign and Republican National Committee in 2024.\nHe also served as a regional political director for the Republican National Committee and campaign manager for now-Gov. Joe Lombardo in Nevada.\nTrump tapped Alex Latcham to serve in the White House as the deputy assistant to the president and as the director of the Office of Public Liaison.\nLatcham previously served as special assistant to the president and deputy political director during Trump’s first term.\nFor the past eight years, Latcham served Trump as a senior deputy political director for his campaign and for the Republican National Committee.\nStanford-trained physician and economist Dr. Jay Bhattacharya has officially been nominated byPresident-elect Donald Trumpto serve as the next director of the National Institutes of Health (NIH).\nTrump made the announcement in a Truth Social post, writing: \"I am thrilled to nominate Jay Bhattacharya, MD, PhD, to serve as Director of the National Institutes of Health. Dr. Bhattacharya will work in cooperation with Robert F. Kennedy Jr. to direct the Nation’s Medical Research, and to make important discoveries that will improve Health, and save lives.\"\nBhattacharya met this week with Robert F. Kennedy Jr., who was nominated by Trump to lead the Department of Health and Human Services, which oversees the NIH and other health agencies, and impressed the former presidential candidate with his ideas to overhaul the NIH, which oversees U.S. biomedical research, according to The Washington Post.\nDr. Jay Bhattacharya has been picked to lead the National Institutes of Health.(Getty Images)\nThe incoming president announced Jamieson Greer as his pick to serve as the next U.S. trade representative. Greer previously served as chief of staff to thetrade representativeduring Trump’s first term, Robert Lighthizer at a time when the administration implemented tariffs on China and other nations.\nIn announcing Greer's nomination, Trump said in a statement that Greer was instrumental in his first term in imposing tariffs on China and others and replacing the trade agreement with Canada and Mexico, \"therefore making it much better for American Workers.\"\nBusinessman John Phelan will serve as the nextsecretary of the Navyas well. Phelan is the co-founder of co-founded MSD Capital.\n\"His Record of Success speaks for itself -- A true Champion of American Enterprise and Ingenuity!\" Trump said in a statement.\n\"John will be a tremendous force for our Naval Service members, and a steadfast leader in advancing my America First vision,\" Trump said. \"He will put the business of the U.S. Navy above all else.\"\nJim O’Neill was nominated to serve as the deputy secretary ofHealth and Human Services(HHS) to work alongside Robert F. Kennedy Jr., who has been tapped to lead the agency.\nO'Neill, who served as principal associate deputy secretary of HHS, \"will fight in unison to ensure every American, and especially our most precious resource, our children, will live long and healthy lives and, Make America Great and Healthy Again!\" said Trump.\nHaley, a speechwriter for the Trump campaign, will lead the president-elect's domestic agenda.\nEconomist Kevin Hassett, 62, was named director of the White House National Economic Council, bringing into Trump's administration a major advocate for tax cuts. He played a crucial role in helping design and pass the Tax Cuts and Jobs Act of 2017, Trump said.\nHe will also \"will play an important role in helping American families recover from the inflation that was unleashed by the Biden Administration\" and that together they would \"renew and improve\" the 2017 tax cuts, many of which are set to expire after 2025.\nHassett served in the first Trump term as chairman of the Council ofEconomic Advisers.\nPresident-elect Trump has nominated a Vietnam War veteran and retired general for a potential new post focused on ending the Russia-Ukraine war.\nTrump has created the position of special envoy for the Ukraine conflict, according to Reuters, and pickedLt. Gen. Keith Kelloggfor the post.\nKellogg servedas former Vice President Mike Pence’s national security adviser and was spotted at the president-elect’s Mar-a-Lago club on Tuesday, according to the New York Post.\nRetired Lt. Gen. Keith Kellogg was picked by Trump to be the special envoy for the Ukraine conflict.(Drew Angerer/Getty Images)\nPresident-elect Trump has nominated Charles Kushner, the father of Jared Kushner, to serve in his new administration as the U.S. ambassador to France.\n\"I am pleased to nominate Charles Kushner, of New Jersey, to serve as the U.S. Ambassador to France,\" Trump wrote in a Truth Social post on Saturday. \"He is a tremendous business leader, philanthropist, & dealmaker, who will be a strong advocate representing our Country & its interests.\"\nIn 2020, Kushner was pardoned by Trump 15 years after being found guilty of falsifying tax returns, witness tampering and illegal campaign contributions.\nPresident-elect Donald Trump has named longtime ally Kashyap \"Kash\" Patel, who has been a frequent and harsh critic of the FBI, to serve as the bureau's next director in thenew administration.\nPatel, 44, is an attorney with experience in national security, intelligence and counterterrorism and helped uncover the bureau's surveillance of the Trump campaign and first term. He has been a member of Trump’s transition team, advising the administration on other appointments.\n\"Kash is a brilliant lawyer, investigator, and ‘America First’ fighter who has spent his career exposing corruption, defending Justice, and protecting the American People,\" Trump's statement read. \"He played a pivotal role in uncovering the Russia, Russia, Russia Hoax, standing as an advocate for truth, accountability, and the Constitution.\"\nThe current FBI director, Christopher Wray, is currently serving a 10-year appointment which began in 2017. Wray will either need to be fired or resign in order for Patel to take the position.\nPatel is widely seen as a staunch Trump loyalist who will implement Trump’s desired reforms within the agency. During the first Trump administration, he served as senior director for counterterrorism at the National Security Council and later as the chief of staff for acting Secretary of Defense Christopher Miller, from 2020-21.\nFormer Chief of Staff to the U.S. Secretary of Defense Kash Patel speaks during a campaign rally for former President Trump at Findlay Toyota Center in Prescott Valley, Ariz., Oct. 13.(Rebecca Noble/Getty Images)\nPresident-electTrumpnominatedFloridasheriff Chad Chronister as administrator of the U.S. Drug Enforcement Agency (DEA).\n\"For over 32 years, Sheriff Chad Chronister has served the Hillsborough County Sheriff’s Office, and received countless commendations and awards for keeping his community SAFE,\" Trump wrote in his announcement moments before he nominated Kash Patel to replace Christopher Wray as FBI director.\nChronister withdrew from the nomination on December 3 following intense backlash over his arrest of a pastor for violating COVID rules during the pandemic in 2020.\n\"Over the past several days, as the gravity of this very important responsibility set in, I’ve concluded that I must respectfully withdraw from consideration,\" Chronister announced on social media. \"There is more work to be done for the citizens of Hillsborough County and a lot of initiatives I am committed to fulfilling.\"\nPresident-elect Trump tapped his daughter Tiffany Trump's father-in-law, Lebanese-American businessman Dr. Massad Boulos, to join his Cabinet as senior adviser on Arab and Middle Eastern affairs.\n\"I am proud to announce that Massad Boulos will serve as Senior Advisor to the President onArab and Middle Eastern affairs,\" the president-elect wrote on TRUTHSocial. \"Massad is an accomplished lawyer and a highly respected leader in the business world, with extensive experience on the International scene.\"\nBoulos led efforts to engage the Arab American community, organizing dozens ofmeetings across Michiganand other areas with large Arab populations.\nDr. Massad Boulos, Tiffany Trump's father-in-law, sits for a portrait at the Wall Street Hotel  in New York on Sep 4, 2024.(Jeenah Moon for The Washington Post via Getty Images)\nTrump nominated businessman and philanthropist Warren A. Stephens to serve as the U.S. Ambassador to the Court of St. James, which in simple terms, is the country’s representative to the U.K.\n\"Over the last 38 years, while serving as the President, Chairman, and CEO of his company, Stephens Inc., Warren has built a wonderful financial services firm, while selflessly giving back to his community as a philanthropist,\" Trump said in a post on Truth Social. \"Warren has always dreamed of serving the United States full time. I am thrilled that he will now have that opportunity as the top Diplomat, representing the U.S.A. to one of America’s most cherished and beloved Allies.\"\nTrump then congratulated Stephens, his wife Harriet, their three children Miles, John and Laura, and their six grandchildren.\nPresident-elect Trump nominated Warren A. Stephens to serve as the ambassador to the United Kingdom, marking off another role in his growing list of administration nominations.(Getty Images)"}, {"source": "foxnews", "title": "'Obama bros' trash Biden for making defenders look 'stupid' with Hunter pardon: 'Typical, lying politician'", "link": "https://www.foxnews.com/media/obama-bros-trash-biden-making-defenders-look-stupid-hunter-pardon-typical-lying-politician", "content": "Trump-Vance transition senior adviser Jason Miller gives his take on President Biden’s pardon for his son and recent attacks on Trump Cabinet nominees, during an appearance on ‘Fox & Friends.’\nThree former aides to President Obama railed againstPresident Bidenfor \"lying\" and making his defenders \"look like they're full of s---\" by pardoning his son Hunter after previously saying he would not do so.\nJon Favreau, Jon Lovett and Tommy Vietor, who were often referred to as the \"Obama bros\" during their tenure in the White House, discussed the ramifications of Biden's pardon of his son, on their \"Pod Save America\" podcaston Tuesday.\nVietor said he understood Biden's decision on a \"human level,\" but was frustrated that the president had made his defenders within the Democratic Party look \"stupid\" by reneging on his pledge not to pardon his son.\n\"Now everyone looks stupid. Everyone looks like they are full of s---,\" Vietor said. \"And Republicans are going to use this to argue it was politics as usual when Democrats warned of Trump's corruption or threat to the rule or the threat to democracy. And I think that's the piece of this I am most frustrated with, which is Joe Biden looking like a typical,lying politician. And I think that leads to a cynical feeling that all politicians are bad. They are all the same and that this is just par for the course.\"\nTAPPER SAYS BIDEN LYING ABOUT PARDONING HUNTER MAKES HIS ADMIN AND ALLIES ‘EITHER CREDULOUS OR COMPLICIT’\nPresident Biden speaks to reporters outside of St. Edmond's Roman Catholic Church in Rehoboth Beach, Delaware, Saturday, Aug. 31, 2024.(AP Photo/Manuel Balce Ceneta)\nBiden had \"damaged his own reputation\" and \"damaged the Democratic Party's reputation,\" Vietor added.\nFellow co-host Jon Favreau called it \"most infuriating\" that Biden chose to pardon his son and not \"a whole bunch of other people who were just government servants doing their job,\" such asDr. Anthony Fauci.\nFavreau said he believed Biden when he said he would not pardon his son and now he felt like a \"fool.\"\n\"I believed him. I feel like a f---ing fool, that's what makes me mad about it,\" he admitted.\nThe president's pardon came after the first son was convicted in two separate federal cases earlier this year.\nCLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE\nJon Favreau, Jon Lovett and Tommy Vietor at Politicon at Pasadena Convention Center on July 29, 2017, in Pasadena, California.(John Sciulli/Getty Images for Politicon)\nThe younger Biden pleaded guilty to federal tax charges in September, and was convicted of three felony gun charges in June after lying on a mandatory gun purchase form by saying he was not illegally using or addicted to drugs.\nThe pardon spares Hunter Biden from his upcoming sentencing in the two cases, but also covers all potential crimes he \"has committed or may have committed\" from Jan. 1, 2014 to Dec. 1, 2024.\nLovett feared the sweeping pardon would give Republicans ammunition to argue that Biden was acting to protect himself fromallegations he profitedfrom his son's business dealings when he was vice president.\n\"Of course, conservatives are going to say, ‘See? Joe Biden is just protecting himself,'\" Lovett remarked.\nThe former Obama aides said there was no evidence that Biden profited but the appearance of it was damaging to the Democratic Party's reputation, nonetheless.\nPresident Biden broke his repeated promise to not pardon his son, Hunter, announcing Sunday that he would pardon him.(BRENDAN SMIALOWSKI/AFP via Getty Images)\nBiden should've framed the pardon as a proactive measure against concerns President-elect Trump would target his political enemies, Lovett argued.\nThe White House did not respond to a request for comment from Fox News Digital.\nCLICK HERE TO GET THE FOX NEWS APP\nFox News' Brandon Gillespie contributed to this report.\nKristine Parks is an associate editor for Fox News Digital. Read more."}, {"source": "foxnews", "title": "Watergate lawyer encourages Biden to pardon everyone on Trump's 'enemies list'", "link": "https://www.foxnews.com/media/watergate-lawyer-encourages-biden-pardon-everyone-trumps-enemies-list", "content": "National Review senior writer Noah Rothman discusses Americans' reactions to President Biden pardoning his son Hunter on 'The Story.'\nCNN contributor and Watergate figure John Dean is urging President Biden to expand his pardon list to sink any prospect of President-elect Donald Trump getting \"revenge\" against his political enemies.\nIna poston social media site Bluesky, Dean advised Biden to issue a \"blanket pardon\" for DOJ officials who have investigated or prosecuted Trump so he can’t punish them once he gets into office.\n\"Biden should keep going with his pardons: Trump, Jack Smith & team, Mueller & team, and a blanket pardon for all on Trump’s enemies list for any and all political statements before December 25, 2024! Merry Christmas,\" Deanwroteon Sunday.\nDean’s post came shortly after Biden announced that he pardoned his son, Hunter, who was facing potentially significant prison time for federal tax evasion and gun convictions.\nBIDEN'S SWEEPING HUNTER PARDON AT ODDS WITH LONGTIME RHETORIC ON EXECUTIVE POWER: 'NO ONE IS ABOVE THE LAW'\nJohn Dean, former counsel to President Nixon, advised President Biden to pardon all of President-elect Trump's political enemies so he can't exact \"revenge\" on them when he gets back into office.\nIn announcing the pardon, the president criticized what he deemed the unfair investigation and prosecution of his son, a process he said was \"infected\" by politics and led to a \"miscarriage of justice.\"\n\"No reasonable person who looks at the facts of Hunter’s cases can reach any other conclusion than Hunter was singled out only because he is my son — and that is wrong,\" President Biden said in a statement Sunday.\nAfter Hunter Biden’s pardon, the judge in his firearms case terminated the remainder of the proceedings. His sentencing date had beenscheduled for Dec. 12.\nPresident Biden broke hisown repeated pledgethat he wouldn't pardon Hunter with the move.\nDean, who was former President Nixon’s White House counsel during the Watergate scandal, wrote that pardoning Trump’s enemies could be a way to \"take the wind out of retribution/revenge!\"\nBORDER STATE OFFERS TRUMP MASSIVE PLOT OF LAND TO AID MASS DEPORTATION OPERATION\nPresident Biden and son Hunter Biden(BRENDAN SMIALOWSKI/AFP via Getty Images)\nDean's \"retribution\" line was a reference to Trump telling supporters at CPAC in 2023, \"I am your warrior. I am your justice. And for those who have been wronged and betrayed: I am your retribution.\"\nCritics have expressed fears that once the president-elect returns to office, he will use his power to get back at those who launched and cooperated in investigations and prosecutions of him during his presidency and beyond.\nTrump posted in September, \"WHEN I WIN, those people that CHEATED will be prosecuted to the fullest extent of the Law, which will include long-term prison sentences so that this Depravity of Justice does not happen again.\"\nHowever, in several other appearances during and after his 2024 presidential campaign, Trump has softened this rhetoric and even extended grace to his most ardent critics.\nDuring an interviewwith Fox News Channel host Sean Hannity in June, Trump said those worried about retribution are \"wrong.\"\n\"No. 1, they're wrong. It has to stop, because otherwise we're not going to have a country,\" he told Hannity, but he added that \"based on what they've done, I would have every right to go after them.\"\nPresident-elect Donald Trump(Rebecca Noble/Getty Images)\nDean has been an outspoken critic of Trump, eventestifying against himin 2019 during a Democrat-led congressional hearing about then-Special Counsel Robert Mueller’s report on allegations of Trump-Russia collusion. The Watergate lawyer has also previously referred to Trump as an \"authoritarian president\" on social media.\nDean has long been a favorite voice of the progressive media for his criticism of the Republican Party and constant invocation of Watergate tohype up GOP scandals.\nDean was a key figure in the Watergate prosecution efforts that led to Nixon's resignation. Dean served a short prison sentence after pleading guilty to obstruction of justice for his role in the cover-up and was disbarred.\nCLICK HERE TO GET THE FOX NEWS APP\nFox News Digital's Breanne Deppisch contributed to this report.\nGabriel Hays is an associate editor for Fox News Digital."}, {"source": "foxnews", "title": "Israel's Netanyahu reacts after Trump warns of 'hell to pay' if Hamas doesn't free hostages", "link": "https://www.foxnews.com/world/israels-netanyahu-reacts-after-trump-warns-hell-pay-hamas-doesnt-free-hostages", "content": "Hudson Institute senior fellow Rebeccah Heinrichs assesses the state of the Israeli-Hezbollah cease-fire, discusses Syrian rebels seizing parts of Aleppo, and how the U.S. can aid in negotiations to end the Russia-Ukraine war.\nIsraeli Prime Minister BenjaminNetanyahusays President-elect Donald Trump is in the \"right place\" when it comes to his warning of there being \"hell to pay\" if Hamas doesn’t release their remaining hostages.\n\"President Trump put the emphasis in the right place, on Hamas, and not on the Israeli government, as is customary [elsewhere],\" Netanyahu said Tuesday at the beginning of a cabinet meeting,according to Reuters.\nTrump on Monday called on Hamas to release all hostages prior to when he takes office on Jan. 20.\nIn a Truth Social post, Trump said nothing was being done to free those being held by the Iran-backed terror group since Oct. 7, 2023, after Hamas attacked Israel and killed more than 1,100 people and kidnapped at least 250 others. Of the 101 hostages that remain in Gaza, seven are Americans.\nAMERICAN-ISRAELI IDF PLATOON COMMANDER KILLED IN BATTLE, BODY HELD IN GAZA, IDF SAYS\nFormer President Trump shakes hands with Israeli Prime Minister Benjamin Netanyahu during their meeting at Trump's Mar-a-Lago residence in Palm Beach, Fla., on July 26, 2024.(Amos Ben-Gershom (GPO)/Handout/Anadolu via Getty Images)\n\"Everybody is talking about the hostages who are being held so violently, inhumanely, and against the will of the entire World, in the Middle East – But it’s all talk, and no action!\"Trump wrote.\n\"Please let this TRUTH serve to represent that if the hostages are not released prior to January 20, 2025, the date that I proudly assume Office as President of the United States, there will be ALL HELL TO PAY in the Middle East, and for those in charge who perpetrated these atrocities against Humanity,\" Trump added.\n7 US HOSTAGES ARE STILL HELD BY HAMAS TERRORISTS\nIsraeli Prime Minister Benjamin Netanyahu makes a televised statement on Nov. 26, 2024, in Jerusalem.(Israeli Government Press Office via AP)\nThe message also drew support from Israeli Finance Minister Bezalel Smotrich.\nHamas terrorists are still holding 101 hostages in the Gaza Strip.(Yousef Masoud/Majority World/Universal Images Group via Getty Images/File)\nCLICK HERE TO GET THE FOX NEWS APP\n\"This is the way to bring back the hostages: by increasing the pressure and the costs for Hamas and its supporters, and defeating them, rather than giving in to their absurd demands,\" Reuters quoted him as saying.\nFox News’ Louis Casiano contributed to this report.\nGreg Norman is a reporter at Fox News Digital."}, {"source": "foxnews", "title": "Fox News Politics: Tipping the Scales to the Left", "link": "https://www.foxnews.com/politics/fox-news-politics-tipping-scales-left", "content": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump transition, exclusive interviews and more Fox News politics content.\nHere's what's happening…\n-Hunter Biden’s pardon setstroubling precedent, risks politicizing Justice Department, critics say\n-Senate Democratsname top leadership positions after losing chamber majority\n-House Dem moves to force vote on releasingGaetz ethics report\nTheSenate GOP leaderon Monday slammed decisions by two federal judges to reverse their announced retirements after Republican former President Trump won re-election in November.\nMinority Leader Mitch McConnell, R-Ky., criticized the pair of \"partisan Democrat district judges\" after they announced plans to \"unretire\" after \"the American people voted to fire Democrats last month.\"\n\"Looking to history, only two judges have ever unretired after a presidential election. One Democrat in 2004 and one Republican in 2009. But now, in just a matter of weeks, Democrats have already met that all-time record. It's hard to conclude that this is anything other than open partisanship,\" McConnell said in remarks delivered on the Senate floor…Read more\nSenate Minority Leader Mitch McConnell, R-Ky., speaks with reporters after a meeting with fellow Republicans, at the Capitol in Washington, Tuesday, June 4, 2024. (AP Photo/J. Scott Applewhite)(AP)\n'IMPARTIAL INSTITUTION':Hunter Biden's ex-biz partner reveals Trump DOJ blueprint he would like to see after last-minute pardon…Read more\nGUNNING FOR JUSTICE:DOJ special counsel says Hunter Biden’s indictment should not be dismissed…Read more\nTRUMP TRUMPS BIDEN:Mar-a-Lago trumps White House as president-elect overshadows Biden on world stage…Read more\nCanadian Prime Minister Justin Trudeau met with President-elect Trump at Mar-a-Lago in Florida on Friday to discuss topics like the economy, illegal immigration and a proposed 25% tariff.(Justin Trudeau X)\nHUNTER BIDEN SAGA:Hunter Biden gun case terminated after pardon, but Delaware judge stops short of full dismissal…Read more\n'MAJOR INCREASE':John Bolton declares hiking US defense budget the 'most important priority in foreign affairs today'…Read more\n'MOUTHPIECES FOR GOVERNMENT':Elon Musk and Vivek Ramaswamy agree on 'need to scrutinize' US funding for NGOs…Read more\nA side-by-side of Vivek Ramaswamy and Elon Musk.(Getty Images/AP Images)\n'DEEP STATE' FOE:FBI has long been accused of politicization ahead of Dem concern over Kash Patel nomination…Read more\nPARTING WORDS:Outgoing DNC chair defends party, says 2024 could have been worse for Democrats…Read more\nLEADERSHIP ELECTION:Senate Democrats to hold leadership elections after losing chamber majority…Read more\n'NO LONGER EMPLOYED':House Democrat staff member fired following arrest by Capitol Police…Read more\nPROMOTED:General involved in Afghanistan withdrawal has promotion confirmed by Senate…Read more\nGETTING TESTY:Recently ousted Dem senator said he's 'getting the f*** out of here' when asked about presidential pardon…Read more\nU.S. Sen. Jon Tester prepares to debate GOP challenger Tim Sheehy on campus at the University of Montana in Missoula, Mont., Monday, Sept. 30, 2024.(The Missoulian via AP)\nCROSSING THE AISLE:Dem lawmaker joins Republican-led DOGE caucus with push to remove Secret Service from DHS…Read more\n'FROM THE ASHES':Conservative group's roadmap calls for Congress to rebuild new US immigration system ‘from the ashes’…Read more\n'ABOVE THE LAW':Dem Rep. Dean Phillips blasts Biden after Hunter pardon, says some people ‘are indeed above the law’…Read more\n'CHOOSE WORDS CAREFULLY':Denver mayor criticized by hometown paper over vow to resist Trump deportations…Read more\nSTACKING THE DECK:Daniel Penny prosecutor dangles race card again over defense objection despite no hate crime charges…Read more\nSHOOTER TO SHOP OWNER?\":Would-be Reagan assassin John Hinckley Jr. opening music store…Read more\n'COMMON SENSE':Ohio Lt. Gov. touts state's 'common sense' bathroom bill, hopes to see similar bills 'across the country'…Read more\nOhio Lt. Gov. Jon Husted told Fox News Digital that Ohio's bathroom bill is \"common sense.\"(Getty Images)\nRED LIGHTS:AOC's 'Red Light District' plagued by crime as Democrat who helped her rise to power says she 'disappeared'…Read more\nGANG EXECUTIONER?:Suspected Tren de Aragua gang member in Texas charged with murder, kidnapping…Read more\nFALLEN HEROES:Trump, DeSantis join thousands to mourn three Florida deputies killed in roadside crash…Read more\nGet the latest updates on the Trump presidential transition, incoming Congress, exclusive interviews and more onFoxNews.com.\nThis article was written by Fox News staff."}, {"source": "foxnews", "title": "Fox News Politics: Pardon us, Karine", "link": "https://www.foxnews.com/politics/fox-news-politics-pardon-us-karine", "content": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump transition, exclusive interviews and more Fox News politics content.\nHere's what's happening…\n-Five things to watch for onimmigration and border securityin 2025\n-Trump asks about 'J-6 Hostages' in response to Biden's pardon of Hunter:‘Such an abuse’\n-Republicans hammer Biden's'No one is above the law'claim following Hunter pardon: ‘Aged like fine milk’\nWhite House press secretary Karine Jean-Pierre faced the press for the first time Monday after President Bidenpardoned his son Hunter– an outcome that both Biden and Jean-Pierre previously insisted multiple times would not happen.\nOne reporterasked Jeane-Pierreif those previous statements denying a pardon \"could be seen as lies\" to the American people.\n\"One thing the president believes is to always be truthful with the American people,\" Jeane-Pierre said, repeatedly saying that Biden \"wrestled with [the decision].\"…Read more\nWhite House Press Secretary Karine Jean-Pierre speaks during a news conference in the Brady Press Briefing Room at the White House on April 9, 2024 in Washington, DC. Jean-Pierre and National Security Advisor Jake Sullivan discussed the Connecticut Huskies winning the NCAA Men's Basketball Tournament National Championship, Japan's Prime Minister Kishida's upcoming State visit to the White House, the ongoing hostage situation in Gaza and other topics. (Photo by Andrew Harnik/Getty Imag(Andrew Harnik/Getty Images)\n'OVER-PROMISED':Biden travels to Africa where policies were ‘over-promised and under-delivered,' amid massive China expansion…Read more\n'LIAR':Lawmakers harshly criticize Biden’s decision to pardon Hunter…Read more\n'THERE WAS NONE':Special counsel denies 'vindictive or selective' prosecution in Hunter Biden case…Read more\nBEG YOUR PARDON?:2 times Biden said he would not pardon son Hunter Biden…Read more\nPresident Joe Biden accompanied by his son Hunter Biden and his grandson Beau leave a book store as they walk in downtown Nantucket Mass., Friday, Nov. 29, 2024. (AP Photo/Jose Luis Magana)((AP Photo/Jose Luis Magana)\n'FAMILY AHEAD OF THE COUNTRY':Dem Colorado governor criticizes Biden for Hunter pardon…Read more\nEARLY CHRISTMAS GIFT:President Biden's pardon of son Hunter a political gift for Trump…Read more\n'I BET YOU...':Trump previously predicted Biden would pardon his son Hunter…Read more\n'A DISASTER':Biden blocks new mining in region that produces about 40% of nation's coal: 'It's a disaster'…Read more\nDEFENSE DOUBLE DOWN: Biden still believes 'no one is above the law,' White House says in wake of Hunter pardon…Read more\nJILL BIDEN SPEAKS:'Of course I support the pardon of my son,' Jill Biden tells reporter…Read more\nPresident Joe Biden and first lady Jill Biden arrive on the South Lawn of the White House in Washington, Monday, May 30, 2022, after returning from Wilmington, Del. (AP Photo/Andrew Harnik)\nPARTING GIFT:Biden administration to announce $725M weapons package to Ukraine months before Trump is sworn in…Read more\n'CONSEQUENCES':Trump victory boosts conservatives in Latin America, wake-up call to dictators: 'there will be consequences'…Read more\nCONSERVATIVE PUSHBACK:Thomas Massie, conservative commentators vocally oppose Trump's DEA nominee…Read more\n'HELP US IN THIS FIGHT':Harris campaign still asking for donations weeks after massive loss to Trump…Read more\n‘IRREPARABLY DAMAGED’: Mike Johnson unleashes on Biden's handling of justice after Hunter pardon…Read more\n'IT'S A SETBACK':Democrats criticize Biden over Hunter pardon…Read more\nHOUSE STAFFER ARRESTED:US Capitol Police arrest House Democrat staff member after finding ammunition in bag…Read more\nUnnamed U.S. senator contacted Capitol Police after allegedly receiving threatening voicemails. A U.S. Capitol Police badge is seen in Washington, D.C., on Jan. 5, 2022.(REUTERS/Elizabeth Frantz)\nDOWN TO THE WIRE:Single House race stands between Republicans and 1-seat majority…Read more\n'TRUMP-PROOFING' CALIFORNIA:Newsom proposes $25M from state legislature to take on Trump administration in courts…Read more\nREFUND THE POLICE:Experts see a tougher-on-crime shift in blue, purple states…Read more\nCRISIS:New York City is home to nearly 60k ‘criminal’ migrants: Report…Read more\nNEW YORK, NY - APRIL 11:  U.S. Immigration and Customs Enforcement (ICE), officers look to arrest an undocumented immigrant during an operation in the Bushwick neighborhood of Brooklyn on April 11, 2018 in New York City. New York is considered a \"sanctuary city\" for undocumented immigrants, and ICE receives little or no cooperation from local law enforcement.  ICE said that officers arrested 225 people for violation of immigration laws during the 6-day operation, the largest in New York City in recent years. (Photo by John Moore/Getty Images)((Photo by John Moore/Getty Images))\n'NOT BASED ON SCIENCE':COVID was 'most likely' leaked from Wuhan lab and social distancing had no basis in science: select committee…Read more\nGet the latest updates on the Trump presidential transition, incoming Congress, exclusive interviews and more onFoxNews.com.\nThis article was written by Fox News staff."}, {"source": "foxnews", "title": "Fox News Politics: Giving Thanks", "link": "https://www.foxnews.com/politics/fox-news-politics-giving-thanks", "content": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump transition, exclusive interviews and more Fox News politics content.\nHere's what's happening…\n-Top 5 biggestpolitical turkeysripped by conservatives in 2024\n-ConnecticutHouse Democrats report being targeted by bomb threats on Thanksgiving\n-Biden thankful for smooth transition of power, urges Trump to'rethink' tariffson Canada and Mexico\nSeveral liberal figures called on conservatives and President-elect Donald Trump supporters to give thanks to illegal immigrants on Thanksgiving, suggesting they acknowledge a large portion of migrants were the ones who harvested and packed their entrées enjoyed on Thursday.\n\"Everyone at the dinner table today, especially MAGA, please give thanks to the undocumented immigrants that picked and packed the food you’re enjoying,\" said former Obama Housing & Urban Development SecretaryJulian Castro.\n\"They deserve our grace. Happy Thanksgiving,\" the former San Antoniomayor added.\nCastro’s post was lambasted by respondents, who rhetorically asked which crops were being picked by the migrants flooding New York City and Chicago, while others suggested the characterizations were \"racist\" assumptions about farmworkers…Read more\n(iStock)\nTRANS IN MILITARY?:Trump team dismisses reports he will discharge trans in military: 'No decisions on this issue have been made'…Read more\nCOMMON UNDERSTANDING:Trump says Mexico will stop flow of migrants after speaking with Mexican president following tariff threats…Read more\nClaudia Sheinbaum Pardo, President of Mexico, speaks during  the National Agreement for the Human Right to Water and Sustainability, held at  the Ecological Park of Xochimilco. on November 25, 2024 in Mexico City, Mexico.(Carlos Santiago/ Pixelnews/Future Publishing via Getty Images)\n'RADICAL LEFT LUNATICS':Trump delivers Thanksgiving message to 'Radical Left Lunatics'…Read more\nMEDIA SHAKEUP:Inside how podcasters helped make Trump close the deal with young male voters…Read more\nSTILL HOT:Political betting markets still have plenty of action despite end of election season…Read more\nPresident-elect Donald Trump celebrating beating Vice President Kamala Harris in the 2024 presidential race early Wednesday morning.(Chip Somodevilla/Getty Images)\nIOWA RACE:Iowa Rep. Mariannette Miller-Meeks beats Dem challenger in state's 1st Congressional District…Read more\nGAME PLAN:New Republican Governors chair, pointing to campaign battles ahead, touts 'our policies are better'…Read more\nCALIFORNIA RACE:Democrat Derek Tran unseats Rep. Michelle Steel in California's 45th Congressional District…Read more\nGIANT CUTS:Top auto giants reporting job, factory cuts amid heightened push into EV market…Read more\nBUS RIDE BACK HOME:Texas could bus migrants to directly to ICE for deportation instead of sanctuary cities under proposed plan…Read more\n'HUGE WIN':Federal court of appeals just ruled that Texas has the right to build the razor wire border wall…Read more\nU.S. Border Patrol agents cut an opening through razor wire after immigrant families crossed the Rio Grande from Mexico on September 27, 2023 in Eagle Pass, Texas.(John Moore/Getty Images)\nEVACUATION DAY?:What is Evacuation Day? The forgotten holiday that predates Thanksgiving…Read more\nCANADIAN 'EMPIRE'?:New York lawmaker suggests NYS, New England secede to Canada over Trump…Read more\nGet the latest updates on the Trump presidential transition, incoming Congress, exclusive interviews and more onFoxNews.com.\nThis article was written by Fox News staff."}, {"source": "foxnews", "title": "Faith in DOJ plummets as Biden, pardoning Hunter, joins Trump in denouncing the department", "link": "https://www.foxnews.com/politics/faith-doj-plummets-biden-pardoning-hunter-joins-trump-denouncing-department", "content": "Senior political analyst Juan Williams joined 'MediaBuzz' to discuss why some Democrats are blaming the party's far-left 'woke' stance for Kamala Harris' presidential election loss.\nLet’s face it, trust in most of our government institutions has utterly collapsed.\nMany people don’t have faith in the FDA, the DOD, HUD, Homeland Security, the health agencies, and the list goes on. And they don’t trust the media to deliver basic facts about Washington without bias and blunders.\nThese sentiments have basically been growing for the last 60 years, since the lies about Vietnam merged with the lies about Watergate and forced Richard Nixon to resign.\nBIDEN, TRUMP BOTH RIP DOJ AFTER PRESIDENT PARDONS HUNTER\nBut the most sensitive federal agency, everyone would agree, is theJustice Department, including the FBI. Donald Trump has been attacking these agencies for years (along with the \"fake news\"), accusing them of politically persecuting him. He campaigned outside courthouses by telling reporters the prosecutors and judges were awful people who were out to get him solely because he was the leading candidate to win back the White House.\nJoe Biden, by breaking his promise not to pardon his son Hunter, did more than just lie. He ripped his own DOJ for \"selectively and unfairly prosecuting\" his son.\nI used to patrol the endless hallways of the J. Edgar Hoover building as the Justice Department beat reporter. On the criminal side, it is supposed to be independent, since Justice often winds up investigating the administration. Back in the day it was filled with fair-minded career prosecutors who pursued legitimate leads regardless of party.\nU.S. President Joe Biden and President-elect Donald Trump are pictured in front of the United States Department of Justice Headquarters.(Getty Images)\nIn sayingthat Hunter Bidenwas singled out for harsh treatment, the outgoing president is making the same argument as the incoming president, that the department is badly biased. Little wonder that so many people don’t trust DOJ.\nAll Biden had to do when repeatedly asked about a pardon or commutation was \"I’m not going to discuss hypotheticals.\" Then at least he wouldn’t have the lying part.\nThere is no question that Pam Bondi, despite some roughing up, will be the next attorney general, having precisely the experience (Florida AG, career prosecutor) that Matt Gaetz so blatantly lacked. She is not going to blow up the department.\nBut in picking Kash Patel torun the FBI– and ignoring that Chris Wray is not through with his 10-year term – Trump is sending a very different message. And this isn’t some dark secret. It’s in the nominee’s own words.\nTRUMP HIT FOR HIRING LOYALISTS LIKE PAM BONDI: DOESN’T EVERY PRESIDENT DO THAT?\nPatel has vowed to shut down the bureau’s Washington headquarters. He said last year on Steve Bannon’s podcast, which we played on \"Media Buzz\": \"We will go out and find the conspirators…not just in government, but in the media.… Whether it’s criminally or civilly, we’ll figure that out.\"\nIn his 2022 book \"Government Gangsters,\" Patel names 60 people as part of the deep state,  \"a cabal of unelected tyrants…the most dangerous threat to our democracy.\" The press has dubbed this an enemies list.\nIt includes the aforementioned Bill Barr (for blocking his appointment), NSC chairman John Bolton (an \"arrogant control freak\"), and Defense Secretary Mark Esper (who tried to fire him).\nHunter Biden, son of U.S. President Joe Biden departs the J. Caleb Boggs Federal Building on June 03, 2024 in Wilmington, Delaware.(Anna Moneymaker/Getty Images)\nAlso on the list, as recounted by the New Republic:\nJoe Biden.\nKamala Harris.\nHillary Clinton.\nMerrick Garland.\nSamantha Power, who now runs the Agency for International Development.\nFormer Obama officials James Clapper; John Brennan; Peter Strzok (who trashed Trump in texts with his FBI girlfriend, Lisa Page), Andrew McCabe (FBI deputy director), Eric Holder and Loretta Lynch.\nA striking number areDonald Trump’s own appointees: Pat Cippolone (his White House counsel). Gina Haspel (his CIA director). Mark Esper. Charles Kupperman (his deputy national security adviser).\nTRUMP DROPPED MATT GAETZ AFTER COMPLAINING ABOUT HIGH POLITICAL COST OF DEFENDING HIM\nCassidy Hutchinson (Mark Meadows’ top aide, who criticized Trump in her testimony before the House Jan. 6 committee).\nIt’s a pretty big list. And having worked for Trump hardly provides immunity.\nPatel would have his work cut out for him, though he’d have to get a career prosecutor to submit a wiretap request or search warrant to the courts.\nMeanwhile, manyDemocratic lawmakersare hitting their party’s president pretty hard for the Hunter pardon, in interviewswith the Times.\nColorado Congressman Jason Crow: He promised he would not do this. I think it will make it harder for us going forward when we talk about upholding democracy.\"\nWashington Congresswoman Marie Gluesenkamp Perez: \"The president made the wrong decision. No family should be above the law.\"\nThe U.S. Department of Justice seal is displayed following a news conference in Washington, D.C., U.S. on Thursday, Dec. 20, 2018.(Yuri Gripas/Bloomberg via Getty Images)\nColorado Sen. Michael Bennet said the Biden move \"put personal interest ahead of duty and further erodes Americans’ faith that the justice system is fair and equal for all.\" And his late dropout from the race was also \"putting his personal interest ahead of his responsibility to the country.\"\nVermont Sen. Peter Welch: \"President Biden’s pardon of his son Hunter is, as the action of a loving father, understandable — but as the action of our nation’s chief executive, unwise.\"\nMichigan Sen. Gary Peters: \"Wrong.\"\nPretty bracing stuff.\nSome progressives defended Biden, such as Texas Congresswoman Jasmine Crockett: \"Way to go Joe!\" She said a 34-count convicted felon is about to walk into the White House, perhaps missing the news that Jack Smith has dropped the charges.\nOn \"Morning Joe\" yesterday, Mika Brzezinski, while saying she wished Biden hadn’t promised no pardon, took on the coverage: \"You look at what has happened on the Trump side, especially if you even parallel pardons that Trump has done himself, it’s just always so — it seems so hysterically imbalanced!\"\nJoe Scarborough spoke of \"the frustration that many Democrats are having on the New York Times, The Washington Post, the Wall Street Journal, a lot of mainstream organizations blowing this up to the size that they believe is really out of proportion, given everything Donald Trump has done in the past and what he’s doing right now.\"\nCLICK HERE TO GET THE FOX NEWS APP\nStill, the two presidents have wound up in the same place in their view of the Justice Department as partisan and politicized.\nOne fascinating tidbit dug up by the Times: When Biden had Trump to the White House, according to three sources, and listened to his familiar grievances about the biased DOJ – the president-elect \"surprised his host by sympathizing with the Biden family’s own troubles with the department.\"\nHoward Kurtz is the host of FOX News Channel'sMediaBuzz(Sundays 11 a.m.-12 p.m. ET). Based in Washington, D.C., he joined the network in July 2013 and regularly appears onSpecial Report with Bret Baierand other programs."}, {"source": "foxnews", "title": "Biden, Trump both rip DOJ after president pardons Hunter", "link": "https://www.foxnews.com/politics/biden-trump-both-rip-doj-after-president-pardons-hunter", "content": "Political strategist Lucy Caldwell and senior editor for Reason Magazine Robby Soave react to President-elect Donald Trump’s selection for Attorney General, Pam Bondi.\nThere is no other way to put it:Joe Bidenlied. Over and over.\nAfter repeatedly promising, pledging, vowing not to pardon his son Hunter, the President of the United States did exactly that.\nThe move amounted to a devastating vote of no confidence in his own Justice Department, matchingDonald Trump’sown denunciations of that very department.\nPRESIDENT BIDEN PARDONS SON HUNTER, SPARING HIM POSSIBLE PRISON SENTENCE\nTrump, who also pardoned several political allies during his first term, was quick to react on Truth Social:\n\"Does the pardon given by Joe to Hunter include the J-6 hostages, who have now been imprisoned for years? Such an abuse and miscarriage of Justice!\"\nAnd prominent Republicans are calling Biden a liar, with ample justification.\nBoth President Biden and President-elect Trump railed against the Justice Department following the former's pardon of his son, Hunter – albeit for markedly different reasons.(Reuters/Getty/AP Images)\nI think most people assumed that a father wouldn’t let his son go to jail. And if the president had explained it in those terms, he might have garnered some public sympathy. But he did not.\nYou know how the president often talks about \"my word as a Biden\"? I mistakenly assumed that he wouldn’t promise again and again not to pardon his son or commute his sentence if he had thought there was any possibility he would get Hunter off the legal hook.\nBut what is anyone going to do? He leaves office next month, his political career is over and the story will quickly fade.\nMEDIA ADMITS THE DEMOCRATIC PARTY IS TOO 'WOKE' AFTER KAMALA HARRIS' 2024 LOSS\nBiden sounded very much like Trump as he accused the DOJ, which he had long defended, of treating his son unfairly – swinging the political door wide open for the president-elect to retaliate against Justice, in part by naming longtime confidant Kash Patel to runthe FBI.\nBiden said his son had been \"selectively, and unfairly, prosecuted,\" and he blamed  political pressure on the special counsel named in the case.\n\"No reasonable person who looks at the facts of Hunter’s cases can reach any other conclusion than Hunter was singled out only because he is my son — and that is wrong. There has been an effort to break Hunter — who has been 5-1/2 years sober, even in the face of unrelenting attacks and selective prosecution. In trying to break Hunter, they’ve tried to break me — and there’s no reason to believe it will stop here. Enough is enough.\"\nMany were mistaken in their assumption that the President wouldn't pardon his son – however, with just under two months left of his term, and, presumably, his political career, Biden really has nothing to lose in doing so.(BRENDAN SMIALOWSKI/AFP via Getty Images)\nBut that bolsters the Trump argument that he too was singled out for selective prosecution by the DOJ – and will be in a position to do something about it.\nHunter put out his own statement after the Sunday pardon: \"I have admitted and taken responsibility for my mistakes during the darkest days of my addiction — mistakes that have been exploited to publicly humiliate and shame me and my family for political sport.\"\nThe feeble attempts by some in the media and in Democratic politics to defend Biden are just sad, because they only tell half the story.\nLet’s say Hunter Biden was in fact singled out for prosecution, that the case would have been routinely disposed of if his last name was Jones. (Hunter had already been convicted in one case and pleaded guilty in another to tax and gun-related charges.)\nBut as Hunter admitted in one email, it was his last name, when his father was vice president, that enabled him to land all those buckraking contracts from around the world. It’s why the Ukrainian energy giant Burisma hired him, why he was able to get moneyfrom China.\nTRUMP HIT FOR HIRING LOYALISTS LIKE PAM BONDI: DOESN’T EVERY PRESIDENT DO THAT?\nHunter had no expertise in any of these areas. What he had was a connection to a powerful father.\nThe pardon is so sweeping that it covers everything Hunter may have done from Jan. 1, 2004 through Sunday – which could be a way of his father protecting himself as well.\nKarine Jean-Pierre also told reporters on several occasions that Biden would not pardon Hunter.\nWhite House Press Secretary Karine Jean-Pierre repeatedly assured reporters that President Biden wouldn't pardon Hunter.(AP Photo/Evan Vucci)\nHunter Bidenon Sunday night released a statement noting his recovery from addiction and his sobriety:\n\"I have admitted and taken responsibility for my mistakes during the darkest days of my addiction — mistakes that have been exploited to publicly humiliate and shame me and my family for political sport.\"\nMark Halperin argues that Biden put his son in jeopardy by running for president, knowing the full range of Hunter’s addiction problems – and lied about Hunter not getting money from China and not helping his business clients (even if he just made small talk at a couple of group meetings).\nTRUMP NOMINATES KASH PATEL TO SERVE AS FBI DIRECTOR: 'ADVOCATE FOR TRUTH'\nMeanwhile, Trump’s choice of Kash Patel for the FBI (who would replace his own appointee, Chris Wray, who replaced the fired Jim Comey) has sparked a media backlash.\nOne thing no one can argue is that Patel lacks experience. He has been chief of staff atthe Pentagonand a deputy assistant to the president. In fact, he was a national security prosecutor in the Obama Justice Department, before Trump got into politics.\nBut on Steve Bannon’s podcast last year, Patel said: \"Yes, we're going to come after the people in the media who lied about American citizens who helped Joe Biden rig presidential elections. We're going to come after you, whether it's criminally or civilly.\"\nThe president-elect is facing a media firestorm of his own after he named Kash Patel the new FBI director over the weekend.(Photo by Anna Moneymaker/Getty Images)\nPatel has also said that on day one he’d shut down the FBI headquarters in Washington – ironically named for J. Edgar Hoover – and turn it into a museum on the \"deep state.\" Its 7,000 employees would be dispersed around the country.\nOne thing Biden never did was put any family members on the government payroll, as Trump did in naming Ivanka and her husband, Jared Kushner, to top White House positions in the first term.\nNow Trump is continuing that tradition by naming Charles Kushner, Jared’s father, as ambassador to France.\nSUBSCRIBE TO HOWIE'S MEDIA BUZZMETER PODCAST, A RIFF ON THE DAY'S HOTTEST STORIES\nThe elder Kushner had already served a couple of years in prison for a scheme that involved hiring a prostitute and sending the tape to his sister. But at least he had paid his dues when Trump later pardoned him, sparking Jared’s interest in prison reform.\nTrump also picked Massad Boulos – the father of Tiffany Trump’s husband – as White House adviser on Arab andMiddle Eastaffairs. All in the family.\nOne thing the press does is refer to Trump nominees as \"loyalists,\" as if that’s a dirty word. Sunday’s Washington Post had a headline describing \"loyalist Kash Patel.\"\nCLICK HERE TO GET THE FOX NEWS APP\nBut while Biden named an inner circle of aides who had been with him as long as four decades, they were not dismissed as loyalists. That’s because the media agree that these were the good guys. And who can forget former AG Eric Holder describing himself asBarack Obama’s\"wingman.\"\nThe Hunter pardon has set in motion a potential cycle of both presidents using the DOJ and FBI for purely partisan ends, and Joe Biden bears full responsibility for that.\nHoward Kurtz is the host of FOX News Channel'sMediaBuzz(Sundays 11 a.m.-12 p.m. ET). Based in Washington, D.C., he joined the network in July 2013 and regularly appears onSpecial Report with Bret Baierand other programs."}]